MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_exti_nmirr_field
{
  __IO  uint8_t NR         : 1;
} stc_exti_nmirr_field_t;

typedef struct stc_exti_nmicl_field
{
  __IO  uint8_t NCL        : 1;
} stc_exti_nmicl_field_t;

/******************************************************************************
 * INTREQ_MODULE
 ******************************************************************************/
/* INTREQ_MODULE register bit fields */
typedef struct stc_intreq_drqsel_field
{
  __IO uint32_t USBEP1     : 1;
  __IO uint32_t USBEP2     : 1;
  __IO uint32_t USBEP3     : 1;
  __IO uint32_t USBEP4     : 1;
  __IO uint32_t USBEP5     : 1;
  __IO uint32_t ADCSCAN0   : 1;
  __IO uint32_t ADCSCAN1   : 1;
  __IO uint32_t ADCSCAN2   : 1;
  __IO uint32_t IRQ0BT0    : 1;
  __IO uint32_t IRQ0BT2    : 1;
  __IO uint32_t IRQ0BT4    : 1;
  __IO uint32_t IRQ0BT6    : 1;
  __IO uint32_t MFS0RX     : 1;
  __IO uint32_t MFS0TX     : 1;
  __IO uint32_t MFS1RX     : 1;
  __IO uint32_t MFS1TX     : 1;
  __IO uint32_t MFS2RX     : 1;
  __IO uint32_t MFS2TX     : 1;
  __IO uint32_t MFS3RX     : 1;
  __IO uint32_t MFS3TX     : 1;
  __IO uint32_t MFS4RX     : 1;
  __IO uint32_t MFS4TX     : 1;
  __IO uint32_t MFS5RX     : 1;
  __IO uint32_t MFS5TX     : 1;
  __IO uint32_t MFS6RX     : 1;
  __IO uint32_t MFS6TX     : 1;
  __IO uint32_t MFS7RX     : 1;
  __IO uint32_t MFS7TX     : 1;
  __IO uint32_t EXINT0     : 1;
  __IO uint32_t EXINT1     : 1;
  __IO uint32_t EXINT2     : 1;
  __IO uint32_t EXINT3     : 1;
} stc_intreq_drqsel_field_t;

typedef struct stc_intreq_oddpks_field
{
  __IO uint8_t ODDPKS0     : 1;
  __IO uint8_t ODDPKS1     : 1;
  __IO uint8_t ODDPKS2     : 1;
  __IO uint8_t ODDPKS3     : 1;
  __IO uint8_t ODDPKS4     : 1;
} stc_intreq_oddpks_field_t;

typedef struct stc_intreq_oddpks1_field
{
  __IO uint8_t ODDPKS10    : 1;
  __IO uint8_t ODDPKS11    : 1;
  __IO uint8_t ODDPKS12    : 1;
  __IO uint8_t ODDPKS13    : 1;
  __IO uint8_t ODDPKS14    : 1;
} stc_intreq_oddpks1_field_t;

typedef struct stc_intreq_irq003sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq003sel_field_t;

typedef struct stc_intreq_irq004sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq004sel_field_t;

typedef struct stc_intreq_irq005sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq005sel_field_t;

typedef struct stc_intreq_irq006sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq006sel_field_t;

typedef struct stc_intreq_irq007sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq007sel_field_t;

typedef struct stc_intreq_irq008sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq008sel_field_t;

typedef struct stc_intreq_irq009sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq009sel_field_t;

typedef struct stc_intreq_irq010sel_field
{
  __IO uint32_t SELIRQ     : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t SELBIT     : 16;
} stc_intreq_irq010sel_field_t;

typedef struct stc_intreq_exc02mon_field
{
  __IO uint32_t NMI        : 1;
  __IO uint32_t HWINT      : 1;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq000mon_field
{
  __IO uint32_t FCSINT     : 1;
} stc_intreq_irq000mon_field_t;

typedef struct stc_intreq_irq001mon_field
{
  __IO uint32_t SWWDTINT   : 1;
} stc_intreq_irq001mon_field_t;

typedef struct stc_intreq_irq002mon_field
{
  __IO uint32_t LVDINT     : 1;
} stc_intreq_irq002mon_field_t;

typedef struct stc_intreq_irq003mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq003mon_field_t;

typedef struct stc_intreq_irq004mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq004mon_field_t;

typedef struct stc_intreq_irq005mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq005mon_field_t;

typedef struct stc_intreq_irq006mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq006mon_field_t;

typedef struct stc_intreq_irq007mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq007mon_field_t;

typedef struct stc_intreq_irq008mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq008mon_field_t;

typedef struct stc_intreq_irq009mon_field
{
  __IO uint32_t IRQBIT0    : 1;
  __IO uint32_t IRQBIT1    : 1;
  __IO uint32_t IRQBIT2    : 1;
  __IO uint32_t IRQBIT3    : 1;
  __IO uint32_t IRQBIT4    : 1;
  __IO uint32_t IRQBIT5    : 1;
  __IO uint32_t IRQBIT6    : 1;
  __IO uint32_t IRQBIT7    : 1;
} stc_intreq_irq009mon_field_t;

