MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/******************************************************************************
 * MFS_MODULE(COMMON)
 ******************************************************************************/
/* MFS_MODULE(COMMON) register bit fields */
typedef struct stc_mfs_smr_field
{
  union {
    struct {
      __IO  uint8_t SOE        : 1; /* for UART/CSIO/LIN */
            uint8_t RESERVED1  : 1;
      __IO  uint8_t BDS        : 1; /* for UART/CSIO */
      __IO  uint8_t SBL        : 1; /* for UART/LIN */
      __IO  uint8_t WUCR       : 1; /* for UART/LIN */
      __IO  uint8_t MD         : 3; /* for UART/CSIO/LIN/I2C */
    };
    struct {
            uint8_t RESERVED2  : 1;
      __IO  uint8_t SCKE       : 1; /* for CSIO */
            uint8_t RESERVED3  : 1;
      __IO  uint8_t SCINV      : 1; /* for CSIO */
            uint8_t RESERVED4  : 4;
    };
    struct {
            uint8_t RESERVED5  : 2;
      __IO  uint8_t TIE        : 1; /* for I2C */
      __IO  uint8_t RIE        : 1; /* for I2C */
            uint8_t RESERVED6  : 4;
    };
  };
} stc_mfs_smr_field_t;

typedef struct stc_mfs_scr_field
{
  union {
    struct {
      __IO  uint8_t TXE        : 1; /* for UART/CSIO/LIN */
      __IO  uint8_t RXE        : 1; /* for UART/CSIO/LIN */
      __IO  uint8_t TBIE       : 1; /* for UART/CSIO/LIN */
      __IO  uint8_t TIE        : 1; /* for UART/CSIO/LIN */
      __IO  uint8_t RIE        : 1; /* for UART/CSIO/LIN */
            uint8_t RESERVED1  : 2;
      __IO  uint8_t UPCL       : 1; /* for UART/CSIO/LIN */
    };
    struct {
            uint8_t RESERVED2  : 5;
      __IO  uint8_t SPI        : 1; /* for CSIO */
      __IO  uint8_t MS         : 1; /* for CSIO/LIN */
            uint8_t RESERVED3  : 1;
    };
    struct {
            uint8_t RESERVED4  : 5;
      __IO  uint8_t LBR        : 1; /* for LIN */
            uint8_t RESERVED5  : 2;
    };
  };
} stc_mfs_scr_field_t;

typedef struct stc_mfs_escr_field
{
  union {
    struct {
      __IO  uint8_t L          : 3; /* for UART/CSIO */
      __IO  uint8_t P          : 1; /* for UART */
      __IO  uint8_t PEN        : 1; /* for UART */
      __IO  uint8_t INV        : 1; /* for UART */
      __IO  uint8_t ESBL       : 1; /* for UART/LIN */
      __IO  uint8_t FLWEN      : 1; /* for UART */
    };
    struct {
      __IO  uint8_t L0         : 1; /* for UART/CSIO */
      __IO  uint8_t L1         : 1; /* for UART/CSIO */
      __IO  uint8_t L2         : 1; /* for UART/CSIO */
      __IO  uint8_t WT         : 2; /* for CSIO */
      __IO  uint8_t CSFE       : 1; /* for CSIO */
      __IO  uint8_t L3         : 1; /* for CSIO */
      __IO  uint8_t SOP        : 1; /* for CSIO */
    };
    struct {
            uint8_t RESERVED3  : 3;
      __IO  uint8_t WT0        : 1; /* for CSIO */
      __IO  uint8_t WT1        : 1; /* for CSIO */
            uint8_t RESERVED4  : 3;
    };
    struct {
      __IO  uint8_t DEL        : 2; /* for LIN */
      __IO  uint8_t LBL        : 2; /* for LIN */
      __IO  uint8_t LBIE       : 1; /* for LIN */
            uint8_t RESERVED5  : 3;
    };
    struct {
      __IO  uint8_t DEL0       : 1; /* for LIN */
      __IO  uint8_t DEL1       : 1; /* for LIN */
      __IO  uint8_t LBL0       : 1; /* for LIN */
      __IO  uint8_t LBL1       : 1; /* for LIN */
            uint8_t RESERVED6  : 4;
    };
  };
} stc_mfs_escr_field_t;

typedef struct stc_mfs_ssr_field
{
  union {
    struct {
      __IO  uint8_t TBI        : 1; /* for UART/CSIO/LIN/I2C */
      __IO  uint8_t TDRE       : 1; /* for UART/CSIO/LIN/I2C */
      __IO  uint8_t RDRF       : 1; /* for UART/CSIO/LIN/I2C */
      __IO  uint8_t ORE        : 1; /* for UART/CSIO/LIN/I2C */
      __IO  uint8_t FRE        : 1; /* for UART/LIN */
      __IO  uint8_t PE         : 1; /* for UART */
            uint8_t RESERVED1  : 1;
      __IO  uint8_t REC        : 1; /* for UART/CSIO/LIN/I2C */
    };
    struct {
            uint8_t RESERVED2  : 4;
      __IO  uint8_t AWC        : 1; /* for CSIO */
            uint8_t RESERVED3  : 3;
    };
    struct {
            uint8_t RESERVED4  : 5;
      __IO  uint8_t LBD        : 1; /* for LIN */
            uint8_t RESERVED5  : 2;
    };
    struct {
            uint8_t RESERVED6  : 4;
      __IO  uint8_t TBIE       : 1; /* for I2C */
      __IO  uint8_t DMA        : 1; /* for I2C */
      __IO  uint8_t TSET       : 1; /* for I2C */
            uint8_t RESERVED7  : 1;
    };
  };
} stc_mfs_ssr_field_t;

typedef struct stc_mfs_bgr_field
{
       uint16_t RESERVED1  : 15;
  __IO uint16_t EXT        : 1;
} stc_mfs_bgr_field_t;

typedef struct stc_mfs_bgr1_field
{
        uint8_t RESERVED1  : 7;
  __IO  uint8_t EXT        : 1;
} stc_mfs_bgr1_field_t;

typedef struct stc_mfs_fcr_field
{
  __IO uint16_t FE1        : 1;
  __IO uint16_t FE2        : 1;
  __IO uint16_t FCL1       : 1;
  __IO uint16_t FCL2       : 1;
  __IO uint16_t FSET       : 1;
  __IO uint16_t FLD        : 1;
  __IO uint16_t FLST       : 1;
       uint16_t RESERVED1  : 1;
  __IO uint16_t FSEL       : 1;
  __IO uint16_t FTIE       : 1;
  __IO uint16_t FDRQ       : 1;
  __IO uint16_t FRIIE      : 1;
  __IO uint16_t FLSTE      : 1;
       uint16_t RESERVED2  : 1;
  __IO uint16_t FTST0      : 1;
  __IO uint16_t FTST1      : 1;
} stc_mfs_fcr_field_t;

typedef struct stc_mfs_fcr0_field
{
  __IO  uint8_t FE1        : 1;
  __IO  uint8_t FE2        : 1;
  __IO  uint8_t FCL1       : 1;
  __IO  uint8_t FCL2       : 1;
  __IO  uint8_t FSET       : 1;
  __IO  uint8_t FLD        : 1;
  __IO  uint8_t FLST       : 1;
        uint8_t RESERVED1  : 1;
} stc_mfs_fcr0_field_t;

typedef struct stc_mfs_fcr1_field
{
  __IO  uint8_t FSEL       : 1;
  __IO  uint8_t FTIE       : 1;
  __IO  uint8_t FDRQ       : 1;
  __IO  uint8_t FRIIE      : 1;
  __IO  uint8_t FLSTE      : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t FTST0      : 1;
  __IO  uint8_t FTST1      : 1;
} stc_mfs_fcr1_field_t;

typedef struct stc_mfs_fbyte_field
{
  __IO uint16_t FD0        : 1;
  __IO uint16_t FD1        : 1;
  __IO uint16_t FD2        : 1;
  __IO uint16_t FD3        : 1;
  __IO uint16_t FD4        : 1;
  __IO uint16_t FD5        : 1;
  __IO uint16_t FD6        : 1;
  __IO uint16_t FD7        : 1;
  __IO uint16_t FD8        : 1;
  __IO uint16_t FD9        : 1;
  __IO uint16_t FD10       : 1;
  __IO uint16_t FD11       : 1;
  __IO uint16_t FD12       : 1;
  __IO uint16_t FD13       : 1;
  __IO uint16_t FD14       : 1;
  __IO uint16_t FD15       : 1;
} stc_mfs_fbyte_field_t;

typedef struct stc_mfs_fbyte1_field
{
  __IO  uint8_t FD0        : 1;
  __IO  uint8_t FD1        : 1;
  __IO  uint8_t FD2        : 1;
  __IO  uint8_t FD3        : 1;
  __IO  uint8_t FD4        : 1;
  __IO  uint8_t FD5        : 1;
  __IO  uint8_t FD6        : 1;
  __IO  uint8_t FD7        : 1;
} stc_mfs_fbyte1_field_t;

typedef struct stc_mfs_fbyte2_field
{
  __IO  uint8_t FD8        : 1;
  __IO  uint8_t FD9        : 1;
  __IO  uint8_t FD10       : 1;
  __IO  uint8_t FD11       : 1;
  __IO  uint8_t FD12       : 1;
  __IO  uint8_t FD13       : 1;
  __IO  uint8_t FD14       : 1;
  __IO  uint8_t FD15       : 1;
} stc_mfs_fbyte2_field_t;

