MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_rtc_wtcr13_field
{
  __IO uint8_t INTSSIE     : 1;
  __IO uint8_t INTSIE      : 1;
  __IO uint8_t INTMIE      : 1;
  __IO uint8_t INTHIE      : 1;
  __IO uint8_t INTTMIE     : 1;
  __IO uint8_t INTALIE     : 1;
  __IO uint8_t INTERIE     : 1;
  __IO uint8_t INTCRIE     : 1;
} stc_rtc_wtcr13_field_t;

typedef struct stc_rtc_wtcr20_field
{
  __IO uint8_t CREAD       : 1;
  __IO uint8_t CWRITE      : 1;
  __IO uint8_t BREAD       : 1;
  __IO uint8_t BWRITE      : 1;
  __IO uint8_t PREAD       : 1;
  __IO uint8_t PWRITE      : 1;
} stc_rtc_wtcr20_field_t;

typedef struct stc_rtc_wtcr21_field
{
  __IO uint8_t TMST        : 1;
  __IO uint8_t TMEN        : 1;
  __IO uint8_t TMRUN       : 1;
} stc_rtc_wtcr21_field_t;

typedef struct stc_rtc_wtsr_field
{
  union {
    struct {
      __IO  uint8_t S          : 4;
      __IO  uint8_t TS         : 3;
    };
    struct {
      __IO  uint8_t S0         : 1;
      __IO  uint8_t S1         : 1;
      __IO  uint8_t S2         : 1;
      __IO  uint8_t S3         : 1;
      __IO  uint8_t TS0        : 1;
      __IO  uint8_t TS1        : 1;
      __IO  uint8_t TS2        : 1;
    };
  };
} stc_rtc_wtsr_field_t;

typedef struct stc_rtc_wtmir_field
{
  union {
    struct {
      __IO  uint8_t MI         : 4;
      __IO  uint8_t TMI        : 3;
    };
    struct {
      __IO  uint8_t MI0        : 1;
      __IO  uint8_t MI1        : 1;
      __IO  uint8_t MI2        : 1;
      __IO  uint8_t MI3        : 1;
      __IO  uint8_t TMI0       : 1;
      __IO  uint8_t TMI1       : 1;
      __IO  uint8_t TMI2       : 1;
    };
  };
} stc_rtc_wtmir_field_t;

typedef struct stc_rtc_wthr_field
{
  union {
    struct {
      __IO  uint8_t H          : 4;
      __IO  uint8_t TH         : 2;
    };
    struct {
      __IO  uint8_t H0         : 1;
      __IO  uint8_t H1         : 1;
      __IO  uint8_t H2         : 1;
      __IO  uint8_t H3         : 1;
      __IO  uint8_t TH0        : 1;
      __IO  uint8_t TH1        : 1;
    };
  };
} stc_rtc_wthr_field_t;

typedef struct stc_rtc_wtdr_field
{
  union {
    struct {
      __IO  uint8_t D          : 4;
      __IO  uint8_t TD         : 2;
    };
    struct {
      __IO  uint8_t D0         : 1;
      __IO  uint8_t D1         : 1;
      __IO  uint8_t D2         : 1;
      __IO  uint8_t D3         : 1;
      __IO  uint8_t TD0        : 1;
      __IO  uint8_t TD1        : 1;
    };
  };
} stc_rtc_wtdr_field_t;

typedef struct stc_rtc_wtdw_field
{
  union {
    struct {
      __IO  uint8_t DW         : 3;
    };
    struct {
      __IO  uint8_t DW0        : 1;
      __IO  uint8_t DW1        : 1;
      __IO  uint8_t DW2        : 1;
    };
  };
} stc_rtc_wtdw_field_t;

typedef struct stc_rtc_wtmor_field
{
  union {
    struct {
      __IO  uint8_t MO         : 4;
      __IO  uint8_t TMO        : 1;
    };
    struct {
      __IO  uint8_t MO0        : 1;
      __IO  uint8_t MO1        : 1;
      __IO  uint8_t MO2        : 1;
      __IO  uint8_t MO3        : 1;
    };
  };
} stc_rtc_wtmor_field_t;

typedef struct stc_rtc_wtyr_field
{
  union {
    struct {
      __IO  uint8_t Y          : 4;
      __IO  uint8_t TY         : 4;
    };
    struct {
      __IO  uint8_t Y0         : 1;
      __IO  uint8_t Y1         : 1;
      __IO  uint8_t Y2         : 1;
      __IO  uint8_t Y3         : 1;
      __IO  uint8_t TY0        : 1;
      __IO  uint8_t TY1        : 1;
      __IO  uint8_t TY2        : 1;
      __IO  uint8_t TY3        : 1;
    };
  };
} stc_rtc_wtyr_field_t;

typedef struct stc_rtc_almir_field
{
  union {
    struct {
      __IO  uint8_t AMI        : 4;
      __IO  uint8_t TAMI       : 3;
    };
    struct {
      __IO  uint8_t AMI0       : 1;
      __IO  uint8_t AMI1       : 1;
      __IO  uint8_t AMI2       : 1;
      __IO  uint8_t AMI3       : 1;
      __IO  uint8_t TAMI0      : 1;
      __IO  uint8_t TAMI1      : 1;
      __IO  uint8_t TAMI2      : 1;
    };
  };
} stc_rtc_almir_field_t;

typedef struct stc_rtc_alhr_field
{
  union {
    struct {
      __IO  uint8_t AH         : 4;
      __IO  uint8_t TAH        : 2;
    };
    struct {
      __IO  uint8_t AH0        : 1;
      __IO  uint8_t AH1        : 1;
      __IO  uint8_t AH2        : 1;
      __IO  uint8_t AH3        : 1;
      __IO  uint8_t TAH0       : 1;
      __IO  uint8_t TAH1       : 1;
    };
  };
} stc_rtc_alhr_field_t;

typedef struct stc_rtc_aldr_field
{
  union {
    struct {
      __IO  uint8_t AD         : 4;
      __IO  uint8_t TAD        : 2;
    };
    struct {
      __IO  uint8_t AD0        : 1;
      __IO  uint8_t AD1        : 1;
      __IO  uint8_t AD2        : 1;
      __IO  uint8_t AD3        : 1;
      __IO  uint8_t TAD0       : 1;
      __IO  uint8_t TAD1       : 1;
    };
  };
} stc_rtc_aldr_field_t;

typedef struct stc_rtc_almor_field
{
  union {
    struct {
      __IO  uint8_t AMO        : 4;
      __IO  uint8_t TAMO       : 1;
    };
    struct {
      __IO  uint8_t AMO0       : 1;
      __IO  uint8_t AMO1       : 1;
      __IO  uint8_t AMO2       : 1;
      __IO  uint8_t AMO3       : 1;
    };
  };
} stc_rtc_almor_field_t;

typedef struct stc_rtc_alyr_field
{
  union {
    struct {
      __IO  uint8_t AY         : 4;
      __IO  uint8_t TAY        : 4;
    };
    struct {
      __IO  uint8_t AY0        : 1;
      __IO  uint8_t AY1        : 1;
      __IO  uint8_t AY2        : 1;
      __IO  uint8_t AY3        : 1;
      __IO  uint8_t TAY0       : 1;
      __IO  uint8_t TAY1       : 1;
      __IO  uint8_t TAY2       : 1;
      __IO  uint8_t TAY3       : 1;
    };
  };
} stc_rtc_alyr_field_t;

typedef struct stc_rtc_wttr0_field
{
  __IO uint8_t TM0         : 1;
  __IO uint8_t TM1         : 1;
  __IO uint8_t TM2         : 1;
  __IO uint8_t TM3         : 1;
  __IO uint8_t TM4         : 1;
  __IO uint8_t TM5         : 1;
  __IO uint8_t TM6         : 1;
  __IO uint8_t TM7         : 1;
} stc_rtc_wttr0_field_t;

typedef struct stc_rtc_wttr1_field
{
  __IO uint8_t TM8         : 1;
  __IO uint8_t TM9         : 1;
  __IO uint8_t TM10        : 1;
  __IO uint8_t TM11        : 1;
  __IO uint8_t TM12        : 1;
  __IO uint8_t TM13        : 1;
  __IO uint8_t TM14        : 1;
  __IO uint8_t TM15        : 1;
} stc_rtc_wttr1_field_t;

typedef struct stc_rtc_wttr2_field
{
  __IO uint8_t TM16        : 1;
  __IO uint8_t TM17        : 1;
} stc_rtc_wttr2_field_t;

typedef struct stc_rtc_wtcal0_field
{
  union {
    struct {
      __IO  uint8_t WTCAL0     : 8;
    };
    struct {
      __IO  uint8_t WTCAL00    : 1;
      __IO  uint8_t WTCAL01    : 1;
      __IO  uint8_t WTCAL02    : 1;
      __IO  uint8_t WTCAL03    : 1;
      __IO  uint8_t WTCAL04    : 1;
      __IO  uint8_t WTCAL05    : 1;
      __IO  uint8_t WTCAL06    : 1;
      __IO  uint8_t WTCAL07    : 1;
    };
  };
} stc_rtc_wtcal0_field_t;

typedef struct stc_rtc_wtcal1_field
{
  union {
    struct {
      __IO  uint8_t WTCAL1     : 2;
    };
    struct {
      __IO  uint8_t WTCAL10    : 1;
      __IO  uint8_t WTCAL11    : 1;
    };
  };
} stc_rtc_wtcal1_field_t;

