MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_clk_gating_cken2_field
{
  __IO uint32_t USBCK0     : 1;
  __IO uint32_t USBCK1     : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t CANCK0     : 1;
  __IO uint32_t CANCK1     : 1;
  __IO uint32_t CANCK2     : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SDCCK      : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t I2SCK0     : 1;
  __IO uint32_t I2SCK1     : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t PCRCCK     : 1;
       uint32_t RESERVED5  : 3;
  __IO uint32_t CECCK0     : 1;
  __IO uint32_t CECCK1     : 1;
       uint32_t RESERVED6  : 2;
  __IO uint32_t QSPICK     : 1;
} stc_clk_gating_cken2_field_t;

typedef struct stc_clk_gating_mrst2_field
{
  __IO uint32_t USBRST0    : 1;
  __IO uint32_t USBRST1    : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t CANRST0    : 1;
  __IO uint32_t CANRST1    : 1;
  __IO uint32_t CANRST2    : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SDCRST     : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t I2SRST0    : 1;
  __IO uint32_t I2SRST1    : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t PCRCRST    : 1;
       uint32_t RESERVED5  : 3;
  __IO uint32_t CECRST0    : 1;
  __IO uint32_t CECRST1    : 1;
       uint32_t RESERVED6  : 2;
  __IO uint32_t QSPIRST    : 1;
} stc_clk_gating_mrst2_field_t;

/******************************************************************************
 * I2SPRE_MODULE
 ******************************************************************************/
/* I2SPRE_MODULE register bit fields */
typedef struct stc_i2spre_iccr_field
{
  __IO uint32_t I2SEN      : 1;
  __IO uint32_t ICSEL      : 1;
} stc_i2spre_iccr_field_t;

typedef struct stc_i2spre_ipcr1_field
{
  __IO uint32_t IPLLEN     : 1;
} stc_i2spre_ipcr1_field_t;

typedef struct stc_i2spre_ipcr2_field
{
  __IO uint32_t IPOWT      : 3;
} stc_i2spre_ipcr2_field_t;

typedef struct stc_i2spre_ipcr3_field
{
  __IO uint32_t IPLLK      : 5;
} stc_i2spre_ipcr3_field_t;

typedef struct stc_i2spre_ipcr4_field
{
  __IO uint32_t IPLLN      : 7;
} stc_i2spre_ipcr4_field_t;

typedef struct stc_i2spre_ip_str_field
{
  __IO uint32_t IPRDY      : 1;
} stc_i2spre_ip_str_field_t;

typedef struct stc_i2spre_ipint_enr_field
{
  __IO uint32_t IPCSE      : 1;
} stc_i2spre_ipint_enr_field_t;

typedef struct stc_i2spre_ipint_clr_field
{
  __IO uint32_t IPCSC      : 1;
} stc_i2spre_ipint_clr_field_t;

typedef struct stc_i2spre_ipint_str_field
{
  __IO uint32_t IPCSI      : 1;
} stc_i2spre_ipint_str_field_t;

typedef struct stc_i2spre_ipcr5_field
{
  __IO uint32_t IPLLM      : 7;
} stc_i2spre_ipcr5_field_t;

typedef struct stc_i2spre_iccr_1_field
{
  __IO uint32_t I2SEN1     : 1;
  __IO uint32_t ICSEL1     : 1;
} stc_i2spre_iccr_1_field_t;

typedef struct stc_i2spre_ipcr5_1_field
{
  __IO uint32_t IPLLM1     : 7;
} stc_i2spre_ipcr5_1_field_t;

/******************************************************************************
 * GDCPRE_MODULE
 ******************************************************************************/
/* GDCPRE_MODULE register bit fields */
typedef struct stc_gdcpre_gccr_field
{
  __IO uint32_t GSSEN      : 1;
} stc_gdcpre_gccr_field_t;

typedef struct stc_gdcpre_gpcr1_field
{
  __IO uint32_t GPLLEN     : 1;
  __IO uint32_t GPINC      : 1;
} stc_gdcpre_gpcr1_field_t;

typedef struct stc_gdcpre_gpcr2_field
{
  __IO uint32_t GPOWT      : 3;
} stc_gdcpre_gpcr2_field_t;

typedef struct stc_gdcpre_gpcr3_field
{
  __IO uint32_t GPLLK      : 5;
} stc_gdcpre_gpcr3_field_t;

typedef struct stc_gdcpre_gpcr4_field
{
  __IO uint32_t GPLLN      : 7;
} stc_gdcpre_gpcr4_field_t;

typedef struct stc_gdcpre_gp_str_field
{
  __IO uint32_t GPRDY      : 1;
} stc_gdcpre_gp_str_field_t;

typedef struct stc_gdcpre_gpint_enr_field
{
  __IO uint32_t GPCSE      : 1;
} stc_gdcpre_gpint_enr_field_t;

typedef struct stc_gdcpre_gpint_clr_field
{
  __IO uint32_t GPCSC      : 1;
} stc_gdcpre_gpint_clr_field_t;

typedef struct stc_gdcpre_gpint_str_field
{
  __IO uint32_t GPCSI      : 1;
} stc_gdcpre_gpint_str_field_t;

typedef struct stc_gdcpre_gcsr_field
{
  __IO uint32_t ASEL       : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t ACG        : 1;
       uint32_t RESERVED2  : 3;
  __IO uint32_t PSEL       : 1;
       uint32_t RESERVED3  : 3;
  __IO uint32_t PCG        : 1;
} stc_gdcpre_gcsr_field_t;

typedef struct stc_gdcpre_grcr_field
{
  __IO uint32_t RSTEN      : 1;
} stc_gdcpre_grcr_field_t;

typedef struct stc_gdcpre_gmcr_field
{
  __IO uint32_t TEN        : 1;
} stc_gdcpre_gmcr_field_t;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* EXBUS_MODULE register bit fields */
typedef struct stc_exbus_mode_field
{
  __IO uint32_t WDTH       : 2;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t RDY        : 1;
  __IO uint32_t SHRTDOUT   : 1;
  __IO uint32_t MPXMODE    : 1;
  __IO uint32_t ALEINV     : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t MPXDOFF    : 1;
  __IO uint32_t MPXCSOF    : 1;
  __IO uint32_t MOEXEUP    : 1;
       uint32_t RESERVED2  : 18;
} stc_exbus_mode_field_t;

typedef struct stc_exbus_tim_field
{
  __IO uint32_t RACC       : 4;
  __IO uint32_t RADC       : 4;
  __IO uint32_t FRADC      : 4;
  __IO uint32_t RIDLC      : 4;
  __IO uint32_t WACC       : 4;
  __IO uint32_t WADC       : 4;
  __IO uint32_t WWEC       : 4;
  __IO uint32_t WIDLC      : 4;
} stc_exbus_tim_field_t;

typedef struct stc_exbus_area_field
{
  __IO uint32_t ADDR       : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK       : 7;
       uint32_t RESERVED2  : 9;
} stc_exbus_area_field_t;

typedef struct stc_exbus_atim_field
{
  __IO uint32_t ALC        : 4;
  __IO uint32_t ALES       : 4;
  __IO uint32_t ALEW       : 4;
       uint32_t RESERVED0  : 20;
} stc_exbus_atim_field_t;

typedef struct stc_exbus_sdmode_field
{
  __IO uint32_t SDON       : 1;
  __IO uint32_t PDON       : 1;
  __IO uint32_t ROFF       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t CASEL      : 2;
       uint32_t RESERVED2  : 2;
  __IO uint32_t RASEL      : 4;
  __IO uint32_t BASEL      : 4;
  __IO uint32_t MSDCLKOFF  : 1;
       uint32_t RESERVED3  : 15;
} stc_exbus_sdmode_field_t;

typedef struct stc_exbus_reftim_field
{
  __IO uint32_t REFC       : 16;
  __IO uint32_t NREF       : 8;
  __IO uint32_t PREF       : 1;
       uint32_t RESERVED0  : 7;
} stc_exbus_reftim_field_t;

