MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_sdif_spwswch_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_spwswch_field_t;

typedef struct stc_sdif_stunsetl_field
{
  __IO uint16_t TNPTSEL   : 8;
  __IO uint16_t TNPHSELEN : 1;
  __IO uint16_t TNERRBDSEL: 1;
  __IO uint16_t RETNTAPSEL: 1;
  __IO uint16_t RETNRNGSEL: 2;
       uint16_t RESERVED1 : 3;
} stc_sdif_stunsetl_field_t;

typedef struct stc_sdif_stunseth_field
{
  __IO uint16_t CMDCFCHKDS: 1;
       uint16_t RESERVED1 : 7;
  __IO uint16_t DTOTCNTVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_stunseth_field_t;

typedef struct stc_sdif_stunstl_field
{
  __IO uint16_t REP8TNRSLT: 8;
  __IO uint16_t REP3TNRSLT: 3;
       uint16_t RESERVED1 : 5;
} stc_sdif_stunstl_field_t;

typedef struct stc_sdif_stunsth_field
{
  __IO uint16_t PRSTTNPNT : 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_stunsth_field_t;

typedef struct stc_sdif_pswistl_field
{
  __IO uint16_t INT5MS    : 1;
  __IO uint16_t INT1MS    : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistl_field_t;

typedef struct stc_sdif_pswisth_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisth_field_t;


typedef struct stc_sdif_pswistel_field
{
  __IO uint16_t INT5MSSTS : 1;
  __IO uint16_t INT1MSSTS : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswistel_field_t;

typedef struct stc_sdif_pswisteh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisteh_field_t;

typedef struct stc_sdif_pswisgel_field
{
  __IO uint16_t INT5MSSGEN: 1;
  __IO uint16_t INT1MSSGEN: 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_pswisgel_field_t;

typedef struct stc_sdif_pswisgeh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_pswisgeh_field_t;

typedef struct stc_sdif_mmcsdcl_field
{
  __IO uint16_t LCKRSTESD : 1;
  __IO uint16_t RSTMMC    : 1;
  __IO uint16_t VCCCTLMMC : 1;
  __IO uint16_t VCCQCTLMMC: 1;
       uint16_t RESERVED1 : 4;
  __IO uint16_t MMCDDRSEL : 1;
  __IO uint16_t CMDDATDLY : 1;
       uint16_t RESERVED2 : 6;
} stc_sdif_mmcsdcl_field_t;

typedef struct stc_sdif_mmcsdch_field
{
  __IO uint16_t BTACKENMMC: 1;
  __IO uint16_t BTABTENMMC: 1;
  __IO uint16_t BTMDENMMC : 1;
       uint16_t RESERVED1 : 13;
} stc_sdif_mmcsdch_field_t;

typedef struct stc_sdif_mcwirqc0_field
{
  __IO uint16_t WTIRQEN   : 1;
  __IO uint16_t WTIRQST   : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_mcwirqc0_field_t;

typedef struct stc_sdif_mcwirqc1_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc1_field_t;

typedef struct stc_sdif_mcwirqc2_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc2_field_t;

typedef struct stc_sdif_mcwirqc3_field
{
  __IO uint16_t WTIRQCNCLR: 16;
} stc_sdif_mcwirqc3_field_t;

typedef struct stc_sdif_mcrpckbl_field
{
  __IO uint16_t CHECKBIT1 : 7;
  __IO uint16_t CHECKBIT2 : 6;
       uint16_t RESERVED1 : 3;
} stc_sdif_mcrpckbl_field_t;

typedef struct stc_sdif_mcrpckbh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_mcrpckbh_field_t;

typedef struct stc_sdif_scdetecs_field
{
       uint16_t RESERVED1 : 8;
  __IO uint16_t CDDEBTCVAL: 4;
       uint16_t RESERVED2 : 4;
} stc_sdif_scdetecs_field_t;

/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* GPIO_MODULE register bit fields */
typedef struct stc_gpio_pfr0_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
} stc_gpio_pfr0_field_t;

typedef struct stc_gpio_pfr1_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pfr1_field_t;

typedef struct stc_gpio_pfr2_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
} stc_gpio_pfr2_field_t;

typedef struct stc_gpio_pfr3_field
{
       uint32_t RESERVED1  : 3;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pfr3_field_t;

typedef struct stc_gpio_pfr4_field
{
       uint32_t RESERVED1  : 6;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
} stc_gpio_pfr4_field_t;

typedef struct stc_gpio_pfr5_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
} stc_gpio_pfr5_field_t;

typedef struct stc_gpio_pfr6_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
} stc_gpio_pfr6_field_t;

