MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_gpio_epfr26_field
{
  __IO uint32_t Q_SCKB     : 2;
  __IO uint32_t Q_CS0E     : 2;
       uint32_t RESERVED1  : 6;
  __IO uint32_t Q_IO0B     : 2;
  __IO uint32_t Q_IO1B     : 2;
  __IO uint32_t Q_IO2B     : 2;
  __IO uint32_t Q_IO3B     : 2;
} stc_gpio_epfr26_field_t;

typedef struct stc_gpio_epfr27_field
{
  __IO uint32_t HBCKE      : 2;
  __IO uint32_t HBCSX_0E   : 2;
  __IO uint32_t HBCSX_1E   : 2;
  __IO uint32_t HBRWDSB    : 2;
  __IO uint32_t HBDQ0B     : 2;
  __IO uint32_t HBDQ1B     : 2;
  __IO uint32_t HBDQ2B     : 2;
  __IO uint32_t HBDQ3B     : 2;
  __IO uint32_t HBDQ4B     : 2;
  __IO uint32_t HBDQ5B     : 2;
  __IO uint32_t HBDQ6B     : 2;
  __IO uint32_t HBDQ7B     : 2;
  __IO uint32_t HBWPXE     : 2;
  __IO uint32_t HBRESETXE  : 2;
  __IO uint32_t HBRSTOXS   : 2;
  __IO uint32_t HBINTXS    : 2;
} stc_gpio_epfr27_field_t;

typedef struct stc_gpio_epfr28_field
{
  __IO uint32_t PNL_PD0E   : 2;
  __IO uint32_t PNL_PD1E   : 2;
  __IO uint32_t PNL_PD2E   : 2;
  __IO uint32_t PNL_PD3E   : 2;
  __IO uint32_t PNL_PD4E   : 2;
  __IO uint32_t PNL_PD5E   : 2;
  __IO uint32_t PNL_PD6E   : 2;
  __IO uint32_t PNL_PD7E   : 2;
  __IO uint32_t PNL_PD8E   : 2;
  __IO uint32_t PNL_PD9E   : 2;
  __IO uint32_t PNL_PD10E  : 2;
  __IO uint32_t PNL_PD11E  : 2;
  __IO uint32_t PNL_PD12E  : 2;
  __IO uint32_t PNL_PD13E  : 2;
  __IO uint32_t PNL_PD14E  : 2;
  __IO uint32_t PNL_PD15E  : 2;
} stc_gpio_epfr28_field_t;

typedef struct stc_gpio_epfr29_field
{
  __IO uint32_t PNL_PD16E  : 2;
  __IO uint32_t PNL_PD17E  : 2;
  __IO uint32_t PNL_PD18E  : 2;
  __IO uint32_t PNL_PD19E  : 2;
  __IO uint32_t PNL_PD20E  : 2;
  __IO uint32_t PNL_PD21E  : 2;
  __IO uint32_t PNL_PD22E  : 2;
  __IO uint32_t PNL_PD23E  : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t PNL_TSIG5E : 2;
  __IO uint32_t PNL_TSIG6E : 2;
  __IO uint32_t PNL_TSIG7E : 2;
  __IO uint32_t PNL_TSIG8E : 2;
  __IO uint32_t PNL_TSIG9E : 2;
  __IO uint32_t PNL_TSIG10E: 2;
  __IO uint32_t PNL_TSIG11E: 2;
} stc_gpio_epfr29_field_t;

typedef struct stc_gpio_epfr30_field
{
  __IO uint32_t PNL_PWEE   : 2;
  __IO uint32_t PNL_DCLKE  : 2;
  __IO uint32_t PNL_DENE   : 2;
  __IO uint32_t PNL_LEE    : 2;
  __IO uint32_t PNL_FV_SYNCE: 2;
  __IO uint32_t PNL_LH_SYNCE: 2;
       uint32_t RESERVED1  : 4;
  __IO uint32_t PNL_TSIG0E : 2;
  __IO uint32_t PNL_TSIG1E : 2;
  __IO uint32_t PNL_TSIG2E : 2;
  __IO uint32_t PNL_TSIG3E : 2;
  __IO uint32_t PNL_TSIG4E : 2;
} stc_gpio_epfr30_field_t;

typedef struct stc_gpio_pzr0_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
} stc_gpio_pzr0_field_t;

typedef struct stc_gpio_pzr1_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzr1_field_t;

typedef struct stc_gpio_pzr2_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
} stc_gpio_pzr2_field_t;

typedef struct stc_gpio_pzr3_field
{
       uint32_t RESERVED1  : 3;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzr3_field_t;

typedef struct stc_gpio_pzr4_field
{
       uint32_t RESERVED1  : 6;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
} stc_gpio_pzr4_field_t;

typedef struct stc_gpio_pzr5_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
} stc_gpio_pzr5_field_t;

typedef struct stc_gpio_pzr6_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
} stc_gpio_pzr6_field_t;

typedef struct stc_gpio_pzr7_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
} stc_gpio_pzr7_field_t;

typedef struct stc_gpio_pzr8_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
} stc_gpio_pzr8_field_t;

typedef struct stc_gpio_pzr9_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
} stc_gpio_pzr9_field_t;

