MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_gpio_pzra_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
} stc_gpio_pzra_field_t;

typedef struct stc_gpio_pzrb_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
} stc_gpio_pzrb_field_t;

typedef struct stc_gpio_pzrc_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
} stc_gpio_pzrc_field_t;

typedef struct stc_gpio_pzrd_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
} stc_gpio_pzrd_field_t;

typedef struct stc_gpio_pzre_field
{
  __IO uint32_t P0         : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
} stc_gpio_pzre_field_t;

/******************************************************************************
 * CANFD_MODULE
 ******************************************************************************/
/* CANFD_MODULE register bit fields */
typedef struct stc_canfd_crel_field
{
  __IO uint32_t DAY        : 8;
  __IO uint32_t MON        : 8;
  __IO uint32_t YEAR       : 4;
  __IO uint32_t SUBSTEP    : 4;
  __IO uint32_t STEP       : 4;
  __IO uint32_t REL        : 4;
} stc_canfd_crel_field_t;

typedef struct stc_canfd_endn_field
{
  __IO uint32_t ETV        : 32;
} stc_canfd_endn_field_t;

typedef struct stc_canfd_fbtp_field
{
  __IO uint32_t FSJW       : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FTSEG2     : 3;
       uint32_t RESERVED2  : 1;
  __IO uint32_t FTSEG1     : 4;
       uint32_t RESERVED3  : 4;
  __IO uint32_t FBRP       : 5;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TDC        : 1;
  __IO uint32_t TDCO       : 5;
} stc_canfd_fbtp_field_t;

typedef struct stc_canfd_test_field
{
       uint32_t RESERVED1  : 4;
  __IO uint32_t LBCK       : 1;
  __IO uint32_t TX         : 2;
  __IO uint32_t RX         : 1;
  __IO uint32_t TDCV       : 6;
} stc_canfd_test_field_t;

typedef struct stc_canfd_rwd_field
{
  __IO uint32_t WDC        : 8;
  __IO uint32_t WDV        : 8;
} stc_canfd_rwd_field_t;

typedef struct stc_canfd_cccr_field
{
  __IO uint32_t INIT       : 1;
  __IO uint32_t CCE        : 1;
  __IO uint32_t ASM        : 1;
  __IO uint32_t CSA        : 1;
  __IO uint32_t CSR        : 1;
  __IO uint32_t MON        : 1;
  __IO uint32_t DAR        : 1;
  __IO uint32_t TEST       : 1;
  __IO uint32_t CME        : 2;
  __IO uint32_t CMR        : 2;
  __IO uint32_t FDO        : 1;
  __IO uint32_t FDBS       : 1;
  __IO uint32_t TXP        : 1;
} stc_canfd_cccr_field_t;

typedef struct stc_canfd_btp_field
{
  __IO uint32_t SJW        : 4;
  __IO uint32_t TSEG2      : 4;
  __IO uint32_t TSEG1      : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t BRP        : 10;
} stc_canfd_btp_field_t;

typedef struct stc_canfd_tscc_field
{
  __IO uint32_t TSS        : 2;
       uint32_t RESERVED1  : 14;
  __IO uint32_t TCP        : 4;
} stc_canfd_tscc_field_t;

typedef struct stc_canfd_tscv_field
{
  __IO uint32_t TSC        : 16;
} stc_canfd_tscv_field_t;

typedef struct stc_canfd_tocc_field
{
  __IO uint32_t ETOC       : 1;
  __IO uint32_t TOS        : 2;
       uint32_t RESERVED1  : 13;
  __IO uint32_t TOP        : 16;
} stc_canfd_tocc_field_t;

typedef struct stc_canfd_tocv_field
{
  __IO uint32_t TOC        : 16;
} stc_canfd_tocv_field_t;

typedef struct stc_canfd_ecr_field
{
  __IO uint32_t TEC        : 8;
  __IO uint32_t REC        : 7;
  __IO uint32_t RP         : 1;
  __IO uint32_t CEL        : 8;
} stc_canfd_ecr_field_t;

typedef struct stc_canfd_psr_field
{
  __IO uint32_t LEC        : 3;
  __IO uint32_t ACT        : 2;
  __IO uint32_t EP         : 1;
  __IO uint32_t EW         : 1;
  __IO uint32_t BO         : 1;
  __IO uint32_t FLEC       : 3;
  __IO uint32_t RESI       : 1;
  __IO uint32_t RBRS       : 1;
  __IO uint32_t REDL       : 1;
} stc_canfd_psr_field_t;

typedef struct stc_canfd_ir_field
{
  __IO uint32_t RF0N       : 1;
  __IO uint32_t RF0W       : 1;
  __IO uint32_t RF0F       : 1;
  __IO uint32_t RF0L       : 1;
  __IO uint32_t RF1N       : 1;
  __IO uint32_t RF1W       : 1;
  __IO uint32_t RF1F       : 1;
  __IO uint32_t RF1L       : 1;
  __IO uint32_t HPM        : 1;
  __IO uint32_t TC         : 1;
  __IO uint32_t TCF        : 1;
  __IO uint32_t TFE        : 1;
  __IO uint32_t TEFN       : 1;
  __IO uint32_t TEFW       : 1;
  __IO uint32_t TEFF       : 1;
  __IO uint32_t TEFL       : 1;
  __IO uint32_t TSW        : 1;
  __IO uint32_t MRAF       : 1;
  __IO uint32_t TOO        : 1;
  __IO uint32_t DRX        : 1;
  __IO uint32_t BEC        : 1;
  __IO uint32_t BEU        : 1;
  __IO uint32_t ELO        : 1;
  __IO uint32_t EP         : 1;
  __IO uint32_t EW         : 1;
  __IO uint32_t BO         : 1;
  __IO uint32_t WDI        : 1;
  __IO uint32_t CRCE       : 1;
  __IO uint32_t BE         : 1;
  __IO uint32_t ACKE       : 1;
  __IO uint32_t FOE        : 1;
  __IO uint32_t STE        : 1;
} stc_canfd_ir_field_t;

