MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_canfd_ie_field
{
  __IO uint32_t RF0NE      : 1;
  __IO uint32_t RF0WE      : 1;
  __IO uint32_t RF0FE      : 1;
  __IO uint32_t RF0LE      : 1;
  __IO uint32_t RF1NE      : 1;
  __IO uint32_t RF1WE      : 1;
  __IO uint32_t RF1FE      : 1;
  __IO uint32_t RF1LE      : 1;
  __IO uint32_t HPME       : 1;
  __IO uint32_t TCE        : 1;
  __IO uint32_t TCFE       : 1;
  __IO uint32_t TFEE       : 1;
  __IO uint32_t TEFNE      : 1;
  __IO uint32_t TEFWE      : 1;
  __IO uint32_t TEFFE      : 1;
  __IO uint32_t TEFLE      : 1;
  __IO uint32_t TSWE       : 1;
  __IO uint32_t MRAFE      : 1;
  __IO uint32_t TOOE       : 1;
  __IO uint32_t DRXE       : 1;
  __IO uint32_t BECE       : 1;
  __IO uint32_t BEUE       : 1;
  __IO uint32_t ELOE       : 1;
  __IO uint32_t EPE        : 1;
  __IO uint32_t EWE        : 1;
  __IO uint32_t BOE        : 1;
  __IO uint32_t WDIE       : 1;
  __IO uint32_t CRCEE      : 1;
  __IO uint32_t BEE        : 1;
  __IO uint32_t ACKEE      : 1;
  __IO uint32_t FOEE       : 1;
  __IO uint32_t STEE       : 1;
} stc_canfd_ie_field_t;

typedef struct stc_canfd_ils_field
{
  __IO uint32_t RF0NL      : 1;
  __IO uint32_t RF0WL      : 1;
  __IO uint32_t RF0FL      : 1;
  __IO uint32_t RF0LL      : 1;
  __IO uint32_t RF1NL      : 1;
  __IO uint32_t RF1WL      : 1;
  __IO uint32_t RF1FL      : 1;
  __IO uint32_t RF1LL      : 1;
  __IO uint32_t HPML       : 1;
  __IO uint32_t TCL        : 1;
  __IO uint32_t TCFL       : 1;
  __IO uint32_t TFEL       : 1;
  __IO uint32_t TEFNL      : 1;
  __IO uint32_t TEFWL      : 1;
  __IO uint32_t TEFFL      : 1;
  __IO uint32_t TEFLL      : 1;
  __IO uint32_t TSWL       : 1;
  __IO uint32_t MRAFL      : 1;
  __IO uint32_t TOOL       : 1;
  __IO uint32_t DRXL       : 1;
  __IO uint32_t BECL       : 1;
  __IO uint32_t BEUL       : 1;
  __IO uint32_t ELOL       : 1;
  __IO uint32_t EPL        : 1;
  __IO uint32_t EWL        : 1;
  __IO uint32_t BOL        : 1;
  __IO uint32_t WDIL       : 1;
  __IO uint32_t CRCEL      : 1;
  __IO uint32_t BEL        : 1;
  __IO uint32_t ACKEL      : 1;
  __IO uint32_t FOEL       : 1;
  __IO uint32_t STEL       : 1;
} stc_canfd_ils_field_t;

typedef struct stc_canfd_ile_field
{
  __IO uint32_t EINT0      : 1;
  __IO uint32_t EINT1      : 1;
} stc_canfd_ile_field_t;

typedef struct stc_canfd_gfc_field
{
  __IO uint32_t RRFE       : 1;
  __IO uint32_t RRFS       : 1;
  __IO uint32_t ANFE       : 2;
  __IO uint32_t ANFS       : 2;
} stc_canfd_gfc_field_t;

typedef struct stc_canfd_sidfc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t FLSSA      : 14;
  __IO uint32_t LSS        : 8;
} stc_canfd_sidfc_field_t;

typedef struct stc_canfd_xidfc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t FLESA      : 14;
  __IO uint32_t LSE        : 7;
} stc_canfd_xidfc_field_t;

typedef struct stc_canfd_xidam_field
{
  __IO uint32_t EIDM       : 29;
} stc_canfd_xidam_field_t;

typedef struct stc_canfd_hpms_field
{
  __IO uint32_t BIDX       : 6;
  __IO uint32_t MSI        : 2;
  __IO uint32_t FIDX       : 7;
  __IO uint32_t FLST       : 1;
} stc_canfd_hpms_field_t;

typedef struct stc_canfd_ndat1_field
{
  __IO uint32_t ND0        : 1;
  __IO uint32_t ND1        : 1;
  __IO uint32_t ND2        : 1;
  __IO uint32_t ND3        : 1;
  __IO uint32_t ND4        : 1;
  __IO uint32_t ND5        : 1;
  __IO uint32_t ND6        : 1;
  __IO uint32_t ND7        : 1;
  __IO uint32_t ND8        : 1;
  __IO uint32_t ND9        : 1;
  __IO uint32_t ND10       : 1;
  __IO uint32_t ND11       : 1;
  __IO uint32_t ND12       : 1;
  __IO uint32_t ND13       : 1;
  __IO uint32_t ND14       : 1;
  __IO uint32_t ND15       : 1;
  __IO uint32_t ND16       : 1;
  __IO uint32_t ND17       : 1;
  __IO uint32_t ND18       : 1;
  __IO uint32_t ND19       : 1;
  __IO uint32_t ND20       : 1;
  __IO uint32_t ND21       : 1;
  __IO uint32_t ND22       : 1;
  __IO uint32_t ND23       : 1;
  __IO uint32_t ND24       : 1;
  __IO uint32_t ND25       : 1;
  __IO uint32_t ND26       : 1;
  __IO uint32_t ND27       : 1;
  __IO uint32_t ND28       : 1;
  __IO uint32_t ND29       : 1;
  __IO uint32_t ND30       : 1;
  __IO uint32_t ND31       : 1;
} stc_canfd_ndat1_field_t;

typedef struct stc_canfd_ndat2_field
{
  __IO uint32_t ND32       : 1;
  __IO uint32_t ND33       : 1;
  __IO uint32_t ND34       : 1;
  __IO uint32_t ND35       : 1;
  __IO uint32_t ND36       : 1;
  __IO uint32_t ND37       : 1;
  __IO uint32_t ND38       : 1;
  __IO uint32_t ND39       : 1;
  __IO uint32_t ND40       : 1;
  __IO uint32_t ND41       : 1;
  __IO uint32_t ND42       : 1;
  __IO uint32_t ND43       : 1;
  __IO uint32_t ND44       : 1;
  __IO uint32_t ND45       : 1;
  __IO uint32_t ND46       : 1;
  __IO uint32_t ND47       : 1;
  __IO uint32_t ND48       : 1;
  __IO uint32_t ND49       : 1;
  __IO uint32_t ND50       : 1;
  __IO uint32_t ND51       : 1;
  __IO uint32_t ND52       : 1;
  __IO uint32_t ND53       : 1;
  __IO uint32_t ND54       : 1;
  __IO uint32_t ND55       : 1;
  __IO uint32_t ND56       : 1;
  __IO uint32_t ND57       : 1;
  __IO uint32_t ND58       : 1;
  __IO uint32_t ND59       : 1;
  __IO uint32_t ND60       : 1;
  __IO uint32_t ND61       : 1;
  __IO uint32_t ND62       : 1;
  __IO uint32_t ND63       : 1;
} stc_canfd_ndat2_field_t;

typedef struct stc_canfd_rxf0c_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t F0SA       : 14;
  __IO uint32_t F0S        : 7;
       uint32_t RESERVED2  : 1;
  __IO uint32_t F0WM       : 7;
  __IO uint32_t F0OM       : 1;
} stc_canfd_rxf0c_field_t;

typedef struct stc_canfd_rxf0s_field
{
  __IO uint32_t F0FL       : 7;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F0GI       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t F0PI       : 6;
       uint32_t RESERVED3  : 2;
  __IO uint32_t F0F        : 1;
  __IO uint32_t RF0L       : 1;
} stc_canfd_rxf0s_field_t;

typedef struct stc_canfd_rxf0a_field
{
  __IO uint32_t F0AI       : 6;
} stc_canfd_rxf0a_field_t;

typedef struct stc_canfd_rxbc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t RBSA       : 14;
} stc_canfd_rxbc_field_t;

typedef struct stc_canfd_rxf1c_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t F1SA       : 14;
  __IO uint32_t F1S        : 7;
       uint32_t RESERVED2  : 1;
  __IO uint32_t F1WM       : 7;
  __IO uint32_t F1OM       : 1;
} stc_canfd_rxf1c_field_t;

typedef struct stc_canfd_rxf1s_field
{
  __IO uint32_t F1FL       : 7;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F1GI       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t F1PI       : 6;
       uint32_t RESERVED3  : 2;
  __IO uint32_t F1F        : 1;
  __IO uint32_t RF1L       : 1;
       uint32_t RESERVED4  : 4;
  __IO uint32_t DMS        : 2;
} stc_canfd_rxf1s_field_t;

typedef struct stc_canfd_rxf1a_field
{
  __IO uint32_t F1AI       : 6;
} stc_canfd_rxf1a_field_t;

typedef struct stc_canfd_rxesc_field
{
  __IO uint32_t F0DS       : 3;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F1DS       : 3;
       uint32_t RESERVED2  : 1;
  __IO uint32_t RBDS       : 3;
} stc_canfd_rxesc_field_t;

typedef struct stc_canfd_txbc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TBSA       : 14;
  __IO uint32_t NDTB       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TFQS       : 6;
  __IO uint32_t TFQM       : 1;
} stc_canfd_txbc_field_t;

typedef struct stc_canfd_txfqs_field
{
  __IO uint32_t TFFL       : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TFGI       : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t TFQPI      : 5;
  __IO uint32_t TFQF       : 1;
} stc_canfd_txfqs_field_t;

typedef struct stc_canfd_txesc_field
{
  __IO uint32_t TBDS       : 3;
} stc_canfd_txesc_field_t;

typedef struct stc_canfd_txbrp_field
{
  __IO uint32_t TRP0       : 1;
  __IO uint32_t TRP1       : 1;
  __IO uint32_t TRP2       : 1;
  __IO uint32_t TRP3       : 1;
  __IO uint32_t TRP4       : 1;
  __IO uint32_t TRP5       : 1;
  __IO uint32_t TRP6       : 1;
  __IO uint32_t TRP7       : 1;
  __IO uint32_t TRP8       : 1;
  __IO uint32_t TRP9       : 1;
  __IO uint32_t TRP10      : 1;
  __IO uint32_t TRP11      : 1;
  __IO uint32_t TRP12      : 1;
  __IO uint32_t TRP13      : 1;
  __IO uint32_t TRP14      : 1;
  __IO uint32_t TRP15      : 1;
  __IO uint32_t TRP16      : 1;
  __IO uint32_t TRP17      : 1;
  __IO uint32_t TRP18      : 1;
  __IO uint32_t TRP19      : 1;
  __IO uint32_t TRP20      : 1;
  __IO uint32_t TRP21      : 1;
  __IO uint32_t TRP22      : 1;
  __IO uint32_t TRP23      : 1;
  __IO uint32_t TRP24      : 1;
  __IO uint32_t TRP25      : 1;
  __IO uint32_t TRP26      : 1;
  __IO uint32_t TRP27      : 1;
  __IO uint32_t TRP28      : 1;
  __IO uint32_t TRP29      : 1;
  __IO uint32_t TRP30      : 1;
  __IO uint32_t TRP31      : 1;
} stc_canfd_txbrp_field_t;

