MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_canfd_txbar_field
{
  __IO uint32_t AR0        : 1;
  __IO uint32_t AR1        : 1;
  __IO uint32_t AR2        : 1;
  __IO uint32_t AR3        : 1;
  __IO uint32_t AR4        : 1;
  __IO uint32_t AR5        : 1;
  __IO uint32_t AR6        : 1;
  __IO uint32_t AR7        : 1;
  __IO uint32_t AR8        : 1;
  __IO uint32_t AR9        : 1;
  __IO uint32_t AR10       : 1;
  __IO uint32_t AR11       : 1;
  __IO uint32_t AR12       : 1;
  __IO uint32_t AR13       : 1;
  __IO uint32_t AR14       : 1;
  __IO uint32_t AR15       : 1;
  __IO uint32_t AR16       : 1;
  __IO uint32_t AR17       : 1;
  __IO uint32_t AR18       : 1;
  __IO uint32_t AR19       : 1;
  __IO uint32_t AR20       : 1;
  __IO uint32_t AR21       : 1;
  __IO uint32_t AR22       : 1;
  __IO uint32_t AR23       : 1;
  __IO uint32_t AR24       : 1;
  __IO uint32_t AR25       : 1;
  __IO uint32_t AR26       : 1;
  __IO uint32_t AR27       : 1;
  __IO uint32_t AR28       : 1;
  __IO uint32_t AR29       : 1;
  __IO uint32_t AR30       : 1;
  __IO uint32_t AR31       : 1;
} stc_canfd_txbar_field_t;

typedef struct stc_canfd_txbcr_field
{
  __IO uint32_t CR0        : 1;
  __IO uint32_t CR1        : 1;
  __IO uint32_t CR2        : 1;
  __IO uint32_t CR3        : 1;
  __IO uint32_t CR4        : 1;
  __IO uint32_t CR5        : 1;
  __IO uint32_t CR6        : 1;
  __IO uint32_t CR7        : 1;
  __IO uint32_t CR8        : 1;
  __IO uint32_t CR9        : 1;
  __IO uint32_t CR10       : 1;
  __IO uint32_t CR11       : 1;
  __IO uint32_t CR12       : 1;
  __IO uint32_t CR13       : 1;
  __IO uint32_t CR14       : 1;
  __IO uint32_t CR15       : 1;
  __IO uint32_t CR16       : 1;
  __IO uint32_t CR17       : 1;
  __IO uint32_t CR18       : 1;
  __IO uint32_t CR19       : 1;
  __IO uint32_t CR20       : 1;
  __IO uint32_t CR21       : 1;
  __IO uint32_t CR22       : 1;
  __IO uint32_t CR23       : 1;
  __IO uint32_t CR24       : 1;
  __IO uint32_t CR25       : 1;
  __IO uint32_t CR26       : 1;
  __IO uint32_t CR27       : 1;
  __IO uint32_t CR28       : 1;
  __IO uint32_t CR29       : 1;
  __IO uint32_t CR30       : 1;
  __IO uint32_t CR31       : 1;
} stc_canfd_txbcr_field_t;

typedef struct stc_canfd_txbto_field
{
  __IO uint32_t TO0        : 1;
  __IO uint32_t TO1        : 1;
  __IO uint32_t TO2        : 1;
  __IO uint32_t TO3        : 1;
  __IO uint32_t TO4        : 1;
  __IO uint32_t TO5        : 1;
  __IO uint32_t TO6        : 1;
  __IO uint32_t TO7        : 1;
  __IO uint32_t TO8        : 1;
  __IO uint32_t TO9        : 1;
  __IO uint32_t TO10       : 1;
  __IO uint32_t TO11       : 1;
  __IO uint32_t TO12       : 1;
  __IO uint32_t TO13       : 1;
  __IO uint32_t TO14       : 1;
  __IO uint32_t TO15       : 1;
  __IO uint32_t TO16       : 1;
  __IO uint32_t TO17       : 1;
  __IO uint32_t TO18       : 1;
  __IO uint32_t TO19       : 1;
  __IO uint32_t TO20       : 1;
  __IO uint32_t TO21       : 1;
  __IO uint32_t TO22       : 1;
  __IO uint32_t TO23       : 1;
  __IO uint32_t TO24       : 1;
  __IO uint32_t TO25       : 1;
  __IO uint32_t TO26       : 1;
  __IO uint32_t TO27       : 1;
  __IO uint32_t TO28       : 1;
  __IO uint32_t TO29       : 1;
  __IO uint32_t TO30       : 1;
  __IO uint32_t TO31       : 1;
} stc_canfd_txbto_field_t;

typedef struct stc_canfd_txbcf_field
{
  __IO uint32_t CF0        : 1;
  __IO uint32_t CF1        : 1;
  __IO uint32_t CF2        : 1;
  __IO uint32_t CF3        : 1;
  __IO uint32_t CF4        : 1;
  __IO uint32_t CF5        : 1;
  __IO uint32_t CF6        : 1;
  __IO uint32_t CF7        : 1;
  __IO uint32_t CF8        : 1;
  __IO uint32_t CF9        : 1;
  __IO uint32_t CF10       : 1;
  __IO uint32_t CF11       : 1;
  __IO uint32_t CF12       : 1;
  __IO uint32_t CF13       : 1;
  __IO uint32_t CF14       : 1;
  __IO uint32_t CF15       : 1;
  __IO uint32_t CF16       : 1;
  __IO uint32_t CF17       : 1;
  __IO uint32_t CF18       : 1;
  __IO uint32_t CF19       : 1;
  __IO uint32_t CF20       : 1;
  __IO uint32_t CF21       : 1;
  __IO uint32_t CF22       : 1;
  __IO uint32_t CF23       : 1;
  __IO uint32_t CF24       : 1;
  __IO uint32_t CF25       : 1;
  __IO uint32_t CF26       : 1;
  __IO uint32_t CF27       : 1;
  __IO uint32_t CF28       : 1;
  __IO uint32_t CF29       : 1;
  __IO uint32_t CF30       : 1;
  __IO uint32_t CF31       : 1;
} stc_canfd_txbcf_field_t;

typedef struct stc_canfd_txbtie_field
{
  __IO uint32_t TIE0       : 1;
  __IO uint32_t TIE1       : 1;
  __IO uint32_t TIE2       : 1;
  __IO uint32_t TIE3       : 1;
  __IO uint32_t TIE4       : 1;
  __IO uint32_t TIE5       : 1;
  __IO uint32_t TIE6       : 1;
  __IO uint32_t TIE7       : 1;
  __IO uint32_t TIE8       : 1;
  __IO uint32_t TIE9       : 1;
  __IO uint32_t TIE10      : 1;
  __IO uint32_t TIE11      : 1;
  __IO uint32_t TIE12      : 1;
  __IO uint32_t TIE13      : 1;
  __IO uint32_t TIE14      : 1;
  __IO uint32_t TIE15      : 1;
  __IO uint32_t TIE16      : 1;
  __IO uint32_t TIE17      : 1;
  __IO uint32_t TIE18      : 1;
  __IO uint32_t TIE19      : 1;
  __IO uint32_t TIE20      : 1;
  __IO uint32_t TIE21      : 1;
  __IO uint32_t TIE22      : 1;
  __IO uint32_t TIE23      : 1;
  __IO uint32_t TIE24      : 1;
  __IO uint32_t TIE25      : 1;
  __IO uint32_t TIE26      : 1;
  __IO uint32_t TIE27      : 1;
  __IO uint32_t TIE28      : 1;
  __IO uint32_t TIE29      : 1;
  __IO uint32_t TIE30      : 1;
  __IO uint32_t TIE31      : 1;
} stc_canfd_txbtie_field_t;

typedef struct stc_canfd_txbcie_field
{
  __IO uint32_t CFIE0      : 1;
  __IO uint32_t CFIE1      : 1;
  __IO uint32_t CFIE2      : 1;
  __IO uint32_t CFIE3      : 1;
  __IO uint32_t CFIE4      : 1;
  __IO uint32_t CFIE5      : 1;
  __IO uint32_t CFIE6      : 1;
  __IO uint32_t CFIE7      : 1;
  __IO uint32_t CFIE8      : 1;
  __IO uint32_t CFIE9      : 1;
  __IO uint32_t CFIE10     : 1;
  __IO uint32_t CFIE11     : 1;
  __IO uint32_t CFIE12     : 1;
  __IO uint32_t CFIE13     : 1;
  __IO uint32_t CFIE14     : 1;
  __IO uint32_t CFIE15     : 1;
  __IO uint32_t CFIE16     : 1;
  __IO uint32_t CFIE17     : 1;
  __IO uint32_t CFIE18     : 1;
  __IO uint32_t CFIE19     : 1;
  __IO uint32_t CFIE20     : 1;
  __IO uint32_t CFIE21     : 1;
  __IO uint32_t CFIE22     : 1;
  __IO uint32_t CFIE23     : 1;
  __IO uint32_t CFIE24     : 1;
  __IO uint32_t CFIE25     : 1;
  __IO uint32_t CFIE26     : 1;
  __IO uint32_t CFIE27     : 1;
  __IO uint32_t CFIE28     : 1;
  __IO uint32_t CFIE29     : 1;
  __IO uint32_t CFIE30     : 1;
  __IO uint32_t CFIE31     : 1;
} stc_canfd_txbcie_field_t;

typedef struct stc_canfd_txefc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t EFSA       : 14;
  __IO uint32_t EFS        : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t EFWM       : 6;
} stc_canfd_txefc_field_t;

typedef struct stc_canfd_txfs_field
{
  __IO uint32_t EFFL       : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t EFGI       : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t EFPI       : 5;
       uint32_t RESERVED3  : 3;
  __IO uint32_t EFF        : 1;
  __IO uint32_t TEFL       : 1;
} stc_canfd_txfs_field_t;

typedef struct stc_canfd_txfa_field
{
  __IO uint32_t EFAI       : 5;
} stc_canfd_txfa_field_t;

