MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_canfd_fdecr_field
{
  __IO  uint8_t SEIE       : 1;
  __IO  uint8_t DEIE       : 1;
  __IO  uint8_t CEREN      : 1;
  __IO  uint8_t CEIV       : 1;
} stc_canfd_fdecr_field_t;

typedef struct stc_canfd_fdesr_field
{
  __IO  uint8_t SEI        : 1;
  __IO  uint8_t DEI        : 1;
} stc_canfd_fdesr_field_t;

typedef struct stc_canfd_fdsear_field
{
  __IO uint16_t SRA        : 16;
} stc_canfd_fdsear_field_t;

typedef struct stc_canfd_fdescr_field
{
  __IO  uint8_t SEIC       : 1;
  __IO  uint8_t DEIC       : 1;
} stc_canfd_fdescr_field_t;

typedef struct stc_canfd_fddear_field
{
  __IO uint16_t DRA        : 16;
} stc_canfd_fddear_field_t;

typedef struct stc_canfd_tscntr_field
{
  __IO uint16_t CCLR       : 1;
} stc_canfd_tscntr_field_t;

typedef struct stc_canfd_tsmdr_field
{
  __IO uint16_t CNTEN      : 1;
} stc_canfd_tsmdr_field_t;

typedef struct stc_canfd_tsdivr_field
{
  __IO uint32_t CDIV       : 16;
} stc_canfd_tsdivr_field_t;

typedef struct stc_canfd_tscdtr_field
{
  __IO uint16_t CNT        : 16;
} stc_canfd_tscdtr_field_t;

typedef struct stc_canfd_tscpclr_field
{
  __IO uint16_t CMP        : 16;
} stc_canfd_tscpclr_field_t;

/******************************************************************************
 * PCRC_MODULE
 ******************************************************************************/
/* PCRC_MODULE register bit fields */
typedef struct stc_pcrc_prgcrc_cfg_field
{
  __IO uint32_t CIRQCLR    : 1;
       uint32_t RESERVED0  : 7;
  __IO uint32_t FO         : 2;
  __IO uint32_t FI         : 2;
       uint32_t RESERVED1  : 4;
  __IO uint32_t TEST       : 6;
  __IO uint32_t SZ         : 2;
  __IO uint32_t CIRQ       : 1;
  __IO uint32_t CIEN       : 1;
  __IO uint32_t CDEN       : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t LOCK       : 1;
} stc_pcrc_prgcrc_cfg_field_t;

/******************************************************************************
 * HSSPI_MODULE
 ******************************************************************************/
/* HSSPI_MODULE register bit fields */
typedef struct stc_hsspi_mctrl_field
{
  __IO uint32_t MEN        : 1;
  __IO uint32_t CSEN       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t MES        : 1;
  __IO uint32_t SYNCON     : 1;
} stc_hsspi_mctrl_field_t;

typedef struct stc_hsspi_pcc0_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc0_field_t;

typedef struct stc_hsspi_pcc1_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc1_field_t;

typedef struct stc_hsspi_pcc2_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc2_field_t;

typedef struct stc_hsspi_pcc3_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc3_field_t;

typedef struct stc_hsspi_txf_field
{
  __IO uint32_t TFFS       : 1;
  __IO uint32_t TFES       : 1;
  __IO uint32_t TFOS       : 1;
  __IO uint32_t TFUS       : 1;
  __IO uint32_t TFLETS     : 1;
  __IO uint32_t TFMTS      : 1;
  __IO uint32_t TSSRS      : 1;
} stc_hsspi_txf_field_t;

typedef struct stc_hsspi_txe_field
{
  __IO uint32_t TFFE       : 1;
  __IO uint32_t TFEE       : 1;
  __IO uint32_t TFOE       : 1;
  __IO uint32_t TFUE       : 1;
  __IO uint32_t TFLETE     : 1;
  __IO uint32_t TFMTE      : 1;
  __IO uint32_t TSSRE      : 1;
} stc_hsspi_txe_field_t;

typedef struct stc_hsspi_txc_field
{
  __IO uint32_t TFFC       : 1;
  __IO uint32_t TFEC       : 1;
  __IO uint32_t TFOC       : 1;
  __IO uint32_t TFUC       : 1;
  __IO uint32_t TFLETC     : 1;
  __IO uint32_t TFMTC      : 1;
  __IO uint32_t TSSRC      : 1;
} stc_hsspi_txc_field_t;

typedef struct stc_hsspi_rxf_field
{
  __IO uint32_t RFFS       : 1;
  __IO uint32_t RFES       : 1;
  __IO uint32_t RFOS       : 1;
  __IO uint32_t RFUS       : 1;
  __IO uint32_t RFLETS     : 1;
  __IO uint32_t RFMTS      : 1;
  __IO uint32_t RSSRS      : 1;
} stc_hsspi_rxf_field_t;

typedef struct stc_hsspi_rxe_field
{
  __IO uint32_t RFFE       : 1;
  __IO uint32_t RFEE       : 1;
  __IO uint32_t RFOE       : 1;
  __IO uint32_t RFUE       : 1;
  __IO uint32_t RFLETE     : 1;
  __IO uint32_t RFMTE      : 1;
  __IO uint32_t RSSRE      : 1;
} stc_hsspi_rxe_field_t;

typedef struct stc_hsspi_rxc_field
{
  __IO uint32_t RFFC       : 1;
  __IO uint32_t RFEC       : 1;
  __IO uint32_t RFOC       : 1;
  __IO uint32_t RFUC       : 1;
  __IO uint32_t RFLETC     : 1;
  __IO uint32_t RFMTC      : 1;
  __IO uint32_t RSSRC      : 1;
} stc_hsspi_rxc_field_t;

typedef struct stc_hsspi_faultf_field
{
  __IO uint32_t UMAFS      : 1;
  __IO uint32_t WAFS       : 1;
  __IO uint32_t PVFS       : 1;
  __IO uint32_t DWCBSFS    : 1;
  __IO uint32_t DRCBSFS    : 1;
} stc_hsspi_faultf_field_t;

