MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_hsspi_faultc_field
{
  __IO uint32_t UMAFC      : 1;
  __IO uint32_t WAFC       : 1;
  __IO uint32_t PVFC       : 1;
  __IO uint32_t DWCBSFC    : 1;
  __IO uint32_t DRCBSFC    : 1;
} stc_hsspi_faultc_field_t;

typedef struct stc_hsspi_dmcfg_field
{
        uint8_t RESERVED1  : 1;
  __IO uint8_t SSDC        : 1;
} stc_hsspi_dmcfg_field_t;

typedef struct stc_hsspi_dmdmaen_field
{
  __IO uint8_t RXDMAEN     : 1;
  __IO uint8_t TXDMAEN     : 1;
} stc_hsspi_dmdmaen_field_t;

typedef struct stc_hsspi_dmstart_field
{
  __IO uint8_t START       : 1;
} stc_hsspi_dmstart_field_t;

typedef struct stc_hsspi_dmstop_field
{
  __IO uint8_t STOP        : 1;
} stc_hsspi_dmstop_field_t;

typedef struct stc_hsspi_dmpsel_field
{
  __IO uint8_t PSEL        : 2;
} stc_hsspi_dmpsel_field_t;

typedef struct stc_hsspi_dmtrp_field
{
  __IO uint8_t TRP         : 4;
} stc_hsspi_dmtrp_field_t;

typedef struct stc_hsspi_dmbcc_field
{
  __IO uint16_t BCC        : 16;
} stc_hsspi_dmbcc_field_t;

typedef struct stc_hsspi_dmbcs_field
{
  __IO uint16_t BCS        : 16;
} stc_hsspi_dmbcs_field_t;

typedef struct stc_hsspi_dmstatus_field
{
  __IO uint32_t RXACTIVE   : 1;
  __IO uint32_t TXACTIVE   : 1;
       uint32_t RESERVED1  : 6;
  __IO uint32_t RXFLEVEL   : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t TXFLEVEL   : 5;
} stc_hsspi_dmstatus_field_t;

typedef struct stc_hsspi_fifocfg_field
{
  __IO uint32_t RXFTH      : 4;
  __IO uint32_t TXFTH      : 4;
  __IO uint32_t FWIDTH     : 2;
  __IO uint32_t TXCTRL     : 1;
  __IO uint32_t RXFLSH     : 1;
  __IO uint32_t TXFLSH     : 1;
} stc_hsspi_fifocfg_field_t;

typedef struct stc_hsspi_txfifo0_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo0_field_t;

typedef struct stc_hsspi_txfifo1_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo1_field_t;

typedef struct stc_hsspi_txfifo2_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo2_field_t;

typedef struct stc_hsspi_txfifo3_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo3_field_t;

typedef struct stc_hsspi_txfifo4_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo4_field_t;

typedef struct stc_hsspi_txfifo5_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo5_field_t;

typedef struct stc_hsspi_txfifo6_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo6_field_t;

typedef struct stc_hsspi_txfifo7_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo7_field_t;

typedef struct stc_hsspi_txfifo8_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo8_field_t;

typedef struct stc_hsspi_txfifo9_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo9_field_t;

typedef struct stc_hsspi_txfifo10_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo10_field_t;

typedef struct stc_hsspi_txfifo11_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo11_field_t;

typedef struct stc_hsspi_txfifo12_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo12_field_t;

typedef struct stc_hsspi_txfifo13_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo13_field_t;

typedef struct stc_hsspi_txfifo14_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo14_field_t;

typedef struct stc_hsspi_txfifo15_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo15_field_t;

typedef struct stc_hsspi_rxfifo0_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo0_field_t;

typedef struct stc_hsspi_rxfifo1_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo1_field_t;

typedef struct stc_hsspi_rxfifo2_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo2_field_t;

typedef struct stc_hsspi_rxfifo3_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo3_field_t;

typedef struct stc_hsspi_rxfifo4_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo4_field_t;

typedef struct stc_hsspi_rxfifo5_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo5_field_t;

typedef struct stc_hsspi_rxfifo6_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo6_field_t;

typedef struct stc_hsspi_rxfifo7_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo7_field_t;

typedef struct stc_hsspi_rxfifo8_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo8_field_t;

typedef struct stc_hsspi_rxfifo9_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo9_field_t;

typedef struct stc_hsspi_rxfifo10_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo10_field_t;

typedef struct stc_hsspi_rxfifo11_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo11_field_t;

typedef struct stc_hsspi_rxfifo12_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo12_field_t;

typedef struct stc_hsspi_rxfifo13_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo13_field_t;

typedef struct stc_hsspi_rxfifo14_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo14_field_t;

typedef struct stc_hsspi_rxfifo15_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo15_field_t;

typedef struct stc_hsspi_cscfg_field
{
  __IO uint32_t SRAM       : 1;
  __IO uint32_t MBM        : 2;
       uint32_t RESERVED1  : 5;
  __IO uint32_t SSEL0EN    : 1;
  __IO uint32_t SSEL1EN    : 1;
  __IO uint32_t SSEL2EN    : 1;
  __IO uint32_t SSEL3EN    : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t MSEL       : 4;
} stc_hsspi_cscfg_field_t;

typedef struct stc_hsspi_csitime_field
{
  __IO uint32_t ITIME      : 16;
} stc_hsspi_csitime_field_t;

typedef struct stc_hsspi_csaext_field
{
       uint32_t RESERVED1  : 13;
  __IO uint32_t AEXT       : 19;
} stc_hsspi_csaext_field_t;

typedef struct stc_hsspi_rdcsdc0_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc0_field_t;

typedef struct stc_hsspi_rdcsdc1_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc1_field_t;

typedef struct stc_hsspi_rdcsdc2_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc2_field_t;

typedef struct stc_hsspi_rdcsdc3_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc3_field_t;

typedef struct stc_hsspi_rdcsdc4_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc4_field_t;

typedef struct stc_hsspi_rdcsdc5_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc5_field_t;

typedef struct stc_hsspi_rdcsdc6_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc6_field_t;

typedef struct stc_hsspi_rdcsdc7_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc7_field_t;

typedef struct stc_hsspi_wrcsdc0_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc0_field_t;

typedef struct stc_hsspi_wrcsdc1_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc1_field_t;

typedef struct stc_hsspi_wrcsdc2_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc2_field_t;

typedef struct stc_hsspi_wrcsdc3_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc3_field_t;

