MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_hsspi_wrcsdc4_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc4_field_t;

typedef struct stc_hsspi_wrcsdc5_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc5_field_t;

typedef struct stc_hsspi_wrcsdc6_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc6_field_t;

typedef struct stc_hsspi_wrcsdc7_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc7_field_t;

typedef struct stc_hsspi_mid_field
{
  __IO uint32_t MID        : 32;
} stc_hsspi_mid_field_t;

typedef struct stc_hsspi_qdclkr_field
{
  __IO uint8_t QHDIV       : 4;
} stc_hsspi_qdclkr_field_t;

typedef struct stc_hsspi_dbcnt_field
{
  __IO uint8_t RXDBEN      : 1;
  __IO uint8_t TXDBEN      : 1;
} stc_hsspi_dbcnt_field_t;

/******************************************************************************
 * HYPERBUS_MODULE
 ******************************************************************************/
/* HYPERBUS_MODULE register bit fields */
typedef struct stc_hyperbus_csr_field
{
  __IO uint32_t RACT       : 1;
       uint32_t RESERVED1  : 7;
  __IO uint32_t RDECERR    : 1;
  __IO uint32_t RTRSERR    : 1;
  __IO uint32_t RRSTOERR   : 1;
  __IO uint32_t RDSSLALL   : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t WACT       : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t WDECERR    : 1;
  __IO uint32_t WTRSERR    : 1;
  __IO uint32_t WRSTOERR   : 1;
} stc_hyperbus_csr_field_t;

typedef struct stc_hyperbus_ien_field
{
  __IO uint32_t RPCINTE    : 1;
       uint32_t RESERVED1  : 30;
  __IO uint32_t INTP       : 1;
} stc_hyperbus_ien_field_t;

typedef struct stc_hyperbus_isr_field
{
  __IO uint32_t RPCINTS    : 1;
} stc_hyperbus_isr_field_t;

typedef struct stc_hyperbus_mbr0_field
{
  __IO uint32_t MBR        : 32;
} stc_hyperbus_mbr0_field_t;

typedef struct stc_hyperbus_mbr1_field
{
  __IO uint32_t MBR        : 32;
} stc_hyperbus_mbr1_field_t;

typedef struct stc_hyperbus_mcr0_field
{
  __IO uint32_t WRAPSIZE   : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t DEVTYPE    : 1;
  __IO uint32_t CRT        : 1;
       uint32_t RESERVED2  : 10;
  __IO uint32_t ACS        : 1;
  __IO uint32_t CRMO       : 1;
} stc_hyperbus_mcr0_field_t;

typedef struct stc_hyperbus_mcr1_field
{
  __IO uint32_t WRAPSIZE   : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t DEVTYPE    : 1;
  __IO uint32_t CRT        : 1;
       uint32_t RESERVED2  : 10;
  __IO uint32_t ACS        : 1;
  __IO uint32_t CRMO       : 1;
} stc_hyperbus_mcr1_field_t;

typedef struct stc_hyperbus_mtr0_field
{
  __IO uint32_t LTCY       : 4;
       uint32_t RESERVED1  : 4;
  __IO uint32_t WCSH       : 4;
  __IO uint32_t RCSH       : 4;
  __IO uint32_t WCSS       : 4;
  __IO uint32_t RCSS       : 4;
  __IO uint32_t WCSHI      : 4;
  __IO uint32_t RCSHI      : 4;
} stc_hyperbus_mtr0_field_t;

typedef struct stc_hyperbus_mtr1_field
{
  __IO uint32_t LTCY       : 4;
       uint32_t RESERVED1  : 4;
  __IO uint32_t WCSH       : 4;
  __IO uint32_t RCSH       : 4;
  __IO uint32_t WCSS       : 4;
  __IO uint32_t RCSS       : 4;
  __IO uint32_t WCSHI      : 4;
  __IO uint32_t RCSHI      : 4;
} stc_hyperbus_mtr1_field_t;

typedef struct stc_hyperbus_gpor_field
{
  __IO uint32_t GPO0       : 1;
  __IO uint32_t GPO1       : 1;
} stc_hyperbus_gpor_field_t;

typedef struct stc_hyperbus_wpr_field
{
  __IO uint32_t WP         : 1;
} stc_hyperbus_wpr_field_t;

typedef struct stc_hyperbus_test_field
{
  __IO uint32_t RVD        : 1;
} stc_hyperbus_test_field_t;

/******************************************************************************
 * GDCSUB_MODULE
 ******************************************************************************/
/* GDCSUB_MODULE register bit fields */
typedef struct stc_gdcsub_lockunlock_field
{
  __IO uint32_t LOCKUNLOCK : 32;
} stc_gdcsub_lockunlock_field_t;

typedef struct stc_gdcsub_lockstatus_field
{
  __IO uint32_t LOCKSTATUS : 1;
       uint32_t RESERVED1  : 3;
  __IO uint32_t PRIVILEGESTATUS: 1;
       uint32_t RESERVED2  : 3;
  __IO uint32_t FREEZSTATUS: 1;
} stc_gdcsub_lockstatus_field_t;

typedef struct stc_gdcsub_configclockcontrol_field
{
  __IO uint32_t CONFIGCLOCKSELECT: 3;
} stc_gdcsub_configclockcontrol_field_t;

typedef struct stc_gdcsub_vraminterruptenable_field
{
  __IO uint32_t VRAMINTERRUPTENABLESEC0: 1;
  __IO uint32_t VRAMINTERRUPTENABLESEC1: 1;
} stc_gdcsub_vraminterruptenable_field_t;

typedef struct stc_gdcsub_vraminterruptclear_field
{
  __IO uint32_t VRAMINTERRUPTCLEARSEC0: 1;
  __IO uint32_t VRAMINTERRUPTCLEARSEC1: 1;
} stc_gdcsub_vraminterruptclear_field_t;

typedef struct stc_gdcsub_vraminterruptstatus_field
{
  __IO uint32_t VRAMINTERRUPTSTATUSSEC0: 1;
  __IO uint32_t VRAMINTERRUPTSTATUSSEC1: 1;
} stc_gdcsub_vraminterruptstatus_field_t;

typedef struct stc_gdcsub_extflashdevselect_field
{
  __IO uint32_t EXTFLASHDEVSELECT: 1;
} stc_gdcsub_extflashdevselect_field_t;

typedef struct stc_gdcsub_vramremapdisable_field
{
  __IO uint32_t VRAMREMAPDISABLE: 1;
} stc_gdcsub_vramremapdisable_field_t;

typedef struct stc_gdcsub_panicswitch_field
{
  __IO uint32_t PANICSWITCH: 1;
} stc_gdcsub_panicswitch_field_t;

typedef struct stc_gdcsub_gdc_clockdivider_field
{
       uint32_t RESERVED1  : 8;
  __IO uint32_t GDCCLOCKSELECT: 16;
} stc_gdcsub_gdc_clockdivider_field_t;

typedef struct stc_gdcsub_wkuptriggermask_field
{
  __IO uint32_t WTRIGMASKGE: 19;
       uint32_t RESERVED1  : 5;
  __IO uint32_t WTRIGMASKQSPI: 1;
  __IO uint32_t WTRIGMASKSDRAM: 1;
  __IO uint32_t WTRIGMASKRPC: 1;
} stc_gdcsub_wkuptriggermask_field_t;

