MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
typedef struct stc_gdcsub_clockdomainstatus_field
{
  __IO uint32_t DSPCLOCKDOMAINREADY: 1;
  __IO uint32_t SDRAMCLOCKDOMAINREADY: 1;
  __IO uint32_t RPCCLOCKDOMAINREADY: 1;
  __IO uint32_t HSSPICLOCKDOMAINREADY: 1;
} stc_gdcsub_clockdomainstatus_field_t;

typedef struct stc_gdcsub_dsp_lockunlock_field
{
  __IO uint32_t DSP_LOCKUNLOCK: 32;
} stc_gdcsub_dsp_lockunlock_field_t;

typedef struct stc_gdcsub_dsp_lockstatus_field
{
  __IO uint32_t DSP_LOCKSTATUS: 1;
       uint32_t RESERVED1  : 3;
  __IO uint32_t DSP_PRIVILEGESTATUS: 1;
       uint32_t RESERVED2  : 3;
  __IO uint32_t DSP_FREEZESTATUS: 1;
} stc_gdcsub_dsp_lockstatus_field_t;

typedef struct stc_gdcsub_dsp0_clockdivider_field
{
       uint32_t RESERVED1  : 8;
  __IO uint32_t DSP0_CLOCKDIVIDER: 16;
} stc_gdcsub_dsp0_clockdivider_field_t;

typedef struct stc_gdcsub_dsp0_domaincontrol_field
{
  __IO uint32_t DSP0_CLOCKENABLE: 1;
       uint32_t RESERVED1  : 15;
  __IO uint32_t DSP0_SOFTWARERESET: 1;
} stc_gdcsub_dsp0_domaincontrol_field_t;

typedef struct stc_gdcsub_dsp0_clockshift_field
{
  __IO uint32_t DSP0_CLOCKINVERT: 1;
       uint32_t RESERVED1  : 15;
  __IO uint32_t DSP0_CLOCKOFFSET: 8;
} stc_gdcsub_dsp0_clockshift_field_t;

typedef struct stc_gdcsub_dsp0_powerencontrol_field
{
  __IO uint32_t POWER_ENABLE: 1;
} stc_gdcsub_dsp0_powerencontrol_field_t;

typedef struct stc_gdcsub_dsp0_clockgatemodelock_field
{
  __IO uint32_t LOCKUNLOCK : 32;
} stc_gdcsub_dsp0_clockgatemodelock_field_t;

typedef struct stc_gdcsub_dsp0_clockgatecontrol_field
{
  __IO uint32_t CLOCKGATE_ENABLE: 1;
} stc_gdcsub_dsp0_clockgatecontrol_field_t;

typedef struct stc_gdcsub_sdramc_clockdivider_field
{
       uint32_t RESERVED1  : 8;
  __IO uint32_t SDRAMC_CLOCKDIVIDER: 16;
} stc_gdcsub_sdramc_clockdivider_field_t;

typedef struct stc_gdcsub_sdramc_domaincontrol_field
{
  __IO uint32_t SDRAMC_CLOCKENABLE: 1;
       uint32_t RESERVED1  : 15;
  __IO uint32_t SDRAMC_SOFTWARERESET: 1;
} stc_gdcsub_sdramc_domaincontrol_field_t;

typedef struct stc_gdcsub_hsspic_clockdivider_field
{
       uint32_t RESERVED1  : 8;
  __IO uint32_t HSSPIC_CLOCKDIVIDER: 16;
} stc_gdcsub_hsspic_clockdivider_field_t;

typedef struct stc_gdcsub_hsspic_domaincontrol_field
{
  __IO uint32_t HSSPIC_CLOCKENABLE: 1;
       uint32_t RESERVED1  : 15;
  __IO uint32_t HSSPIC_SOFTWARERESET: 1;
} stc_gdcsub_hsspic_domaincontrol_field_t;

typedef struct stc_gdcsub_rpcc_clockdivider_field
{
  __IO uint32_t RPCC_CLOCKDIVIDER: 3;
} stc_gdcsub_rpcc_clockdivider_field_t;

typedef struct stc_gdcsub_rpcc_domaincontrol_field
{
  __IO uint32_t RPCC_CLOCKENABLE: 1;
} stc_gdcsub_rpcc_domaincontrol_field_t;

typedef struct stc_gdcsub_vram_lockunlock_field
{
  __IO uint32_t VRAM_LOCKUNLOCK: 32;
} stc_gdcsub_vram_lockunlock_field_t;

typedef struct stc_gdcsub_vram_lockstatus_field
{
  __IO uint32_t VRAM_LOCKSTATUS: 1;
       uint32_t RESERVED1  : 3;
  __IO uint32_t VRAM_PRIVILEGESTATUS: 1;
       uint32_t RESERVED2  : 3;
  __IO uint32_t VRAM_FREEZESTATUS: 1;
} stc_gdcsub_vram_lockstatus_field_t;

typedef struct stc_gdcsub_vram_sram_select_field
{
  __IO uint32_t VRAM_SRAM_SELECT: 12;
} stc_gdcsub_vram_sram_select_field_t;

typedef struct stc_gdcsub_vram_aberraddr_s0_field
{
  __IO uint32_t VRAM_ABERRADDR_S0: 32;
} stc_gdcsub_vram_aberraddr_s0_field_t;

typedef struct stc_gdcsub_vram_aberraddr_s1_field
{
  __IO uint32_t VRAM_ABERRADDR_S1: 32;
} stc_gdcsub_vram_aberraddr_s1_field_t;

typedef struct stc_gdcsub_vram_arbiter_priority_field
{
  __IO uint32_t VRAM_PRIORITY_S0_WRITE: 2;
  __IO uint32_t VRAM_PRIORITY_S0_READ: 2;
  __IO uint32_t VRAM_PRIORITY_S1_READ: 2;
  __IO uint32_t VRAM_PRIORITY_S2_READ: 2;
} stc_gdcsub_vram_arbiter_priority_field_t;

/******************************************************************************
 * SDRAMC_MODULE
 ******************************************************************************/
/* SDRAMC_MODULE register bit fields */
typedef struct stc_sdramc_sdmode_field
{
  __IO uint32_t SDON       : 1;
  __IO uint32_t PDON       : 1;
  __IO uint32_t ROFF       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t CASEL      : 2;
       uint32_t RESERVED2  : 2;
  __IO uint32_t RASEL      : 4;
  __IO uint32_t BASEL      : 4;
  __IO uint32_t MSDCLKOFF  : 1;
} stc_sdramc_sdmode_field_t;

typedef struct stc_sdramc_reftim_field
{
  __IO uint32_t REFC       : 16;
  __IO uint32_t NREF       : 8;
  __IO uint32_t PREF       : 1;
} stc_sdramc_reftim_field_t;

typedef struct stc_sdramc_pwrdwn_field
{
  __IO uint32_t PDC        : 16;
} stc_sdramc_pwrdwn_field_t;

typedef struct stc_sdramc_sdtim_field
{
  __IO uint32_t CL         : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TRC        : 4;
  __IO uint32_t TRP        : 4;
  __IO uint32_t TRCD       : 4;
  __IO uint32_t TRAS       : 4;
  __IO uint32_t TREFC      : 4;
  __IO uint32_t TDPL       : 2;
       uint32_t RESERVED2  : 5;
  __IO uint32_t BOFF       : 1;
} stc_sdramc_sdtim_field_t;

typedef struct stc_sdramc_sdcmd_field
{
  __IO uint32_t SDAD       : 16;
  __IO uint32_t SDWE       : 1;
  __IO uint32_t SDCAS      : 1;
  __IO uint32_t SDRAS      : 1;
  __IO uint32_t SDCS       : 1;
  __IO uint32_t SDCKE      : 1;
       uint32_t RESERVED1  : 10;
  __IO uint32_t PEND       : 1;
} stc_sdramc_sdcmd_field_t;

/******************************************************************************
 * Peripheral register structures
 ******************************************************************************/
/******************************************************************************
 * FLASH_IF_MODULE
 ******************************************************************************/
/* FLASH_IF registers */
typedef struct
{
  union {
    __IO uint32_t FASZR;
    stc_flash_if_faszr_field_t FASZR_f;
  };
  union {
    __IO uint32_t FRWTR;
    stc_flash_if_frwtr_field_t FRWTR_f;
  };
  union {
    __IO uint32_t FSTR;
    stc_flash_if_fstr_field_t FSTR_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t FSYNDN;
    stc_flash_if_fsyndn_field_t FSYNDN_f;
  };
  union {
    __IO uint32_t FBFCR;
    stc_flash_if_fbfcr_field_t FBFCR_f;
  };
        uint8_t RESERVED2[8];
  union {
    __IO uint32_t FICR;
    stc_flash_if_ficr_field_t FICR_f;
  };
  union {
    __IO uint32_t FISR;
    stc_flash_if_fisr_field_t FISR_f;
  };
  union {
    __IO uint32_t FICLR;
    stc_flash_if_ficlr_field_t FICLR_f;
  };
        uint8_t RESERVED3[212];
  union {
    __IO uint32_t CRTRMM;
    stc_flash_if_crtrmm_field_t CRTRMM_f;
  };
        uint8_t RESERVED4[12];
  union {
    __IO uint32_t FGPDM1;
    stc_flash_if_fgpdm1_field_t FGPDM1_f;
  };
  union {
    __IO uint32_t FGPDM2;
    stc_flash_if_fgpdm2_field_t FGPDM2_f;
  };
  union {
    __IO uint32_t FGPDM3;
    stc_flash_if_fgpdm3_field_t FGPDM3_f;
  };
  union {
    __IO uint32_t FGPDM4;
    stc_flash_if_fgpdm4_field_t FGPDM4_f;
  };
}FM4_FLASH_IF_TypeDef;

