MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/******************************************************************************
 * UNIQUE_ID_MODULE
 ******************************************************************************/
/* Unique ID registers */
typedef struct
{
  union {
    __IO uint32_t UIDR0;
    stc_unique_id_uidr0_field_t UIDR0_f;
  };
  union {
    __IO uint32_t UIDR1;
    stc_unique_id_uidr1_field_t UIDR1_f;
  };
}FM4_UNIQUE_ID_TypeDef;

/******************************************************************************
 * ECC_CAPTURE_MODULE
 ******************************************************************************/
/* ECC Capture address registers */
typedef struct
{
  union {
    __IO uint32_t FERRAD;
    stc_ecc_capture_ferrad_field_t FERRAD_f;
  };
}FM4_ECC_CAPTURE_TypeDef;

/******************************************************************************
 * Clock_Reset_MODULE
 ******************************************************************************/
/* Clock and reset registers */
typedef struct
{
  union {
    __IO uint32_t SCM_CTL;
    stc_crg_scm_ctl_field_t SCM_CTL_f;
  };
  union {
    __IO uint32_t SCM_STR;
    stc_crg_scm_str_field_t SCM_STR_f;
  };
  __IO uint32_t STB_CTL;
  union {
    __IO uint32_t RST_STR;
    stc_crg_rst_str_field_t RST_STR_f;
  };
  union {
    __IO uint32_t BSC_PSR;
    stc_crg_bsc_psr_field_t BSC_PSR_f;
  };
  union {
    __IO uint32_t APBC0_PSR;
    stc_crg_apbc0_psr_field_t APBC0_PSR_f;
  };
  union {
    __IO uint32_t APBC1_PSR;
    stc_crg_apbc1_psr_field_t APBC1_PSR_f;
  };
  union {
    __IO uint32_t APBC2_PSR;
    stc_crg_apbc2_psr_field_t APBC2_PSR_f;
  };
  union {
    __IO uint32_t SWC_PSR;
    stc_crg_swc_psr_field_t SWC_PSR_f;
  };
        uint8_t RESERVED7[4];
  union {
    __IO uint32_t TTC_PSR;
    stc_crg_ttc_psr_field_t TTC_PSR_f;
  };
        uint8_t RESERVED8[4];
  union {
    __IO uint32_t CSW_TMR;
    stc_crg_csw_tmr_field_t CSW_TMR_f;
  };
  union {
    __IO uint32_t PSW_TMR;
    stc_crg_psw_tmr_field_t PSW_TMR_f;
  };
  union {
    __IO uint32_t PLL_CTL1;
    stc_crg_pll_ctl1_field_t PLL_CTL1_f;
  };
  union {
    __IO uint32_t PLL_CTL2;
    stc_crg_pll_ctl2_field_t PLL_CTL2_f;
  };
  union {
    __IO uint32_t CSV_CTL;
    stc_crg_csv_ctl_field_t CSV_CTL_f;
  };
  union {
    __IO uint32_t CSV_STR;
    stc_crg_csv_str_field_t CSV_STR_f;
  };
  __IO uint32_t FCSWH_CTL;
  __IO uint32_t FCSWL_CTL;
  __IO uint32_t FCSWD_CTL;
  union {
    __IO uint32_t DBWDT_CTL;
    stc_crg_dbwdt_ctl_field_t DBWDT_CTL_f;
  };
        uint8_t RESERVED18[8];
  union {
    __IO uint32_t INT_ENR;
    stc_crg_int_enr_field_t INT_ENR_f;
  };
  union {
    __IO uint32_t INT_STR;
    stc_crg_int_str_field_t INT_STR_f;
  };
  union {
    __IO  uint8_t INT_CLR;
    stc_crg_int_clr_field_t INT_CLR_f;
  };
}FM4_CRG_TypeDef;

/******************************************************************************
 * HWWDT_MODULE
 ******************************************************************************/
/* Hardware watchdog registers */
typedef struct
{
  __IO uint32_t WDG_LDR;
  __IO uint32_t WDG_VLR;
  union {
    __IO uint32_t WDG_CTL;
    stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
  };
  __IO uint32_t WDG_ICL;
  union {
    __IO uint32_t WDG_RIS;
    stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
  };
        uint8_t RESERVED2[3052];
  __IO uint32_t WDG_LCK;
}FM4_HWWDT_TypeDef;

/******************************************************************************
 * SWWDT_MODULE
 ******************************************************************************/
/* Software watchdog registers */
typedef struct
{
  __IO uint32_t WDOGLOAD;
  __IO uint32_t WDOGVALUE;
  union {
    __IO uint32_t                 WDOGCONTROL;
    stc_swwdt_wdogcontrol_field_t WDOGCONTROL_f;
  };
  __IO uint32_t WDOGINTCLR;
  union {
    __IO uint32_t             WDOGRIS;
    stc_swwdt_wdogris_field_t WDOGRIS_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t              WDOGSPMC;
    stc_swwdt_wdogspmc_field_t WDOGSPMC_f;
  };
        uint8_t RESERVED2[3044];
  __IO uint32_t WDOGLOCK;
}FM4_SWWDT_TypeDef;

/******************************************************************************
 * DTIM_MODULE
 ******************************************************************************/
/* DTIM registers */
typedef struct
{
  __IO uint32_t TIMER1LOAD;
  __IO uint32_t TIMER1VALUE;
  union {
    __IO uint32_t TIMER1CONTROL;
    stc_dtim_timer1control_field_t TIMER1CONTROL_f;
  };
  __IO uint32_t TIMER1INTCLR;
  union {
    __IO uint32_t TIMER1RIS;
    stc_dtim_timer1ris_field_t TIMER1RIS_f;
  };
  union {
    __IO uint32_t TIMER1MIS;
    stc_dtim_timer1mis_field_t TIMER1MIS_f;
  };
  __IO uint32_t TIMER1BGLOAD;
        uint8_t RESERVED1[4];
  __IO uint32_t TIMER2LOAD;
  __IO uint32_t TIMER2VALUE;
  union {
    __IO uint32_t TIMER2CONTROL;
    stc_dtim_timer2control_field_t TIMER2CONTROL_f;
  };
  __IO uint32_t TIMER2INTCLR;
  union {
    __IO uint32_t TIMER2RIS;
    stc_dtim_timer2ris_field_t TIMER2RIS_f;
  };
  union {
    __IO uint32_t TIMER2MIS;
    stc_dtim_timer2mis_field_t TIMER2MIS_f;
  };
  __IO uint32_t TIMER2BGLOAD;
}FM4_DTIM_TypeDef;

/******************************************************************************
 * MFT_FRT_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 Free Running Timer registers */
typedef struct
{
        uint8_t RESERVED0[66];
  __IO uint16_t TCCP0;
        uint8_t RESERVED1[2];
  __IO uint16_t TCDT0;
  union {
    __IO uint16_t TCSA0;
    stc_mft_frt_tcsa0_field_t TCSA0_f;
  };
  union {
    __IO uint16_t TCSC0;
    stc_mft_frt_tcsc0_field_t TCSC0_f;
  };
        uint8_t RESERVED2[2];
  __IO uint16_t TCCP1;
        uint8_t RESERVED3[2];
  __IO uint16_t TCDT1;
  union {
    __IO uint16_t TCSA1;
    stc_mft_frt_tcsa1_field_t TCSA1_f;
  };
  union {
    __IO uint16_t TCSC1;
    stc_mft_frt_tcsc1_field_t TCSC1_f;
  };
        uint8_t RESERVED4[2];
  __IO uint16_t TCCP2;
        uint8_t RESERVED5[2];
  __IO uint16_t TCDT2;
  union {
    __IO uint16_t TCSA2;
    stc_mft_frt_tcsa2_field_t TCSA2_f;
  };
  union {
    __IO uint16_t TCSC2;
    stc_mft_frt_tcsc2_field_t TCSC2_f;
  };
  union {
    __IO uint32_t TCAL;
    stc_mft_frt_tcal_field_t TCAL_f;
  };
        uint8_t RESERVED6[132];
  union {
    __IO uint32_t TCSD;
    stc_mft_frt_tcsd_field_t TCSD_f;
  };
}FM4_MFT_FRT_TypeDef;

