MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/******************************************************************************
 * HYPERBUS_MODULE
 ******************************************************************************/
/* HYPERBUS registers */
typedef struct
{
  union {
    __IO uint32_t CSR;
    stc_hyperbus_csr_field_t CSR_f;
  };
  union {
    __IO uint32_t IEN;
    stc_hyperbus_ien_field_t IEN_f;
  };
  union {
    __IO uint32_t ISR;
    stc_hyperbus_isr_field_t ISR_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t MBR0;
    stc_hyperbus_mbr0_field_t MBR0_f;
  };
  union {
    __IO uint32_t MBR1;
    stc_hyperbus_mbr1_field_t MBR1_f;
  };
  union {
    __IO uint32_t MCR0;
    stc_hyperbus_mcr0_field_t MCR0_f;
  };
  union {
    __IO uint32_t MCR1;
    stc_hyperbus_mcr1_field_t MCR1_f;
  };
  union {
    __IO uint32_t MTR0;
    stc_hyperbus_mtr0_field_t MTR0_f;
  };
  union {
    __IO uint32_t MTR1;
    stc_hyperbus_mtr1_field_t MTR1_f;
  };
  union {
    __IO uint32_t GPOR;
    stc_hyperbus_gpor_field_t GPOR_f;
  };
  union {
    __IO uint32_t WPR;
    stc_hyperbus_wpr_field_t WPR_f;
  };
  union {
    __IO uint32_t TEST;
    stc_hyperbus_test_field_t TEST_f;
  };
}FM4_HYPERBUS_TypeDef;

/******************************************************************************
 * GDCSUB_MODULE
 ******************************************************************************/
/* GDCSUB registers */
typedef struct
{
  union {
    __IO uint32_t LockUnlock;
    stc_gdcsub_lockunlock_field_t LockUnlock_f;
  };
  union {
    __IO uint32_t LockStatus;
    stc_gdcsub_lockstatus_field_t LockStatus_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t ConfigClockControl;
    stc_gdcsub_configclockcontrol_field_t ConfigClockControl_f;
  };
  union {
    __IO uint32_t VRamInterruptEnable;
    stc_gdcsub_vraminterruptenable_field_t VRamInterruptEnable_f;
  };
        uint8_t RESERVED2[4];
  union {
    __IO uint32_t VRamInterruptClear;
    stc_gdcsub_vraminterruptclear_field_t VRamInterruptClear_f;
  };
  union {
    __IO uint32_t VRamInterruptStatus;
    stc_gdcsub_vraminterruptstatus_field_t VRamInterruptStatus_f;
  };
  union {
    __IO uint32_t ExtFlashDevSelect;
    stc_gdcsub_extflashdevselect_field_t ExtFlashDevSelect_f;
  };
  union {
    __IO uint32_t VRamRemapDisable;
    stc_gdcsub_vramremapdisable_field_t VRamRemapDisable_f;
  };
  union {
    __IO uint32_t PanicSwitch;
    stc_gdcsub_panicswitch_field_t PanicSwitch_f;
  };
  union {
    __IO uint32_t GDC_ClockDivider;
    stc_gdcsub_gdc_clockdivider_field_t GDC_ClockDivider_f;
  };
  union {
    __IO uint32_t WkupTriggerMask;
    stc_gdcsub_wkuptriggermask_field_t WkupTriggerMask_f;
  };
  union {
    __IO uint32_t ClockDomainStatus;
    stc_gdcsub_clockdomainstatus_field_t ClockDomainStatus_f;
  };
        uint8_t RESERVED3[8];
  union {
    __IO uint32_t dsp_LockUnlock;
    stc_gdcsub_dsp_lockunlock_field_t dsp_LockUnlock_f;
  };
  union {
    __IO uint32_t dsp_LockStatus;
    stc_gdcsub_dsp_lockstatus_field_t dsp_LockStatus_f;
  };
  union {
    __IO uint32_t dsp0_ClockDivider;
    stc_gdcsub_dsp0_clockdivider_field_t dsp0_ClockDivider_f;
  };
  union {
    __IO uint32_t dsp0_DomainControl;
    stc_gdcsub_dsp0_domaincontrol_field_t dsp0_DomainControl_f;
  };
  union {
    __IO uint32_t dsp0_ClockShift;
    stc_gdcsub_dsp0_clockshift_field_t dsp0_ClockShift_f;
  };
        uint8_t RESERVED4[4];
  union {
    __IO uint32_t dsp0_PowerEnControl;
    stc_gdcsub_dsp0_powerencontrol_field_t dsp0_PowerEnControl_f;
  };
  union {
    __IO uint32_t dsp0_ClockGateModeLock;
    stc_gdcsub_dsp0_clockgatemodelock_field_t dsp0_ClockGateModeLock_f;
  };
  union {
    __IO uint32_t dsp0_ClockGateControl;
    stc_gdcsub_dsp0_clockgatecontrol_field_t dsp0_ClockGateControl_f;
  };
        uint8_t RESERVED5[20];
  union {
    __IO uint32_t SDRAMC_ClockDivider;
    stc_gdcsub_sdramc_clockdivider_field_t SDRAMC_ClockDivider_f;
  };
  union {
    __IO uint32_t SDRAMC_DomainControl;
    stc_gdcsub_sdramc_domaincontrol_field_t SDRAMC_DomainControl_f;
  };
  union {
    __IO uint32_t HSSPIC_ClockDivider;
    stc_gdcsub_hsspic_clockdivider_field_t HSSPIC_ClockDivider_f;
  };
  union {
    __IO uint32_t HSSPIC_DomainControl;
    stc_gdcsub_hsspic_domaincontrol_field_t HSSPIC_DomainControl_f;
  };
  union {
    __IO uint32_t RPCC_ClockDivider;
    stc_gdcsub_rpcc_clockdivider_field_t RPCC_ClockDivider_f;
  };
  union {
    __IO uint32_t RPCC_DomainControl;
    stc_gdcsub_rpcc_domaincontrol_field_t RPCC_DomainControl_f;
  };
        uint8_t RESERVED6[112];
  union {
    __IO uint32_t vram_LockUnlock;
    stc_gdcsub_vram_lockunlock_field_t vram_LockUnlock_f;
  };
  union {
    __IO uint32_t vram_LockStatus;
    stc_gdcsub_vram_lockstatus_field_t vram_LockStatus_f;
  };
  union {
    __IO uint32_t vram_sram_select;
    stc_gdcsub_vram_sram_select_field_t vram_sram_select_f;
  };
        uint8_t RESERVED7[48];
  union {
    __IO uint32_t vram_aberraddr_s0;
    stc_gdcsub_vram_aberraddr_s0_field_t vram_aberraddr_s0_f;
  };
  union {
    __IO uint32_t vram_aberraddr_s1;
    stc_gdcsub_vram_aberraddr_s1_field_t vram_aberraddr_s1_f;
  };
        uint8_t RESERVED8[4];
  union {
    __IO uint32_t vram_arbiter_priority;
    stc_gdcsub_vram_arbiter_priority_field_t vram_arbiter_priority_f;
  };
}FM4_GDCSUB_TypeDef;

/******************************************************************************
 * SDRAMC_MODULE
 ******************************************************************************/
/* SDRAMC registers */
typedef struct
{
        uint8_t RESERVED1[256];
  union {
    __IO uint32_t SDMODE;
    stc_sdramc_sdmode_field_t SDMODE_f;
  };
  union {
    __IO uint32_t REFTIM;
    stc_sdramc_reftim_field_t REFTIM_f;
  };
  union {
    __IO uint32_t PWRDWN;
    stc_sdramc_pwrdwn_field_t PWRDWN_f;
  };
  union {
    __IO uint32_t SDTIM;
    stc_sdramc_sdtim_field_t SDTIM_f;
  };
  union {
    __IO uint32_t SDCMD;
    stc_sdramc_sdcmd_field_t SDCMD_f;
  };
}FM4_SDRAMC_TypeDef;

/******************************************************************************
 * Peripheral memory map
 ******************************************************************************/
#define FM4_FLASH_BASE        (0x00000000UL)                 /* Flash Base                             */
#define FM4_PERIPH_BASE       (0x40000000UL)                 /* Peripheral  Base                       */
#define FM4_GDCS_BASE         (0xD0A00000UL)                 /* GDC System Base                        */
#define FM4_CM4_BASE          (0xE0100000UL)                 /* CM4 Private                            */

