MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* Base Timer 8 PWM registers */

/* Base Timer 8 RT registers */

/* Base Timer 8 PWC registers */

/* Base Timer 9 PPG registers */

/* Base Timer 9 PWM registers */

/* Base Timer 9 RT registers */

/* Base Timer 9 PWC registers */

/* Base Timer 10 PPG registers */

/* Base Timer 10 PWM registers */

/* Base Timer 10 RT registers */

/* Base Timer 10 PWC registers */

/* Base Timer 11 PPG registers */

/* Base Timer 11 PWM registers */

/* Base Timer 11 RT registers */

/* Base Timer 11 PWC registers */

/* Base Timer 12 PPG registers */

/* Base Timer 12 PWM registers */

/* Base Timer 12 RT registers */

/* Base Timer 12 PWC registers */

/* Base Timer 13 PPG registers */

/* Base Timer 13 PWM registers */

/* Base Timer 13 RT registers */

/* Base Timer 13 PWC registers */

/* Base Timer 14 PPG registers */

/* Base Timer 14 PWM registers */

/* Base Timer 14 RT registers */

/* Base Timer 14 PWC registers */

/* Base Timer 15 PPG registers */

/* Base Timer 15 PWM registers */

/* Base Timer 15 RT registers */

/* Base Timer 15 PWC registers */

/* Base Timer I/O selector channel 8 - channel 11 registers */

/* Base Timer I/O selector channel 12 - channel 15 registers */

/* Software based Simulation Startup (Base Timer) register */
#define bFM4_SBSSR_BTSSSR_SSR0                                        *((volatile unsigned char*)(0x424BFF80UL))
#define bFM4_SBSSR_BTSSSR_SSR1                                        *((volatile unsigned char*)(0x424BFF84UL))
#define bFM4_SBSSR_BTSSSR_SSR2                                        *((volatile unsigned char*)(0x424BFF88UL))
#define bFM4_SBSSR_BTSSSR_SSR3                                        *((volatile unsigned char*)(0x424BFF8CUL))
#define bFM4_SBSSR_BTSSSR_SSR4                                        *((volatile unsigned char*)(0x424BFF90UL))
#define bFM4_SBSSR_BTSSSR_SSR5                                        *((volatile unsigned char*)(0x424BFF94UL))
#define bFM4_SBSSR_BTSSSR_SSR6                                        *((volatile unsigned char*)(0x424BFF98UL))
#define bFM4_SBSSR_BTSSSR_SSR7                                        *((volatile unsigned char*)(0x424BFF9CUL))
#define bFM4_SBSSR_BTSSSR_SSR8                                        *((volatile unsigned char*)(0x424BFFA0UL))
#define bFM4_SBSSR_BTSSSR_SSR9                                        *((volatile unsigned char*)(0x424BFFA4UL))
#define bFM4_SBSSR_BTSSSR_SSR10                                       *((volatile unsigned char*)(0x424BFFA8UL))
#define bFM4_SBSSR_BTSSSR_SSR11                                       *((volatile unsigned char*)(0x424BFFACUL))
#define bFM4_SBSSR_BTSSSR_SSR12                                       *((volatile unsigned char*)(0x424BFFB0UL))
#define bFM4_SBSSR_BTSSSR_SSR13                                       *((volatile unsigned char*)(0x424BFFB4UL))
#define bFM4_SBSSR_BTSSSR_SSR14                                       *((volatile unsigned char*)(0x424BFFB8UL))
#define bFM4_SBSSR_BTSSSR_SSR15                                       *((volatile unsigned char*)(0x424BFFBCUL))

/* Quad position and revolution counter channel 0 registers */
#define bFM4_QPRC0_QICR_QPCMIE                 *((volatile unsigned char*)(0x424C0280UL))
#define bFM4_QPRC0_QICR_QPCMF                  *((volatile unsigned char*)(0x424C0284UL))
#define bFM4_QPRC0_QICR_QPRCMIE                *((volatile unsigned char*)(0x424C0288UL))
#define bFM4_QPRC0_QICR_QPRCMF                 *((volatile unsigned char*)(0x424C028CUL))
#define bFM4_QPRC0_QICR_OUZIE                  *((volatile unsigned char*)(0x424C0290UL))
#define bFM4_QPRC0_QICR_UFDF                   *((volatile unsigned char*)(0x424C0294UL))
#define bFM4_QPRC0_QICR_OFDF                   *((volatile unsigned char*)(0x424C0298UL))
#define bFM4_QPRC0_QICR_ZIIF                   *((volatile unsigned char*)(0x424C029CUL))
#define bFM4_QPRC0_QICR_CDCIE                  *((volatile unsigned char*)(0x424C02A0UL))
#define bFM4_QPRC0_QICR_CDCF                   *((volatile unsigned char*)(0x424C02A4UL))
#define bFM4_QPRC0_QICR_DIRPC                  *((volatile unsigned char*)(0x424C02A8UL))
#define bFM4_QPRC0_QICR_DIROU                  *((volatile unsigned char*)(0x424C02ACUL))
#define bFM4_QPRC0_QICR_QPCNRCMIE              *((volatile unsigned char*)(0x424C02B0UL))
#define bFM4_QPRC0_QICR_QPCNRCMF               *((volatile unsigned char*)(0x424C02B4UL))
#define bFM4_QPRC0_QICRL_QPCMIE                *((volatile unsigned char*)(0x424C0280UL))
#define bFM4_QPRC0_QICRL_QPCMF                 *((volatile unsigned char*)(0x424C0284UL))
#define bFM4_QPRC0_QICRL_QPRCMIE               *((volatile unsigned char*)(0x424C0288UL))
#define bFM4_QPRC0_QICRL_QPRCMF                *((volatile unsigned char*)(0x424C028CUL))
#define bFM4_QPRC0_QICRL_OUZIE                 *((volatile unsigned char*)(0x424C0290UL))
#define bFM4_QPRC0_QICRL_UFDF                  *((volatile unsigned char*)(0x424C0294UL))
#define bFM4_QPRC0_QICRL_OFDF                  *((volatile unsigned char*)(0x424C0298UL))
#define bFM4_QPRC0_QICRL_ZIIF                  *((volatile unsigned char*)(0x424C029CUL))
#define bFM4_QPRC0_QICRH_CDCIE                 *((volatile unsigned char*)(0x424C02A0UL))
#define bFM4_QPRC0_QICRH_CDCF                  *((volatile unsigned char*)(0x424C02A4UL))
#define bFM4_QPRC0_QICRH_DIRPC                 *((volatile unsigned char*)(0x424C02A8UL))
#define bFM4_QPRC0_QICRH_DIROU                 *((volatile unsigned char*)(0x424C02ACUL))
#define bFM4_QPRC0_QICRH_QPCNRCMIE             *((volatile unsigned char*)(0x424C02B0UL))
#define bFM4_QPRC0_QICRH_QPCNRCMF              *((volatile unsigned char*)(0x424C02B4UL))
#define bFM4_QPRC0_QCR_PCM0                    *((volatile unsigned char*)(0x424C0300UL))
#define bFM4_QPRC0_QCR_PCM1                    *((volatile unsigned char*)(0x424C0304UL))
#define bFM4_QPRC0_QCR_RCM0                    *((volatile unsigned char*)(0x424C0308UL))
#define bFM4_QPRC0_QCR_RCM1                    *((volatile unsigned char*)(0x424C030CUL))
#define bFM4_QPRC0_QCR_PSTP                    *((volatile unsigned char*)(0x424C0310UL))
#define bFM4_QPRC0_QCR_CGSC                    *((volatile unsigned char*)(0x424C0314UL))
#define bFM4_QPRC0_QCR_RSEL                    *((volatile unsigned char*)(0x424C0318UL))
#define bFM4_QPRC0_QCR_SWAP                    *((volatile unsigned char*)(0x424C031CUL))
#define bFM4_QPRC0_QCR_PCRM0                   *((volatile unsigned char*)(0x424C0320UL))
#define bFM4_QPRC0_QCR_PCRM1                   *((volatile unsigned char*)(0x424C0324UL))
#define bFM4_QPRC0_QCR_AES0                    *((volatile unsigned char*)(0x424C0328UL))
#define bFM4_QPRC0_QCR_AES1                    *((volatile unsigned char*)(0x424C032CUL))
#define bFM4_QPRC0_QCR_BES0                    *((volatile unsigned char*)(0x424C0330UL))
#define bFM4_QPRC0_QCR_BES1                    *((volatile unsigned char*)(0x424C0334UL))
#define bFM4_QPRC0_QCR_CGE0                    *((volatile unsigned char*)(0x424C0338UL))
#define bFM4_QPRC0_QCR_CGE1                    *((volatile unsigned char*)(0x424C033CUL))
#define bFM4_QPRC0_QCRL_PCM0                   *((volatile unsigned char*)(0x424C0300UL))
#define bFM4_QPRC0_QCRL_PCM1                   *((volatile unsigned char*)(0x424C0304UL))
#define bFM4_QPRC0_QCRL_RCM0                   *((volatile unsigned char*)(0x424C0308UL))
#define bFM4_QPRC0_QCRL_RCM1                   *((volatile unsigned char*)(0x424C030CUL))
#define bFM4_QPRC0_QCRL_PSTP                   *((volatile unsigned char*)(0x424C0310UL))
#define bFM4_QPRC0_QCRL_CGSC                   *((volatile unsigned char*)(0x424C0314UL))
#define bFM4_QPRC0_QCRL_RSEL                   *((volatile unsigned char*)(0x424C0318UL))
#define bFM4_QPRC0_QCRL_SWAP                   *((volatile unsigned char*)(0x424C031CUL))
#define bFM4_QPRC0_QCRH_PCRM0                  *((volatile unsigned char*)(0x424C0320UL))
#define bFM4_QPRC0_QCRH_PCRM1                  *((volatile unsigned char*)(0x424C0324UL))
#define bFM4_QPRC0_QCRH_AES0                   *((volatile unsigned char*)(0x424C0328UL))
#define bFM4_QPRC0_QCRH_AES1                   *((volatile unsigned char*)(0x424C032CUL))
#define bFM4_QPRC0_QCRH_BES0                   *((volatile unsigned char*)(0x424C0330UL))
#define bFM4_QPRC0_QCRH_BES1                   *((volatile unsigned char*)(0x424C0334UL))
#define bFM4_QPRC0_QCRH_CGE0                   *((volatile unsigned char*)(0x424C0338UL))
#define bFM4_QPRC0_QCRH_CGE1                   *((volatile unsigned char*)(0x424C033CUL))
#define bFM4_QPRC0_QECR_ORNGMD                 *((volatile unsigned char*)(0x424C0380UL))
#define bFM4_QPRC0_QECR_ORNGF                  *((volatile unsigned char*)(0x424C0384UL))
#define bFM4_QPRC0_QECR_ORNGIE                 *((volatile unsigned char*)(0x424C0388UL))
#define bFM4_QPRC0_QECR_PEC                    *((volatile unsigned char*)(0x424C038CUL))

/* Quad position and revolution counter channel 1 registers */

