MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* Interrupt request read registers */
#define bFM4_INTREQ_DRQSEL_USBEP1                                     *((volatile unsigned char*)(0x42620000UL))
#define bFM4_INTREQ_DRQSEL_USBEP2                                     *((volatile unsigned char*)(0x42620004UL))
#define bFM4_INTREQ_DRQSEL_USBEP3                                     *((volatile unsigned char*)(0x42620008UL))
#define bFM4_INTREQ_DRQSEL_USBEP4                                     *((volatile unsigned char*)(0x4262000CUL))
#define bFM4_INTREQ_DRQSEL_USBEP5                                     *((volatile unsigned char*)(0x42620010UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN0                                   *((volatile unsigned char*)(0x42620014UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN1                                   *((volatile unsigned char*)(0x42620018UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN2                                   *((volatile unsigned char*)(0x4262001CUL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT0                                    *((volatile unsigned char*)(0x42620020UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT2                                    *((volatile unsigned char*)(0x42620024UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT4                                    *((volatile unsigned char*)(0x42620028UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT6                                    *((volatile unsigned char*)(0x4262002CUL))
#define bFM4_INTREQ_DRQSEL_MFS0RX                                     *((volatile unsigned char*)(0x42620030UL))
#define bFM4_INTREQ_DRQSEL_MFS0TX                                     *((volatile unsigned char*)(0x42620034UL))
#define bFM4_INTREQ_DRQSEL_MFS1RX                                     *((volatile unsigned char*)(0x42620038UL))
#define bFM4_INTREQ_DRQSEL_MFS1TX                                     *((volatile unsigned char*)(0x4262003CUL))
#define bFM4_INTREQ_DRQSEL_MFS2RX                                     *((volatile unsigned char*)(0x42620040UL))
#define bFM4_INTREQ_DRQSEL_MFS2TX                                     *((volatile unsigned char*)(0x42620044UL))
#define bFM4_INTREQ_DRQSEL_MFS3RX                                     *((volatile unsigned char*)(0x42620048UL))
#define bFM4_INTREQ_DRQSEL_MFS3TX                                     *((volatile unsigned char*)(0x4262004CUL))
#define bFM4_INTREQ_DRQSEL_MFS4RX                                     *((volatile unsigned char*)(0x42620050UL))
#define bFM4_INTREQ_DRQSEL_MFS4TX                                     *((volatile unsigned char*)(0x42620054UL))
#define bFM4_INTREQ_DRQSEL_MFS5RX                                     *((volatile unsigned char*)(0x42620058UL))
#define bFM4_INTREQ_DRQSEL_MFS5TX                                     *((volatile unsigned char*)(0x4262005CUL))
#define bFM4_INTREQ_DRQSEL_MFS6RX                                     *((volatile unsigned char*)(0x42620060UL))
#define bFM4_INTREQ_DRQSEL_MFS6TX                                     *((volatile unsigned char*)(0x42620064UL))
#define bFM4_INTREQ_DRQSEL_MFS7RX                                     *((volatile unsigned char*)(0x42620068UL))
#define bFM4_INTREQ_DRQSEL_MFS7TX                                     *((volatile unsigned char*)(0x4262006CUL))
#define bFM4_INTREQ_DRQSEL_EXINT0                                     *((volatile unsigned char*)(0x42620070UL))
#define bFM4_INTREQ_DRQSEL_EXINT1                                     *((volatile unsigned char*)(0x42620074UL))
#define bFM4_INTREQ_DRQSEL_EXINT2                                     *((volatile unsigned char*)(0x42620078UL))
#define bFM4_INTREQ_DRQSEL_EXINT3                                     *((volatile unsigned char*)(0x4262007CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS0                                    *((volatile unsigned char*)(0x42620200UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS1                                    *((volatile unsigned char*)(0x42620204UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS2                                    *((volatile unsigned char*)(0x42620208UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS3                                    *((volatile unsigned char*)(0x4262020CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS4                                    *((volatile unsigned char*)(0x42620210UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS10                                  *((volatile unsigned char*)(0x42620280UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS11                                  *((volatile unsigned char*)(0x42620284UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS12                                  *((volatile unsigned char*)(0x42620288UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS13                                  *((volatile unsigned char*)(0x4262028CUL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS14                                  *((volatile unsigned char*)(0x42620290UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622200UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622204UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622208UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262220CUL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622210UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622214UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622218UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262221CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT0                                 *((volatile unsigned char*)(0x42622240UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT1                                 *((volatile unsigned char*)(0x42622244UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT2                                 *((volatile unsigned char*)(0x42622248UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT3                                 *((volatile unsigned char*)(0x4262224CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT4                                 *((volatile unsigned char*)(0x42622250UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT5                                 *((volatile unsigned char*)(0x42622254UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT6                                 *((volatile unsigned char*)(0x42622258UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT7                                 *((volatile unsigned char*)(0x4262225CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT8                                 *((volatile unsigned char*)(0x42622260UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT9                                 *((volatile unsigned char*)(0x42622264UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT10                                *((volatile unsigned char*)(0x42622268UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT11                                *((volatile unsigned char*)(0x4262226CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT12                                *((volatile unsigned char*)(0x42622270UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT13                                *((volatile unsigned char*)(0x42622274UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT14                                *((volatile unsigned char*)(0x42622278UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT15                                *((volatile unsigned char*)(0x4262227CUL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622280UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622284UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622288UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262228CUL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622290UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622294UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622298UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262229CUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT0                                 *((volatile unsigned char*)(0x426222C0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT1                                 *((volatile unsigned char*)(0x426222C4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT2                                 *((volatile unsigned char*)(0x426222C8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT3                                 *((volatile unsigned char*)(0x426222CCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT4                                 *((volatile unsigned char*)(0x426222D0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT5                                 *((volatile unsigned char*)(0x426222D4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT6                                 *((volatile unsigned char*)(0x426222D8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT7                                 *((volatile unsigned char*)(0x426222DCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT8                                 *((volatile unsigned char*)(0x426222E0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT9                                 *((volatile unsigned char*)(0x426222E4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT10                                *((volatile unsigned char*)(0x426222E8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT11                                *((volatile unsigned char*)(0x426222ECUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT12                                *((volatile unsigned char*)(0x426222F0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT13                                *((volatile unsigned char*)(0x426222F4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT14                                *((volatile unsigned char*)(0x426222F8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT15                                *((volatile unsigned char*)(0x426222FCUL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622300UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622304UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622308UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262230CUL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622310UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622314UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622318UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262231CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT0                                 *((volatile unsigned char*)(0x42622340UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT1                                 *((volatile unsigned char*)(0x42622344UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT2                                 *((volatile unsigned char*)(0x42622348UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT3                                 *((volatile unsigned char*)(0x4262234CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT4                                 *((volatile unsigned char*)(0x42622350UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT5                                 *((volatile unsigned char*)(0x42622354UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT6                                 *((volatile unsigned char*)(0x42622358UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT7                                 *((volatile unsigned char*)(0x4262235CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT8                                 *((volatile unsigned char*)(0x42622360UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT9                                 *((volatile unsigned char*)(0x42622364UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT10                                *((volatile unsigned char*)(0x42622368UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT11                                *((volatile unsigned char*)(0x4262236CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT12                                *((volatile unsigned char*)(0x42622370UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT13                                *((volatile unsigned char*)(0x42622374UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT14                                *((volatile unsigned char*)(0x42622378UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT15                                *((volatile unsigned char*)(0x4262237CUL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622380UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622384UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622388UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262238CUL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622390UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622394UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622398UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262239CUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT0                                 *((volatile unsigned char*)(0x426223C0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT1                                 *((volatile unsigned char*)(0x426223C4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT2                                 *((volatile unsigned char*)(0x426223C8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT3                                 *((volatile unsigned char*)(0x426223CCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT4                                 *((volatile unsigned char*)(0x426223D0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT5                                 *((volatile unsigned char*)(0x426223D4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT6                                 *((volatile unsigned char*)(0x426223D8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT7                                 *((volatile unsigned char*)(0x426223DCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT8                                 *((volatile unsigned char*)(0x426223E0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT9                                 *((volatile unsigned char*)(0x426223E4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT10                                *((volatile unsigned char*)(0x426223E8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT11                                *((volatile unsigned char*)(0x426223ECUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT12                                *((volatile unsigned char*)(0x426223F0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT13                                *((volatile unsigned char*)(0x426223F4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT14                                *((volatile unsigned char*)(0x426223F8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT15                                *((volatile unsigned char*)(0x426223FCUL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622400UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622404UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622408UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262240CUL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622410UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622414UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622418UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262241CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT0                                 *((volatile unsigned char*)(0x42622440UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT1                                 *((volatile unsigned char*)(0x42622444UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT2                                 *((volatile unsigned char*)(0x42622448UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT3                                 *((volatile unsigned char*)(0x4262244CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT4                                 *((volatile unsigned char*)(0x42622450UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT5                                 *((volatile unsigned char*)(0x42622454UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT6                                 *((volatile unsigned char*)(0x42622458UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT7                                 *((volatile unsigned char*)(0x4262245CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT8                                 *((volatile unsigned char*)(0x42622460UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT9                                 *((volatile unsigned char*)(0x42622464UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT10                                *((volatile unsigned char*)(0x42622468UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT11                                *((volatile unsigned char*)(0x4262246CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT12                                *((volatile unsigned char*)(0x42622470UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT13                                *((volatile unsigned char*)(0x42622474UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT14                                *((volatile unsigned char*)(0x42622478UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT15                                *((volatile unsigned char*)(0x4262247CUL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622480UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622484UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622488UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262248CUL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622490UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622494UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622498UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262249CUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT0                                 *((volatile unsigned char*)(0x426224C0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT1                                 *((volatile unsigned char*)(0x426224C4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT2                                 *((volatile unsigned char*)(0x426224C8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT3                                 *((volatile unsigned char*)(0x426224CCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT4                                 *((volatile unsigned char*)(0x426224D0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT5                                 *((volatile unsigned char*)(0x426224D4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT6                                 *((volatile unsigned char*)(0x426224D8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT7                                 *((volatile unsigned char*)(0x426224DCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT8                                 *((volatile unsigned char*)(0x426224E0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT9                                 *((volatile unsigned char*)(0x426224E4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT10                                *((volatile unsigned char*)(0x426224E8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT11                                *((volatile unsigned char*)(0x426224ECUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT12                                *((volatile unsigned char*)(0x426224F0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT13                                *((volatile unsigned char*)(0x426224F4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT14                                *((volatile unsigned char*)(0x426224F8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT15                                *((volatile unsigned char*)(0x426224FCUL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622500UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622504UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622508UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262250CUL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622510UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622514UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622518UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262251CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT0                                 *((volatile unsigned char*)(0x42622540UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT1                                 *((volatile unsigned char*)(0x42622544UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT2                                 *((volatile unsigned char*)(0x42622548UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT3                                 *((volatile unsigned char*)(0x4262254CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT4                                 *((volatile unsigned char*)(0x42622550UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT5                                 *((volatile unsigned char*)(0x42622554UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT6                                 *((volatile unsigned char*)(0x42622558UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT7                                 *((volatile unsigned char*)(0x4262255CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT8                                 *((volatile unsigned char*)(0x42622560UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT9                                 *((volatile unsigned char*)(0x42622564UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT10                                *((volatile unsigned char*)(0x42622568UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT11                                *((volatile unsigned char*)(0x4262256CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT12                                *((volatile unsigned char*)(0x42622570UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT13                                *((volatile unsigned char*)(0x42622574UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT14                                *((volatile unsigned char*)(0x42622578UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT15                                *((volatile unsigned char*)(0x4262257CUL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ0                                 *((volatile unsigned char*)(0x42622580UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ1                                 *((volatile unsigned char*)(0x42622584UL))
