MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_INTREQ_IRQ010SEL_SELIRQ2                                 *((volatile unsigned char*)(0x42622588UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ3                                 *((volatile unsigned char*)(0x4262258CUL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ4                                 *((volatile unsigned char*)(0x42622590UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ5                                 *((volatile unsigned char*)(0x42622594UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ6                                 *((volatile unsigned char*)(0x42622598UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ7                                 *((volatile unsigned char*)(0x4262259CUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT0                                 *((volatile unsigned char*)(0x426225C0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT1                                 *((volatile unsigned char*)(0x426225C4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT2                                 *((volatile unsigned char*)(0x426225C8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT3                                 *((volatile unsigned char*)(0x426225CCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT4                                 *((volatile unsigned char*)(0x426225D0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT5                                 *((volatile unsigned char*)(0x426225D4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT6                                 *((volatile unsigned char*)(0x426225D8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT7                                 *((volatile unsigned char*)(0x426225DCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT8                                 *((volatile unsigned char*)(0x426225E0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT9                                 *((volatile unsigned char*)(0x426225E4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT10                                *((volatile unsigned char*)(0x426225E8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT11                                *((volatile unsigned char*)(0x426225ECUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT12                                *((volatile unsigned char*)(0x426225F0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT13                                *((volatile unsigned char*)(0x426225F4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT14                                *((volatile unsigned char*)(0x426225F8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT15                                *((volatile unsigned char*)(0x426225FCUL))
#define bFM4_INTREQ_EXC02MON_NMI                                      *((volatile unsigned char*)(0x42624000UL))
#define bFM4_INTREQ_EXC02MON_HWINT                                    *((volatile unsigned char*)(0x42624004UL))
#define bFM4_INTREQ_IRQ000MON_FCSINT                                  *((volatile unsigned char*)(0x42624080UL))
#define bFM4_INTREQ_IRQ001MON_SWWDTINT                                *((volatile unsigned char*)(0x42624100UL))
#define bFM4_INTREQ_IRQ002MON_LVDINT                                  *((volatile unsigned char*)(0x42624180UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624200UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624204UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624208UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262420CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624210UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624214UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624218UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262421CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624280UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624284UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624288UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262428CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624290UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624294UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624298UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262429CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624300UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624304UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624308UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262430CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624310UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624314UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624318UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262431CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624380UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624384UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624388UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262438CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624390UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624394UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624398UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262439CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624400UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624404UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624408UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262440CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624410UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624414UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624418UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262441CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624480UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624484UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624488UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262448CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624490UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624494UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624498UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262449CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624500UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624504UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624508UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262450CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624510UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624514UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624518UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262451CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT0                                 *((volatile unsigned char*)(0x42624580UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT1                                 *((volatile unsigned char*)(0x42624584UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT2                                 *((volatile unsigned char*)(0x42624588UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT3                                 *((volatile unsigned char*)(0x4262458CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT4                                 *((volatile unsigned char*)(0x42624590UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT5                                 *((volatile unsigned char*)(0x42624594UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT6                                 *((volatile unsigned char*)(0x42624598UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT7                                 *((volatile unsigned char*)(0x4262459CUL))
#define bFM4_INTREQ_IRQ011MON_EXTINT                                  *((volatile unsigned char*)(0x42624600UL))
#define bFM4_INTREQ_IRQ012MON_EXTINT                                  *((volatile unsigned char*)(0x42624680UL))
#define bFM4_INTREQ_IRQ013MON_EXTINT                                  *((volatile unsigned char*)(0x42624700UL))
#define bFM4_INTREQ_IRQ014MON_EXTINT                                  *((volatile unsigned char*)(0x42624780UL))
#define bFM4_INTREQ_IRQ015MON_EXTINT                                  *((volatile unsigned char*)(0x42624800UL))
#define bFM4_INTREQ_IRQ016MON_EXTINT                                  *((volatile unsigned char*)(0x42624880UL))
#define bFM4_INTREQ_IRQ017MON_EXTINT                                  *((volatile unsigned char*)(0x42624900UL))
#define bFM4_INTREQ_IRQ018MON_EXTINT                                  *((volatile unsigned char*)(0x42624980UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT0                                 *((volatile unsigned char*)(0x42624A00UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT1                                 *((volatile unsigned char*)(0x42624A04UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT2                                 *((volatile unsigned char*)(0x42624A08UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT3                                 *((volatile unsigned char*)(0x42624A0CUL))
#define bFM4_INTREQ_IRQ019MON_QUDINT4                                 *((volatile unsigned char*)(0x42624A10UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT5                                 *((volatile unsigned char*)(0x42624A14UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT0                                 *((volatile unsigned char*)(0x42624A80UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT1                                 *((volatile unsigned char*)(0x42624A84UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT2                                 *((volatile unsigned char*)(0x42624A88UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT3                                 *((volatile unsigned char*)(0x42624A8CUL))
#define bFM4_INTREQ_IRQ020MON_QUDINT4                                 *((volatile unsigned char*)(0x42624A90UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT5                                 *((volatile unsigned char*)(0x42624A94UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT0                                *((volatile unsigned char*)(0x42624B00UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT1                                *((volatile unsigned char*)(0x42624B04UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT2                                *((volatile unsigned char*)(0x42624B08UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT3                                *((volatile unsigned char*)(0x42624B0CUL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT0                                *((volatile unsigned char*)(0x42624B80UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT1                                *((volatile unsigned char*)(0x42624B84UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT2                                *((volatile unsigned char*)(0x42624B88UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT3                                *((volatile unsigned char*)(0x42624B8CUL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT0                                *((volatile unsigned char*)(0x42624C00UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT1                                *((volatile unsigned char*)(0x42624C04UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT2                                *((volatile unsigned char*)(0x42624C08UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT3                                *((volatile unsigned char*)(0x42624C0CUL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT0                           *((volatile unsigned char*)(0x42624C80UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT1                           *((volatile unsigned char*)(0x42624C84UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT2                           *((volatile unsigned char*)(0x42624C88UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT0                           *((volatile unsigned char*)(0x42624D00UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT1                           *((volatile unsigned char*)(0x42624D04UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT2                           *((volatile unsigned char*)(0x42624D08UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT0                                 *((volatile unsigned char*)(0x42624D80UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT1                                 *((volatile unsigned char*)(0x42624D84UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT2                                 *((volatile unsigned char*)(0x42624D88UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT3                                 *((volatile unsigned char*)(0x42624D8CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT0                                 *((volatile unsigned char*)(0x42624E00UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT1                                 *((volatile unsigned char*)(0x42624E04UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT2                                 *((volatile unsigned char*)(0x42624E08UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT3                                 *((volatile unsigned char*)(0x42624E0CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT4                                 *((volatile unsigned char*)(0x42624E10UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT5                                 *((volatile unsigned char*)(0x42624E14UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT0                           *((volatile unsigned char*)(0x42624E80UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT1                           *((volatile unsigned char*)(0x42624E84UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT2                           *((volatile unsigned char*)(0x42624E88UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT0                           *((volatile unsigned char*)(0x42624F00UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT1                           *((volatile unsigned char*)(0x42624F04UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT2                           *((volatile unsigned char*)(0x42624F08UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT0                                 *((volatile unsigned char*)(0x42624F80UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT1                                 *((volatile unsigned char*)(0x42624F84UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT2                                 *((volatile unsigned char*)(0x42624F88UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT3                                 *((volatile unsigned char*)(0x42624F8CUL))
#define bFM4_INTREQ_IRQ031MON_OCUINT0                                 *((volatile unsigned char*)(0x42625000UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT1                                 *((volatile unsigned char*)(0x42625004UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT2                                 *((volatile unsigned char*)(0x42625008UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT3                                 *((volatile unsigned char*)(0x4262500CUL))
#define bFM4_INTREQ_IRQ031MON_OCUINT4                                 *((volatile unsigned char*)(0x42625010UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT5                                 *((volatile unsigned char*)(0x42625014UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT0                           *((volatile unsigned char*)(0x42625080UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT1                           *((volatile unsigned char*)(0x42625084UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT2                           *((volatile unsigned char*)(0x42625088UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT0                           *((volatile unsigned char*)(0x42625100UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT1                           *((volatile unsigned char*)(0x42625104UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT2                           *((volatile unsigned char*)(0x42625108UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT0                                 *((volatile unsigned char*)(0x42625180UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT1                                 *((volatile unsigned char*)(0x42625184UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT2                                 *((volatile unsigned char*)(0x42625188UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT3                                 *((volatile unsigned char*)(0x4262518CUL))
#define bFM4_INTREQ_IRQ035MON_OCUINT0                                 *((volatile unsigned char*)(0x42625200UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT1                                 *((volatile unsigned char*)(0x42625204UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT2                                 *((volatile unsigned char*)(0x42625208UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT3                                 *((volatile unsigned char*)(0x4262520CUL))
#define bFM4_INTREQ_IRQ035MON_OCUINT4                                 *((volatile unsigned char*)(0x42625210UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT5                                 *((volatile unsigned char*)(0x42625214UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT0                                 *((volatile unsigned char*)(0x42625280UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT1                                 *((volatile unsigned char*)(0x42625284UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT2                                 *((volatile unsigned char*)(0x42625288UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT0                                 *((volatile unsigned char*)(0x42625300UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT1                                 *((volatile unsigned char*)(0x42625304UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT2                                 *((volatile unsigned char*)(0x42625308UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT0                                 *((volatile unsigned char*)(0x42625380UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT1                                 *((volatile unsigned char*)(0x42625384UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT2                                 *((volatile unsigned char*)(0x42625388UL))
#define bFM4_INTREQ_IRQ039MON_BTINT0                                  *((volatile unsigned char*)(0x42625400UL))
#define bFM4_INTREQ_IRQ039MON_BTINT1                                  *((volatile unsigned char*)(0x42625404UL))
#define bFM4_INTREQ_IRQ040MON_BTINT0                                  *((volatile unsigned char*)(0x42625480UL))
#define bFM4_INTREQ_IRQ040MON_BTINT1                                  *((volatile unsigned char*)(0x42625484UL))
#define bFM4_INTREQ_IRQ041MON_BTINT0                                  *((volatile unsigned char*)(0x42625500UL))
#define bFM4_INTREQ_IRQ041MON_BTINT1                                  *((volatile unsigned char*)(0x42625504UL))
#define bFM4_INTREQ_IRQ042MON_BTINT0                                  *((volatile unsigned char*)(0x42625580UL))
#define bFM4_INTREQ_IRQ042MON_BTINT1                                  *((volatile unsigned char*)(0x42625584UL))
#define bFM4_INTREQ_IRQ043MON_BTINT0                                  *((volatile unsigned char*)(0x42625600UL))
#define bFM4_INTREQ_IRQ043MON_BTINT1                                  *((volatile unsigned char*)(0x42625604UL))
#define bFM4_INTREQ_IRQ044MON_BTINT0                                  *((volatile unsigned char*)(0x42625680UL))
#define bFM4_INTREQ_IRQ044MON_BTINT1                                  *((volatile unsigned char*)(0x42625684UL))
#define bFM4_INTREQ_IRQ045MON_BTINT0                                  *((volatile unsigned char*)(0x42625700UL))
#define bFM4_INTREQ_IRQ045MON_BTINT1                                  *((volatile unsigned char*)(0x42625704UL))
#define bFM4_INTREQ_IRQ046MON_BTINT0                                  *((volatile unsigned char*)(0x42625780UL))
#define bFM4_INTREQ_IRQ046MON_BTINT1                                  *((volatile unsigned char*)(0x42625784UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT1                                 *((volatile unsigned char*)(0x42625800UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT2                                 *((volatile unsigned char*)(0x42625804UL))
#define bFM4_INTREQ_IRQ048MON_WCINT                                   *((volatile unsigned char*)(0x42625880UL))
#define bFM4_INTREQ_IRQ049MON_BMEMCS                                  *((volatile unsigned char*)(0x42625900UL))
#define bFM4_INTREQ_IRQ049MON_GSDRAM                                  *((volatile unsigned char*)(0x42625904UL))
#define bFM4_INTREQ_IRQ050MON_RTCINT                                  *((volatile unsigned char*)(0x42625980UL))
#define bFM4_INTREQ_IRQ051MON_EXTINT                                  *((volatile unsigned char*)(0x42625A00UL))
#define bFM4_INTREQ_IRQ052MON_EXTINT                                  *((volatile unsigned char*)(0x42625A80UL))
#define bFM4_INTREQ_IRQ053MON_EXTINT                                  *((volatile unsigned char*)(0x42625B00UL))
#define bFM4_INTREQ_IRQ054MON_EXTINT                                  *((volatile unsigned char*)(0x42625B80UL))
#define bFM4_INTREQ_IRQ055MON_EXTINT                                  *((volatile unsigned char*)(0x42625C00UL))
#define bFM4_INTREQ_IRQ056MON_EXTINT                                  *((volatile unsigned char*)(0x42625C80UL))
#define bFM4_INTREQ_IRQ057MON_EXTINT                                  *((volatile unsigned char*)(0x42625D00UL))
#define bFM4_INTREQ_IRQ058MON_EXTINT                                  *((volatile unsigned char*)(0x42625D80UL))
#define bFM4_INTREQ_IRQ059MON_MOSCINT                                 *((volatile unsigned char*)(0x42625E00UL))
#define bFM4_INTREQ_IRQ059MON_SOSCINT                                 *((volatile unsigned char*)(0x42625E04UL))
