MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* 12-bit DAC unit 1 registers */

/* HDMI-CEC ch.0 registers */

/* HDMI-CEC ch.1 registers */

/* Low voltage detection registers */
#define bFM4_LVD_LVD_CTL_SVHI0                 *((volatile unsigned char*)(0x426A0008UL))
#define bFM4_LVD_LVD_CTL_SVHI1                 *((volatile unsigned char*)(0x426A000CUL))
#define bFM4_LVD_LVD_CTL_SVHI2                 *((volatile unsigned char*)(0x426A0010UL))
#define bFM4_LVD_LVD_CTL_SVHI3                 *((volatile unsigned char*)(0x426A0014UL))
#define bFM4_LVD_LVD_CTL_SVHI4                 *((volatile unsigned char*)(0x426A0018UL))
#define bFM4_LVD_LVD_CTL_LVDIE                 *((volatile unsigned char*)(0x426A001CUL))
#define bFM4_LVD_LVD_STR_LVDIR                 *((volatile unsigned char*)(0x426A009CUL))
#define bFM4_LVD_LVD_CLR_LVDCL                 *((volatile unsigned char*)(0x426A011CUL))
#define bFM4_LVD_LVD_STR2_LVDIRDY              *((volatile unsigned char*)(0x426A021CUL))

/* DS mode registers */
#define bFM4_DS_RCK_CTL_CECCKE                 *((volatile unsigned char*)(0x426A2084UL))
#define bFM4_DS_PMD_CTL_RTCE                   *((volatile unsigned char*)(0x426B0000UL))
#define bFM4_DS_WRFSR_WINITX                   *((volatile unsigned char*)(0x426B0080UL))
#define bFM4_DS_WRFSR_WLVDH                    *((volatile unsigned char*)(0x426B0084UL))
#define bFM4_DS_WIFSR_WRTCI                    *((volatile unsigned char*)(0x426B0100UL))
#define bFM4_DS_WIFSR_WLVDI                    *((volatile unsigned char*)(0x426B0104UL))
#define bFM4_DS_WIFSR_WUI0                     *((volatile unsigned char*)(0x426B0108UL))
#define bFM4_DS_WIFSR_WUI1                     *((volatile unsigned char*)(0x426B010CUL))
#define bFM4_DS_WIFSR_WUI2                     *((volatile unsigned char*)(0x426B0110UL))
#define bFM4_DS_WIFSR_WUI3                     *((volatile unsigned char*)(0x426B0114UL))
#define bFM4_DS_WIFSR_WUI4                     *((volatile unsigned char*)(0x426B0118UL))
#define bFM4_DS_WIFSR_WUI5                     *((volatile unsigned char*)(0x426B011CUL))
#define bFM4_DS_WIER_WRTCE                     *((volatile unsigned char*)(0x426B0180UL))
#define bFM4_DS_WIER_WLVDE                     *((volatile unsigned char*)(0x426B0184UL))
#define bFM4_DS_WIER_WUI1E                     *((volatile unsigned char*)(0x426B018CUL))
#define bFM4_DS_WIER_WUI2E                     *((volatile unsigned char*)(0x426B0190UL))
#define bFM4_DS_WIER_WUI3E                     *((volatile unsigned char*)(0x426B0194UL))
#define bFM4_DS_WIER_WUI4E                     *((volatile unsigned char*)(0x426B0198UL))
#define bFM4_DS_WIER_WUI5E                     *((volatile unsigned char*)(0x426B019CUL))
#define bFM4_DS_WILVR_WUI1LV                   *((volatile unsigned char*)(0x426B0200UL))
#define bFM4_DS_WILVR_WUI2LV                   *((volatile unsigned char*)(0x426B0204UL))
#define bFM4_DS_WILVR_WUI3LV                   *((volatile unsigned char*)(0x426B0208UL))
#define bFM4_DS_WILVR_WUI4LV                   *((volatile unsigned char*)(0x426B020CUL))
#define bFM4_DS_WILVR_WUI5LV                   *((volatile unsigned char*)(0x426B0210UL))
#define bFM4_DS_DSRAMR_SRAMR0                  *((volatile unsigned char*)(0x426B0280UL))
#define bFM4_DS_DSRAMR_SRAMR1                  *((volatile unsigned char*)(0x426B0284UL))

/* USB clock registers */
#define bFM4_USBCLK_UCCR_UCEN0                                        *((volatile unsigned char*)(0x426C0000UL))
#define bFM4_USBCLK_UCCR_UCSEL                                        *((volatile unsigned char*)(0x426C0004UL))
#define bFM4_USBCLK_UCCR_UCEN1                                        *((volatile unsigned char*)(0x426C000CUL))
#define bFM4_USBCLK_UPCR1_UPLLEN                                      *((volatile unsigned char*)(0x426C0080UL))
#define bFM4_USBCLK_UPCR1_UPINC                                       *((volatile unsigned char*)(0x426C0084UL))
#define bFM4_USBCLK_UPCR2_UPOWT0                                      *((volatile unsigned char*)(0x426C0100UL))
#define bFM4_USBCLK_UPCR2_UPOWT1                                      *((volatile unsigned char*)(0x426C0104UL))
#define bFM4_USBCLK_UPCR2_UPOWT2                                      *((volatile unsigned char*)(0x426C0108UL))
#define bFM4_USBCLK_UPCR3_UPLLK0                                      *((volatile unsigned char*)(0x426C0180UL))
#define bFM4_USBCLK_UPCR3_UPLLK1                                      *((volatile unsigned char*)(0x426C0184UL))
#define bFM4_USBCLK_UPCR3_UPLLK2                                      *((volatile unsigned char*)(0x426C0188UL))
#define bFM4_USBCLK_UPCR3_UPLLK3                                      *((volatile unsigned char*)(0x426C018CUL))
#define bFM4_USBCLK_UPCR3_UPLLK4                                      *((volatile unsigned char*)(0x426C0190UL))
#define bFM4_USBCLK_UPCR4_UPLLN0                                      *((volatile unsigned char*)(0x426C0200UL))
#define bFM4_USBCLK_UPCR4_UPLLN1                                      *((volatile unsigned char*)(0x426C0204UL))
#define bFM4_USBCLK_UPCR4_UPLLN2                                      *((volatile unsigned char*)(0x426C0208UL))
#define bFM4_USBCLK_UPCR4_UPLLN3                                      *((volatile unsigned char*)(0x426C020CUL))
#define bFM4_USBCLK_UPCR4_UPLLN4                                      *((volatile unsigned char*)(0x426C0210UL))
#define bFM4_USBCLK_UPCR4_UPLLN5                                      *((volatile unsigned char*)(0x426C0214UL))
#define bFM4_USBCLK_UPCR4_UPLLN6                                      *((volatile unsigned char*)(0x426C0218UL))
#define bFM4_USBCLK_UP_STR_UPRDY                                      *((volatile unsigned char*)(0x426C0280UL))
#define bFM4_USBCLK_UPINT_ENR_UPCSE                                   *((volatile unsigned char*)(0x426C0300UL))
#define bFM4_USBCLK_UPINT_CLR_UPCSC                                   *((volatile unsigned char*)(0x426C0380UL))
#define bFM4_USBCLK_UPINT_STR_UPCSI                                   *((volatile unsigned char*)(0x426C0400UL))
#define bFM4_USBCLK_UPCR5_UPLLM0                                      *((volatile unsigned char*)(0x426C0480UL))
#define bFM4_USBCLK_UPCR5_UPLLM1                                      *((volatile unsigned char*)(0x426C0484UL))
#define bFM4_USBCLK_UPCR5_UPLLM2                                      *((volatile unsigned char*)(0x426C0488UL))
#define bFM4_USBCLK_UPCR5_UPLLM3                                      *((volatile unsigned char*)(0x426C048CUL))
#define bFM4_USBCLK_UPCR6_UBSR0                                       *((volatile unsigned char*)(0x426C0500UL))
#define bFM4_USBCLK_UPCR6_UBSR1                                       *((volatile unsigned char*)(0x426C0504UL))
#define bFM4_USBCLK_UPCR6_UBSR2                                       *((volatile unsigned char*)(0x426C0508UL))
#define bFM4_USBCLK_UPCR6_UBSR3                                       *((volatile unsigned char*)(0x426C050CUL))
#define bFM4_USBCLK_UPCR7_EPLLEN                                      *((volatile unsigned char*)(0x426C0580UL))
#define bFM4_USBCLK_USBEN0_USBEN0                                     *((volatile unsigned char*)(0x426C0600UL))
#define bFM4_USBCLK_USBEN1_USBEN1                                     *((volatile unsigned char*)(0x426C0680UL))

/* CAN prescaler register */
#define bFM4_CANPRES_CANPRE_CANPRE0            *((volatile unsigned char*)(0x426E0000UL))
#define bFM4_CANPRES_CANPRE_CANPRE1            *((volatile unsigned char*)(0x426E0004UL))
#define bFM4_CANPRES_CANPRE_CANPRE2            *((volatile unsigned char*)(0x426E0008UL))
#define bFM4_CANPRES_CANPRE_CANPRE3            *((volatile unsigned char*)(0x426E000CUL))

/* MFS UART channel 0 registers */
#define bFM4_MFS0_UART_SMR_SOE                 *((volatile unsigned char*)(0x42700000UL))
#define bFM4_MFS0_UART_SMR_BDS                 *((volatile unsigned char*)(0x42700008UL))
#define bFM4_MFS0_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270000CUL))
#define bFM4_MFS0_UART_SMR_WUCR                *((volatile unsigned char*)(0x42700010UL))
#define bFM4_MFS0_UART_SMR_MD0                 *((volatile unsigned char*)(0x42700014UL))
#define bFM4_MFS0_UART_SMR_MD1                 *((volatile unsigned char*)(0x42700018UL))
#define bFM4_MFS0_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270001CUL))
#define bFM4_MFS0_UART_SCR_TXE                 *((volatile unsigned char*)(0x42700020UL))
#define bFM4_MFS0_UART_SCR_RXE                 *((volatile unsigned char*)(0x42700024UL))
#define bFM4_MFS0_UART_SCR_TBIE                *((volatile unsigned char*)(0x42700028UL))
#define bFM4_MFS0_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270002CUL))
#define bFM4_MFS0_UART_SCR_RIE                 *((volatile unsigned char*)(0x42700030UL))
#define bFM4_MFS0_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270003CUL))
#define bFM4_MFS0_UART_ESCR_L0                 *((volatile unsigned char*)(0x42700080UL))
#define bFM4_MFS0_UART_ESCR_L1                 *((volatile unsigned char*)(0x42700084UL))
#define bFM4_MFS0_UART_ESCR_L2                 *((volatile unsigned char*)(0x42700088UL))
#define bFM4_MFS0_UART_ESCR_P                  *((volatile unsigned char*)(0x4270008CUL))
#define bFM4_MFS0_UART_ESCR_PEN                *((volatile unsigned char*)(0x42700090UL))
#define bFM4_MFS0_UART_ESCR_INV                *((volatile unsigned char*)(0x42700094UL))
#define bFM4_MFS0_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42700098UL))
#define bFM4_MFS0_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270009CUL))
#define bFM4_MFS0_UART_SSR_TBI                 *((volatile unsigned char*)(0x427000A0UL))
#define bFM4_MFS0_UART_SSR_TDRE                *((volatile unsigned char*)(0x427000A4UL))
#define bFM4_MFS0_UART_SSR_RDRF                *((volatile unsigned char*)(0x427000A8UL))
#define bFM4_MFS0_UART_SSR_ORE                 *((volatile unsigned char*)(0x427000ACUL))
#define bFM4_MFS0_UART_SSR_FRE                 *((volatile unsigned char*)(0x427000B0UL))
#define bFM4_MFS0_UART_SSR_PE                  *((volatile unsigned char*)(0x427000B4UL))
#define bFM4_MFS0_UART_SSR_REC                 *((volatile unsigned char*)(0x427000BCUL))
#define bFM4_MFS0_UART_BGR_EXT                 *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_UART_BGR1_EXT                *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_UART_FCR_FE1                 *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR_FE2                 *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR_FCL1                *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR_FSET                *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR_FLD                 *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR_FLST                *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR_FSEL                *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR_FTIE                *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_UART_FCR0_FE1                *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_UART_FCR0_FE2                *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_UART_FCR0_FSET               *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_UART_FCR0_FLD                *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_UART_FCR0_FLST               *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270033CUL))

