MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* MFS CSIO channel 4 registers */
#define bFM4_MFS4_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x42708000UL))
#define bFM4_MFS4_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x42708004UL))
#define bFM4_MFS4_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x42708008UL))
#define bFM4_MFS4_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270800CUL))
#define bFM4_MFS4_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x42708014UL))
#define bFM4_MFS4_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x42708018UL))
#define bFM4_MFS4_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270801CUL))
#define bFM4_MFS4_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x42708020UL))
#define bFM4_MFS4_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x42708024UL))
#define bFM4_MFS4_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x42708028UL))
#define bFM4_MFS4_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270802CUL))
#define bFM4_MFS4_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x42708030UL))
#define bFM4_MFS4_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x42708034UL))
#define bFM4_MFS4_CSIO_SCR_MS                  *((volatile unsigned char*)(0x42708038UL))
#define bFM4_MFS4_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270803CUL))
#define bFM4_MFS4_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x42708080UL))
#define bFM4_MFS4_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x42708084UL))
#define bFM4_MFS4_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x42708088UL))
#define bFM4_MFS4_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270808CUL))
#define bFM4_MFS4_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x42708090UL))
#define bFM4_MFS4_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x42708094UL))
#define bFM4_MFS4_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x42708098UL))
#define bFM4_MFS4_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270809CUL))
#define bFM4_MFS4_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x427080A0UL))
#define bFM4_MFS4_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x427080A4UL))
#define bFM4_MFS4_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x427080A8UL))
#define bFM4_MFS4_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x427080ACUL))
#define bFM4_MFS4_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x427080B0UL))
#define bFM4_MFS4_CSIO_SSR_REC                 *((volatile unsigned char*)(0x427080BCUL))
#define bFM4_MFS4_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_CSIO_FCR_FSET                *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_CSIO_FCR_FLST                *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270833CUL))
#define bFM4_MFS4_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270833CUL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x42708380UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x42708384UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x42708388UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270838CUL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x42708390UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x42708394UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x42708398UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270839CUL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x427083A0UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x427083A4UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x427083A8UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x427083ACUL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x427083B0UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x427083B4UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x427083B8UL))
#define bFM4_MFS4_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x427083BCUL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x42708400UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x42708404UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x42708408UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270840CUL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x42708410UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x42708414UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x42708418UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270841CUL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x42708420UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x42708424UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x42708428UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270842CUL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x42708430UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x42708434UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x42708438UL))
#define bFM4_MFS4_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270843CUL))
#define bFM4_MFS4_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x42708480UL))
#define bFM4_MFS4_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x42708484UL))
#define bFM4_MFS4_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x42708488UL))
#define bFM4_MFS4_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270848CUL))
#define bFM4_MFS4_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x42708490UL))
#define bFM4_MFS4_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x42708498UL))
#define bFM4_MFS4_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270849CUL))
#define bFM4_MFS4_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x427084A0UL))
#define bFM4_MFS4_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x427084ACUL))
#define bFM4_MFS4_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x427084B0UL))
#define bFM4_MFS4_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x427084B4UL))
#define bFM4_MFS4_CSIO_STMR_TM0                *((volatile unsigned char*)(0x42708500UL))
#define bFM4_MFS4_CSIO_STMR_TM1                *((volatile unsigned char*)(0x42708504UL))
#define bFM4_MFS4_CSIO_STMR_TM2                *((volatile unsigned char*)(0x42708508UL))
#define bFM4_MFS4_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270850CUL))
#define bFM4_MFS4_CSIO_STMR_TM4                *((volatile unsigned char*)(0x42708510UL))
#define bFM4_MFS4_CSIO_STMR_TM5                *((volatile unsigned char*)(0x42708514UL))
#define bFM4_MFS4_CSIO_STMR_TM6                *((volatile unsigned char*)(0x42708518UL))
#define bFM4_MFS4_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270851CUL))
#define bFM4_MFS4_CSIO_STMR_TM8                *((volatile unsigned char*)(0x42708520UL))
#define bFM4_MFS4_CSIO_STMR_TM9                *((volatile unsigned char*)(0x42708524UL))
#define bFM4_MFS4_CSIO_STMR_TM10               *((volatile unsigned char*)(0x42708528UL))
#define bFM4_MFS4_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270852CUL))
#define bFM4_MFS4_CSIO_STMR_TM12               *((volatile unsigned char*)(0x42708530UL))
#define bFM4_MFS4_CSIO_STMR_TM13               *((volatile unsigned char*)(0x42708534UL))
#define bFM4_MFS4_CSIO_STMR_TM14               *((volatile unsigned char*)(0x42708538UL))
#define bFM4_MFS4_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270853CUL))
#define bFM4_MFS4_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x42708580UL))
#define bFM4_MFS4_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x42708584UL))
#define bFM4_MFS4_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x42708588UL))
#define bFM4_MFS4_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270858CUL))
#define bFM4_MFS4_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x42708590UL))
#define bFM4_MFS4_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x42708594UL))
#define bFM4_MFS4_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x42708598UL))
#define bFM4_MFS4_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270859CUL))
#define bFM4_MFS4_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x427085A0UL))
#define bFM4_MFS4_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x427085A4UL))
#define bFM4_MFS4_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x427085A8UL))
#define bFM4_MFS4_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x427085ACUL))
#define bFM4_MFS4_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x427085B0UL))
#define bFM4_MFS4_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x427085B4UL))
#define bFM4_MFS4_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x427085B8UL))
#define bFM4_MFS4_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x427085BCUL))
#define bFM4_MFS4_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x42708600UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x42708604UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x42708608UL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270860CUL))
#define bFM4_MFS4_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x42708610UL))
#define bFM4_MFS4_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x42708614UL))
#define bFM4_MFS4_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x42708618UL))
#define bFM4_MFS4_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270861CUL))
#define bFM4_MFS4_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x42708620UL))
#define bFM4_MFS4_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x42708624UL))
#define bFM4_MFS4_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x42708628UL))
#define bFM4_MFS4_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270862CUL))
#define bFM4_MFS4_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x42708630UL))
#define bFM4_MFS4_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x42708634UL))
#define bFM4_MFS4_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x42708638UL))
#define bFM4_MFS4_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270863CUL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x42708680UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x42708684UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x42708688UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270868CUL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x42708690UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x42708694UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x42708698UL))
#define bFM4_MFS4_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270869CUL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x427086A0UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x427086A4UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x427086A8UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x427086ACUL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x427086B0UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x427086B4UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x427086B8UL))
#define bFM4_MFS4_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x427086BCUL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x42708700UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x42708704UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x42708708UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270870CUL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x42708710UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x42708714UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x42708718UL))
#define bFM4_MFS4_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270871CUL))

