MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* MFS LIN channel 4 registers */
#define bFM4_MFS4_LIN_SMR_SOE                  *((volatile unsigned char*)(0x42708000UL))
#define bFM4_MFS4_LIN_SMR_SBL                  *((volatile unsigned char*)(0x4270800CUL))
#define bFM4_MFS4_LIN_SMR_WUCR                 *((volatile unsigned char*)(0x42708010UL))
#define bFM4_MFS4_LIN_SMR_MD0                  *((volatile unsigned char*)(0x42708014UL))
#define bFM4_MFS4_LIN_SMR_MD1                  *((volatile unsigned char*)(0x42708018UL))
#define bFM4_MFS4_LIN_SMR_MD2                  *((volatile unsigned char*)(0x4270801CUL))
#define bFM4_MFS4_LIN_SCR_TXE                  *((volatile unsigned char*)(0x42708020UL))
#define bFM4_MFS4_LIN_SCR_RXE                  *((volatile unsigned char*)(0x42708024UL))
#define bFM4_MFS4_LIN_SCR_TBIE                 *((volatile unsigned char*)(0x42708028UL))
#define bFM4_MFS4_LIN_SCR_TIE                  *((volatile unsigned char*)(0x4270802CUL))
#define bFM4_MFS4_LIN_SCR_RIE                  *((volatile unsigned char*)(0x42708030UL))
#define bFM4_MFS4_LIN_SCR_LBR                  *((volatile unsigned char*)(0x42708034UL))
#define bFM4_MFS4_LIN_SCR_MS                   *((volatile unsigned char*)(0x42708038UL))
#define bFM4_MFS4_LIN_SCR_UPCL                 *((volatile unsigned char*)(0x4270803CUL))
#define bFM4_MFS4_LIN_ESCR_DEL0                *((volatile unsigned char*)(0x42708080UL))
#define bFM4_MFS4_LIN_ESCR_DEL1                *((volatile unsigned char*)(0x42708084UL))
#define bFM4_MFS4_LIN_ESCR_LBL0                *((volatile unsigned char*)(0x42708088UL))
#define bFM4_MFS4_LIN_ESCR_LBL1                *((volatile unsigned char*)(0x4270808CUL))
#define bFM4_MFS4_LIN_ESCR_LBIE                *((volatile unsigned char*)(0x42708090UL))
#define bFM4_MFS4_LIN_ESCR_ESBL                *((volatile unsigned char*)(0x42708098UL))
#define bFM4_MFS4_LIN_SSR_TBI                  *((volatile unsigned char*)(0x427080A0UL))
#define bFM4_MFS4_LIN_SSR_TDRE                 *((volatile unsigned char*)(0x427080A4UL))
#define bFM4_MFS4_LIN_SSR_RDRF                 *((volatile unsigned char*)(0x427080A8UL))
#define bFM4_MFS4_LIN_SSR_ORE                  *((volatile unsigned char*)(0x427080ACUL))
#define bFM4_MFS4_LIN_SSR_FRE                  *((volatile unsigned char*)(0x427080B0UL))
#define bFM4_MFS4_LIN_SSR_LBD                  *((volatile unsigned char*)(0x427080B4UL))
#define bFM4_MFS4_LIN_SSR_REC                  *((volatile unsigned char*)(0x427080BCUL))
#define bFM4_MFS4_LIN_BGR_EXT                  *((volatile unsigned char*)(0x427081BCUL))
#define bFM4_MFS4_LIN_BGR1_EXT                 *((volatile unsigned char*)(0x427081BCUL))
#define bFM4_MFS4_LIN_FCR_FE1                  *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_LIN_FCR_FE2                  *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_LIN_FCR_FCL1                 *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_LIN_FCR_FCL2                 *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_LIN_FCR_FSET                 *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_LIN_FCR_FLD                  *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_LIN_FCR_FLST                 *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_LIN_FCR_FSEL                 *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_LIN_FCR_FTIE                 *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_LIN_FCR_FDRQ                 *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_LIN_FCR_FRIIE                *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_LIN_FCR_FLSTE                *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_LIN_FCR0_FE1                 *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_LIN_FCR0_FE2                 *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_LIN_FCR0_FCL1                *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_LIN_FCR0_FCL2                *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_LIN_FCR0_FSET                *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_LIN_FCR0_FLD                 *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_LIN_FCR0_FLST                *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_LIN_FCR1_FSEL                *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_LIN_FCR1_FTIE                *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_LIN_FCR1_FDRQ                *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_LIN_FCR1_FRIIE               *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_LIN_FCR1_FLSTE               *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_LIN_FBYTE_FD0                *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_LIN_FBYTE_FD1                *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_LIN_FBYTE_FD2                *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_LIN_FBYTE_FD3                *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_LIN_FBYTE_FD4                *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_LIN_FBYTE_FD5                *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_LIN_FBYTE_FD6                *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_LIN_FBYTE_FD7                *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_LIN_FBYTE_FD8                *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_LIN_FBYTE_FD9                *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_LIN_FBYTE_FD10               *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_LIN_FBYTE_FD11               *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_LIN_FBYTE_FD12               *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_LIN_FBYTE_FD13               *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_LIN_FBYTE_FD14               *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_LIN_FBYTE_FD15               *((volatile unsigned char*)(0x4270833CUL))
#define bFM4_MFS4_LIN_FBYTE1_FD0               *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_LIN_FBYTE1_FD1               *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_LIN_FBYTE1_FD2               *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_LIN_FBYTE1_FD3               *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_LIN_FBYTE1_FD4               *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_LIN_FBYTE1_FD5               *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_LIN_FBYTE1_FD6               *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_LIN_FBYTE1_FD7               *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_LIN_FBYTE2_FD8               *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_LIN_FBYTE2_FD9               *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_LIN_FBYTE2_FD10              *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_LIN_FBYTE2_FD11              *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_LIN_FBYTE2_FD12              *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_LIN_FBYTE2_FD13              *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_LIN_FBYTE2_FD14              *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_LIN_FBYTE2_FD15              *((volatile unsigned char*)(0x4270833CUL))

