MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* MFS UART channel 8 registers */

/* MFS CSIO channel 8 registers */

/* MFS LIN channel 8 registers */

/* MFS I2C channel 8 registers */

/* MFS UART channel 9 registers */

/* MFS CSIO channel 9 registers */

/* MFS LIN channel 9 registers */

/* MFS I2C channel 9 registers */

/* MFS UART channel 10 registers */

/* MFS CSIO channel 10 registers */

/* MFS LIN channel 10 registers */

/* MFS I2C channel 10 registers */

/* MFS UART channel 11 registers */

/* MFS CSIO channel 11 registers */

/* MFS LIN channel 11 registers */

/* MFS I2C channel 11 registers */

/* MFS UART channel 12 registers */

/* MFS CSIO channel 12 registers */

/* MFS LIN channel 12 registers */

/* MFS I2C channel 12 registers */

/* MFS UART channel 13 registers */

/* MFS CSIO channel 13 registers */

/* MFS LIN channel 13 registers */

/* MFS I2C channel 13 registers */

/* MFS UART channel 14 registers */

/* MFS CSIO channel 14 registers */

/* MFS LIN channel 14 registers */

/* MFS I2C channel 14 registers */

/* MFS UART channel 15 registers */

/* MFS CSIO channel 15 registers */

/* MFS LIN channel 15 registers */

/* MFS I2C channel 15 registers */

/* CRC registers */
#define bFM4_CRC_CRCCR_INIT                    *((volatile unsigned char*)(0x42720000UL))
#define bFM4_CRC_CRCCR_CRC32                   *((volatile unsigned char*)(0x42720004UL))
#define bFM4_CRC_CRCCR_LTLEND                  *((volatile unsigned char*)(0x42720008UL))
#define bFM4_CRC_CRCCR_LSBFST                  *((volatile unsigned char*)(0x4272000CUL))
#define bFM4_CRC_CRCCR_CRCLTE                  *((volatile unsigned char*)(0x42720010UL))
#define bFM4_CRC_CRCCR_CRCLSF                  *((volatile unsigned char*)(0x42720014UL))
#define bFM4_CRC_CRCCR_FXOR                    *((volatile unsigned char*)(0x42720018UL))

/* Watch counter registers */
#define bFM4_WC_WCRD_CTR0                      *((volatile unsigned char*)(0x42740000UL))
#define bFM4_WC_WCRD_CTR1                      *((volatile unsigned char*)(0x42740004UL))
#define bFM4_WC_WCRD_CTR2                      *((volatile unsigned char*)(0x42740008UL))
#define bFM4_WC_WCRD_CTR3                      *((volatile unsigned char*)(0x4274000CUL))
#define bFM4_WC_WCRD_CTR4                      *((volatile unsigned char*)(0x42740010UL))
#define bFM4_WC_WCRD_CTR5                      *((volatile unsigned char*)(0x42740014UL))
#define bFM4_WC_WCRL_RLC0                      *((volatile unsigned char*)(0x42740020UL))
#define bFM4_WC_WCRL_RLC1                      *((volatile unsigned char*)(0x42740024UL))
#define bFM4_WC_WCRL_RLC2                      *((volatile unsigned char*)(0x42740028UL))
#define bFM4_WC_WCRL_RLC3                      *((volatile unsigned char*)(0x4274002CUL))
#define bFM4_WC_WCRL_RLC4                      *((volatile unsigned char*)(0x42740030UL))
#define bFM4_WC_WCRL_RLC5                      *((volatile unsigned char*)(0x42740034UL))
#define bFM4_WC_WCCR_WCIF                      *((volatile unsigned char*)(0x42740040UL))
#define bFM4_WC_WCCR_WCIE                      *((volatile unsigned char*)(0x42740044UL))
#define bFM4_WC_WCCR_CS0                       *((volatile unsigned char*)(0x42740048UL))
#define bFM4_WC_WCCR_CS1                       *((volatile unsigned char*)(0x4274004CUL))
#define bFM4_WC_WCCR_WCOP                      *((volatile unsigned char*)(0x42740058UL))
#define bFM4_WC_WCCR_WCEN                      *((volatile unsigned char*)(0x4274005CUL))
#define bFM4_WC_CLK_SEL_SEL_IN                 *((volatile unsigned char*)(0x42740200UL))
#define bFM4_WC_CLK_SEL_SEL_OUT                *((volatile unsigned char*)(0x42740220UL))
#define bFM4_WC_CLK_EN_CLK_EN                  *((volatile unsigned char*)(0x42740280UL))
#define bFM4_WC_CLK_EN_CLK_EN_R                *((volatile unsigned char*)(0x42740284UL))

/* Real time clock registers */
#define bFM4_RTC_WTCR10_ST                                            *((volatile unsigned char*)(0x42762000UL))
#define bFM4_RTC_WTCR10_RUN                                           *((volatile unsigned char*)(0x42762008UL))
#define bFM4_RTC_WTCR10_SRST                                          *((volatile unsigned char*)(0x4276200CUL))
#define bFM4_RTC_WTCR10_SCST                                          *((volatile unsigned char*)(0x42762010UL))
#define bFM4_RTC_WTCR10_SCRST                                         *((volatile unsigned char*)(0x42762014UL))
#define bFM4_RTC_WTCR10_BUSY                                          *((volatile unsigned char*)(0x42762018UL))
#define bFM4_RTC_WTCR10_TRANS                                         *((volatile unsigned char*)(0x4276201CUL))
#define bFM4_RTC_WTCR11_MIEN                                          *((volatile unsigned char*)(0x42762080UL))
#define bFM4_RTC_WTCR11_HEN                                           *((volatile unsigned char*)(0x42762084UL))
#define bFM4_RTC_WTCR11_DEN                                           *((volatile unsigned char*)(0x42762088UL))
#define bFM4_RTC_WTCR11_MOEN                                          *((volatile unsigned char*)(0x4276208CUL))
#define bFM4_RTC_WTCR11_YEN                                           *((volatile unsigned char*)(0x42762090UL))
#define bFM4_RTC_WTCR12_INTSSI                                        *((volatile unsigned char*)(0x42762100UL))
#define bFM4_RTC_WTCR12_INTSI                                         *((volatile unsigned char*)(0x42762104UL))
#define bFM4_RTC_WTCR12_INTMI                                         *((volatile unsigned char*)(0x42762108UL))
#define bFM4_RTC_WTCR12_INTHI                                         *((volatile unsigned char*)(0x4276210CUL))
#define bFM4_RTC_WTCR12_INTTMI                                        *((volatile unsigned char*)(0x42762110UL))
#define bFM4_RTC_WTCR12_INTALI                                        *((volatile unsigned char*)(0x42762114UL))
#define bFM4_RTC_WTCR12_INTERI                                        *((volatile unsigned char*)(0x42762118UL))
#define bFM4_RTC_WTCR12_INTCRI                                        *((volatile unsigned char*)(0x4276211CUL))
#define bFM4_RTC_WTCR13_INTSSIE                                       *((volatile unsigned char*)(0x42762180UL))
#define bFM4_RTC_WTCR13_INTSIE                                        *((volatile unsigned char*)(0x42762184UL))
#define bFM4_RTC_WTCR13_INTMIE                                        *((volatile unsigned char*)(0x42762188UL))
#define bFM4_RTC_WTCR13_INTHIE                                        *((volatile unsigned char*)(0x4276218CUL))
#define bFM4_RTC_WTCR13_INTTMIE                                       *((volatile unsigned char*)(0x42762190UL))
#define bFM4_RTC_WTCR13_INTALIE                                       *((volatile unsigned char*)(0x42762194UL))
#define bFM4_RTC_WTCR13_INTERIE                                       *((volatile unsigned char*)(0x42762198UL))
#define bFM4_RTC_WTCR13_INTCRIE                                       *((volatile unsigned char*)(0x4276219CUL))
#define bFM4_RTC_WTCR20_CREAD                                         *((volatile unsigned char*)(0x42762200UL))
#define bFM4_RTC_WTCR20_CWRITE                                        *((volatile unsigned char*)(0x42762204UL))
#define bFM4_RTC_WTCR20_BREAD                                         *((volatile unsigned char*)(0x42762208UL))
#define bFM4_RTC_WTCR20_BWRITE                                        *((volatile unsigned char*)(0x4276220CUL))
#define bFM4_RTC_WTCR20_PREAD                                         *((volatile unsigned char*)(0x42762210UL))
#define bFM4_RTC_WTCR20_PWRITE                                        *((volatile unsigned char*)(0x42762214UL))
#define bFM4_RTC_WTCR21_TMST                                          *((volatile unsigned char*)(0x42762280UL))
#define bFM4_RTC_WTCR21_TMEN                                          *((volatile unsigned char*)(0x42762284UL))
#define bFM4_RTC_WTCR21_TMRUN                                         *((volatile unsigned char*)(0x42762288UL))
#define bFM4_RTC_WTSR_S0                                              *((volatile unsigned char*)(0x42762380UL))
#define bFM4_RTC_WTSR_S1                                              *((volatile unsigned char*)(0x42762384UL))
#define bFM4_RTC_WTSR_S2                                              *((volatile unsigned char*)(0x42762388UL))
#define bFM4_RTC_WTSR_S3                                              *((volatile unsigned char*)(0x4276238CUL))
#define bFM4_RTC_WTSR_TS0                                             *((volatile unsigned char*)(0x42762390UL))
#define bFM4_RTC_WTSR_TS1                                             *((volatile unsigned char*)(0x42762394UL))
#define bFM4_RTC_WTSR_TS2                                             *((volatile unsigned char*)(0x42762398UL))
#define bFM4_RTC_WTMIR_MI0                                            *((volatile unsigned char*)(0x42762400UL))
#define bFM4_RTC_WTMIR_MI1                                            *((volatile unsigned char*)(0x42762404UL))
#define bFM4_RTC_WTMIR_MI2                                            *((volatile unsigned char*)(0x42762408UL))
#define bFM4_RTC_WTMIR_MI3                                            *((volatile unsigned char*)(0x4276240CUL))
#define bFM4_RTC_WTMIR_TMI0                                           *((volatile unsigned char*)(0x42762410UL))
#define bFM4_RTC_WTMIR_TMI1                                           *((volatile unsigned char*)(0x42762414UL))
#define bFM4_RTC_WTMIR_TMI2                                           *((volatile unsigned char*)(0x42762418UL))
#define bFM4_RTC_WTHR_H0                                              *((volatile unsigned char*)(0x42762480UL))
#define bFM4_RTC_WTHR_H1                                              *((volatile unsigned char*)(0x42762484UL))
#define bFM4_RTC_WTHR_H2                                              *((volatile unsigned char*)(0x42762488UL))
#define bFM4_RTC_WTHR_H3                                              *((volatile unsigned char*)(0x4276248CUL))
#define bFM4_RTC_WTHR_TH0                                             *((volatile unsigned char*)(0x42762490UL))
#define bFM4_RTC_WTHR_TH1                                             *((volatile unsigned char*)(0x42762494UL))
#define bFM4_RTC_WTDR_D0                                              *((volatile unsigned char*)(0x42762500UL))
#define bFM4_RTC_WTDR_D1                                              *((volatile unsigned char*)(0x42762504UL))
#define bFM4_RTC_WTDR_D2                                              *((volatile unsigned char*)(0x42762508UL))
#define bFM4_RTC_WTDR_D3                                              *((volatile unsigned char*)(0x4276250CUL))
#define bFM4_RTC_WTDR_TD0                                             *((volatile unsigned char*)(0x42762510UL))
#define bFM4_RTC_WTDR_TD1                                             *((volatile unsigned char*)(0x42762514UL))
#define bFM4_RTC_WTDW_DW0                                             *((volatile unsigned char*)(0x42762580UL))
#define bFM4_RTC_WTDW_DW1                                             *((volatile unsigned char*)(0x42762584UL))
#define bFM4_RTC_WTDW_DW2                                             *((volatile unsigned char*)(0x42762588UL))
#define bFM4_RTC_WTMOR_MO0                                            *((volatile unsigned char*)(0x42762600UL))
#define bFM4_RTC_WTMOR_MO1                                            *((volatile unsigned char*)(0x42762604UL))
#define bFM4_RTC_WTMOR_MO2                                            *((volatile unsigned char*)(0x42762608UL))
#define bFM4_RTC_WTMOR_MO3                                            *((volatile unsigned char*)(0x4276260CUL))
#define bFM4_RTC_WTMOR_TMO                                            *((volatile unsigned char*)(0x42762610UL))
#define bFM4_RTC_WTYR_Y0                                              *((volatile unsigned char*)(0x42762680UL))
#define bFM4_RTC_WTYR_Y1                                              *((volatile unsigned char*)(0x42762684UL))
#define bFM4_RTC_WTYR_Y2                                              *((volatile unsigned char*)(0x42762688UL))
#define bFM4_RTC_WTYR_Y3                                              *((volatile unsigned char*)(0x4276268CUL))
#define bFM4_RTC_WTYR_TY0                                             *((volatile unsigned char*)(0x42762690UL))
#define bFM4_RTC_WTYR_TY1                                             *((volatile unsigned char*)(0x42762694UL))
#define bFM4_RTC_WTYR_TY2                                             *((volatile unsigned char*)(0x42762698UL))
#define bFM4_RTC_WTYR_TY3                                             *((volatile unsigned char*)(0x4276269CUL))
#define bFM4_RTC_ALMIR_AMI0                                           *((volatile unsigned char*)(0x42762700UL))
#define bFM4_RTC_ALMIR_AMI1                                           *((volatile unsigned char*)(0x42762704UL))
#define bFM4_RTC_ALMIR_AMI2                                           *((volatile unsigned char*)(0x42762708UL))
#define bFM4_RTC_ALMIR_AMI3                                           *((volatile unsigned char*)(0x4276270CUL))
#define bFM4_RTC_ALMIR_TAMI0                                          *((volatile unsigned char*)(0x42762710UL))
#define bFM4_RTC_ALMIR_TAMI1                                          *((volatile unsigned char*)(0x42762714UL))
#define bFM4_RTC_ALMIR_TAMI2                                          *((volatile unsigned char*)(0x42762718UL))
#define bFM4_RTC_ALHR_AH0                                             *((volatile unsigned char*)(0x42762780UL))
#define bFM4_RTC_ALHR_AH1                                             *((volatile unsigned char*)(0x42762784UL))
#define bFM4_RTC_ALHR_AH2                                             *((volatile unsigned char*)(0x42762788UL))
#define bFM4_RTC_ALHR_AH3                                             *((volatile unsigned char*)(0x4276278CUL))
#define bFM4_RTC_ALHR_TAH0                                            *((volatile unsigned char*)(0x42762790UL))
#define bFM4_RTC_ALHR_TAH1                                            *((volatile unsigned char*)(0x42762794UL))
#define bFM4_RTC_ALDR_AD0                                             *((volatile unsigned char*)(0x42762800UL))
#define bFM4_RTC_ALDR_AD1                                             *((volatile unsigned char*)(0x42762804UL))
#define bFM4_RTC_ALDR_AD2                                             *((volatile unsigned char*)(0x42762808UL))
#define bFM4_RTC_ALDR_AD3                                             *((volatile unsigned char*)(0x4276280CUL))
#define bFM4_RTC_ALDR_TAD0                                            *((volatile unsigned char*)(0x42762810UL))
#define bFM4_RTC_ALDR_TAD1                                            *((volatile unsigned char*)(0x42762814UL))
#define bFM4_RTC_ALMOR_AMO0                                           *((volatile unsigned char*)(0x42762880UL))
#define bFM4_RTC_ALMOR_AMO1                                           *((volatile unsigned char*)(0x42762884UL))
#define bFM4_RTC_ALMOR_AMO2                                           *((volatile unsigned char*)(0x42762888UL))
#define bFM4_RTC_ALMOR_AMO3                                           *((volatile unsigned char*)(0x4276288CUL))
#define bFM4_RTC_ALMOR_TAMO                                           *((volatile unsigned char*)(0x42762890UL))
#define bFM4_RTC_ALYR_AY0                                             *((volatile unsigned char*)(0x42762900UL))
#define bFM4_RTC_ALYR_AY1                                             *((volatile unsigned char*)(0x42762904UL))
#define bFM4_RTC_ALYR_AY2                                             *((volatile unsigned char*)(0x42762908UL))
#define bFM4_RTC_ALYR_AY3                                             *((volatile unsigned char*)(0x4276290CUL))
#define bFM4_RTC_ALYR_TAY0                                            *((volatile unsigned char*)(0x42762910UL))
#define bFM4_RTC_ALYR_TAY1                                            *((volatile unsigned char*)(0x42762914UL))
#define bFM4_RTC_ALYR_TAY2                                            *((volatile unsigned char*)(0x42762918UL))
#define bFM4_RTC_ALYR_TAY3                                            *((volatile unsigned char*)(0x4276291CUL))
#define bFM4_RTC_WTTR0_TM0                                            *((volatile unsigned char*)(0x42762980UL))
#define bFM4_RTC_WTTR0_TM1                                            *((volatile unsigned char*)(0x42762984UL))
#define bFM4_RTC_WTTR0_TM2                                            *((volatile unsigned char*)(0x42762988UL))
#define bFM4_RTC_WTTR0_TM3                                            *((volatile unsigned char*)(0x4276298CUL))
#define bFM4_RTC_WTTR0_TM4                                            *((volatile unsigned char*)(0x42762990UL))
#define bFM4_RTC_WTTR0_TM5                                            *((volatile unsigned char*)(0x42762994UL))
#define bFM4_RTC_WTTR0_TM6                                            *((volatile unsigned char*)(0x42762998UL))
#define bFM4_RTC_WTTR0_TM7                                            *((volatile unsigned char*)(0x4276299CUL))
#define bFM4_RTC_WTTR1_TM8                                            *((volatile unsigned char*)(0x42762A00UL))
#define bFM4_RTC_WTTR1_TM9                                            *((volatile unsigned char*)(0x42762A04UL))
#define bFM4_RTC_WTTR1_TM10                                           *((volatile unsigned char*)(0x42762A08UL))
#define bFM4_RTC_WTTR1_TM11                                           *((volatile unsigned char*)(0x42762A0CUL))
#define bFM4_RTC_WTTR1_TM12                                           *((volatile unsigned char*)(0x42762A10UL))
#define bFM4_RTC_WTTR1_TM13                                           *((volatile unsigned char*)(0x42762A14UL))
#define bFM4_RTC_WTTR1_TM14                                           *((volatile unsigned char*)(0x42762A18UL))
#define bFM4_RTC_WTTR1_TM15                                           *((volatile unsigned char*)(0x42762A1CUL))
#define bFM4_RTC_WTTR2_TM16                                           *((volatile unsigned char*)(0x42762A80UL))
#define bFM4_RTC_WTTR2_TM17                                           *((volatile unsigned char*)(0x42762A84UL))
#define bFM4_RTC_WTCAL0_WTCAL00                                       *((volatile unsigned char*)(0x42762B00UL))
#define bFM4_RTC_WTCAL0_WTCAL01                                       *((volatile unsigned char*)(0x42762B04UL))
#define bFM4_RTC_WTCAL0_WTCAL02                                       *((volatile unsigned char*)(0x42762B08UL))
#define bFM4_RTC_WTCAL0_WTCAL03                                       *((volatile unsigned char*)(0x42762B0CUL))
#define bFM4_RTC_WTCAL0_WTCAL04                                       *((volatile unsigned char*)(0x42762B10UL))
#define bFM4_RTC_WTCAL0_WTCAL05                                       *((volatile unsigned char*)(0x42762B14UL))
#define bFM4_RTC_WTCAL0_WTCAL06                                       *((volatile unsigned char*)(0x42762B18UL))
#define bFM4_RTC_WTCAL0_WTCAL07                                       *((volatile unsigned char*)(0x42762B1CUL))
#define bFM4_RTC_WTCAL1_WTCAL10                                       *((volatile unsigned char*)(0x42762B80UL))
#define bFM4_RTC_WTCAL1_WTCAL11                                       *((volatile unsigned char*)(0x42762B84UL))
#define bFM4_RTC_WTCALEN_WTCALEN                                      *((volatile unsigned char*)(0x42762C00UL))
#define bFM4_RTC_WTDIV_WTDIV0                                         *((volatile unsigned char*)(0x42762C80UL))
#define bFM4_RTC_WTDIV_WTDIV1                                         *((volatile unsigned char*)(0x42762C84UL))
#define bFM4_RTC_WTDIV_WTDIV2                                         *((volatile unsigned char*)(0x42762C88UL))
#define bFM4_RTC_WTDIV_WTDIV3                                         *((volatile unsigned char*)(0x42762C8CUL))
#define bFM4_RTC_WTDIVEN_WTDIVEN                                      *((volatile unsigned char*)(0x42762D00UL))
#define bFM4_RTC_WTDIVEN_WTDIVRDY                                     *((volatile unsigned char*)(0x42762D04UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD0                                   *((volatile unsigned char*)(0x42762D80UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD1                                   *((volatile unsigned char*)(0x42762D84UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD2                                   *((volatile unsigned char*)(0x42762D88UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD3                                   *((volatile unsigned char*)(0x42762D8CUL))
#define bFM4_RTC_WTCALPRD_WTCALPRD4                                   *((volatile unsigned char*)(0x42762D90UL))
#define bFM4_RTC_WTCALPRD_WTCALPRD5                                   *((volatile unsigned char*)(0x42762D94UL))
#define bFM4_RTC_WTCOSEL_WTCOSEL                                      *((volatile unsigned char*)(0x42762E00UL))
#define bFM4_RTC_VB_CLKDIV_DIV0                                       *((volatile unsigned char*)(0x42762E80UL))
#define bFM4_RTC_VB_CLKDIV_DIV1                                       *((volatile unsigned char*)(0x42762E84UL))
#define bFM4_RTC_VB_CLKDIV_DIV2                                       *((volatile unsigned char*)(0x42762E88UL))
#define bFM4_RTC_VB_CLKDIV_DIV3                                       *((volatile unsigned char*)(0x42762E8CUL))
#define bFM4_RTC_VB_CLKDIV_DIV4                                       *((volatile unsigned char*)(0x42762E90UL))
#define bFM4_RTC_VB_CLKDIV_DIV5                                       *((volatile unsigned char*)(0x42762E94UL))
#define bFM4_RTC_VB_CLKDIV_DIV6                                       *((volatile unsigned char*)(0x42762E98UL))
#define bFM4_RTC_VB_CLKDIV_DIV7                                       *((volatile unsigned char*)(0x42762E9CUL))
#define bFM4_RTC_WTOSCCNT_SOSCEX                                      *((volatile unsigned char*)(0x42762F00UL))
#define bFM4_RTC_WTOSCCNT_SOSCNTL                                     *((volatile unsigned char*)(0x42762F04UL))
#define bFM4_RTC_CCS_CCS0                                             *((volatile unsigned char*)(0x42762F80UL))
#define bFM4_RTC_CCS_CCS1                                             *((volatile unsigned char*)(0x42762F84UL))
#define bFM4_RTC_CCS_CCS2                                             *((volatile unsigned char*)(0x42762F88UL))
#define bFM4_RTC_CCS_CCS3                                             *((volatile unsigned char*)(0x42762F8CUL))
#define bFM4_RTC_CCS_CCS4                                             *((volatile unsigned char*)(0x42762F90UL))
#define bFM4_RTC_CCS_CCS5                                             *((volatile unsigned char*)(0x42762F94UL))
#define bFM4_RTC_CCS_CCS6                                             *((volatile unsigned char*)(0x42762F98UL))
#define bFM4_RTC_CCS_CCS7                                             *((volatile unsigned char*)(0x42762F9CUL))
#define bFM4_RTC_CCB_CCB0                                             *((volatile unsigned char*)(0x42763000UL))
#define bFM4_RTC_CCB_CCB1                                             *((volatile unsigned char*)(0x42763004UL))
#define bFM4_RTC_CCB_CCB2                                             *((volatile unsigned char*)(0x42763008UL))
#define bFM4_RTC_CCB_CCB3                                             *((volatile unsigned char*)(0x4276300CUL))
#define bFM4_RTC_CCB_CCB4                                             *((volatile unsigned char*)(0x42763010UL))
#define bFM4_RTC_CCB_CCB5                                             *((volatile unsigned char*)(0x42763014UL))
#define bFM4_RTC_CCB_CCB6                                             *((volatile unsigned char*)(0x42763018UL))
