MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_RTC_CCB_CCB7                                             *((volatile unsigned char*)(0x4276301CUL))
#define bFM4_RTC_BOOST_BOOST0                                         *((volatile unsigned char*)(0x42763100UL))
#define bFM4_RTC_BOOST_BOOST1                                         *((volatile unsigned char*)(0x42763104UL))
#define bFM4_RTC_EWKUP_WUP0                                           *((volatile unsigned char*)(0x42763180UL))
#define bFM4_RTC_VDET_PON                                             *((volatile unsigned char*)(0x4276321CUL))
#define bFM4_RTC_HIBRST_HIBRST                                        *((volatile unsigned char*)(0x42763300UL))
#define bFM4_RTC_VBPFR_VPFR0                                          *((volatile unsigned char*)(0x42763380UL))
#define bFM4_RTC_VBPFR_VPFR1                                          *((volatile unsigned char*)(0x42763384UL))
#define bFM4_RTC_VBPFR_VPFR2                                          *((volatile unsigned char*)(0x42763388UL))
#define bFM4_RTC_VBPFR_VPFR3                                          *((volatile unsigned char*)(0x4276338CUL))
#define bFM4_RTC_VBPFR_SPSR0                                          *((volatile unsigned char*)(0x42763390UL))
#define bFM4_RTC_VBPFR_SPSR1                                          *((volatile unsigned char*)(0x42763394UL))
#define bFM4_RTC_VBPCR_VPCR0                                          *((volatile unsigned char*)(0x42763400UL))
#define bFM4_RTC_VBPCR_VPCR1                                          *((volatile unsigned char*)(0x42763404UL))
#define bFM4_RTC_VBPCR_VPCR2                                          *((volatile unsigned char*)(0x42763408UL))
#define bFM4_RTC_VBPCR_VPCR3                                          *((volatile unsigned char*)(0x4276340CUL))
#define bFM4_RTC_VBDDR_VDDR0                                          *((volatile unsigned char*)(0x42763480UL))
#define bFM4_RTC_VBDDR_VDDR1                                          *((volatile unsigned char*)(0x42763484UL))
#define bFM4_RTC_VBDDR_VDDR2                                          *((volatile unsigned char*)(0x42763488UL))
#define bFM4_RTC_VBDDR_VDDR3                                          *((volatile unsigned char*)(0x4276348CUL))
#define bFM4_RTC_VBDIR_VDIR0                                          *((volatile unsigned char*)(0x42763500UL))
#define bFM4_RTC_VBDIR_VDIR1                                          *((volatile unsigned char*)(0x42763504UL))
#define bFM4_RTC_VBDIR_VDIR2                                          *((volatile unsigned char*)(0x42763508UL))
#define bFM4_RTC_VBDIR_VDIR3                                          *((volatile unsigned char*)(0x4276350CUL))
#define bFM4_RTC_VBDOR_VDOR0                                          *((volatile unsigned char*)(0x42763580UL))
#define bFM4_RTC_VBDOR_VDOR1                                          *((volatile unsigned char*)(0x42763584UL))
#define bFM4_RTC_VBDOR_VDOR2                                          *((volatile unsigned char*)(0x42763588UL))
#define bFM4_RTC_VBDOR_VDOR3                                          *((volatile unsigned char*)(0x4276358CUL))
#define bFM4_RTC_VBPZR_VPZR0                                          *((volatile unsigned char*)(0x42763600UL))
#define bFM4_RTC_VBPZR_VPZR1                                          *((volatile unsigned char*)(0x42763604UL))

/* Low-speed CR prescaler registers */
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD0          *((volatile unsigned char*)(0x42780000UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD1          *((volatile unsigned char*)(0x42780004UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD2          *((volatile unsigned char*)(0x42780008UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD3          *((volatile unsigned char*)(0x4278000CUL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD4          *((volatile unsigned char*)(0x42780010UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD5          *((volatile unsigned char*)(0x42780014UL))

/* Peripheral Clock Gating registers */
#define bFM4_CLK_GATING_CKEN0_MFSCK0           *((volatile unsigned char*)(0x42782000UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK1           *((volatile unsigned char*)(0x42782004UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK2           *((volatile unsigned char*)(0x42782008UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK3           *((volatile unsigned char*)(0x4278200CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK4           *((volatile unsigned char*)(0x42782010UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK5           *((volatile unsigned char*)(0x42782014UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK6           *((volatile unsigned char*)(0x42782018UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK7           *((volatile unsigned char*)(0x4278201CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK8           *((volatile unsigned char*)(0x42782020UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK9           *((volatile unsigned char*)(0x42782024UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK10          *((volatile unsigned char*)(0x42782028UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK11          *((volatile unsigned char*)(0x4278202CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK12          *((volatile unsigned char*)(0x42782030UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK13          *((volatile unsigned char*)(0x42782034UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK14          *((volatile unsigned char*)(0x42782038UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK15          *((volatile unsigned char*)(0x4278203CUL))
#define bFM4_CLK_GATING_CKEN0_ADCCK0           *((volatile unsigned char*)(0x42782040UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK1           *((volatile unsigned char*)(0x42782044UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK2           *((volatile unsigned char*)(0x42782048UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK3           *((volatile unsigned char*)(0x4278204CUL))
#define bFM4_CLK_GATING_CKEN0_DMACK            *((volatile unsigned char*)(0x42782060UL))
#define bFM4_CLK_GATING_CKEN0_EXBCK            *((volatile unsigned char*)(0x42782068UL))
#define bFM4_CLK_GATING_CKEN0_GIOCK            *((volatile unsigned char*)(0x42782070UL))
#define bFM4_CLK_GATING_MRST0_MFSRST0          *((volatile unsigned char*)(0x42782080UL))
#define bFM4_CLK_GATING_MRST0_MFSRST1          *((volatile unsigned char*)(0x42782084UL))
#define bFM4_CLK_GATING_MRST0_MFSRST2          *((volatile unsigned char*)(0x42782088UL))
#define bFM4_CLK_GATING_MRST0_MFSRST3          *((volatile unsigned char*)(0x4278208CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST4          *((volatile unsigned char*)(0x42782090UL))
#define bFM4_CLK_GATING_MRST0_MFSRST5          *((volatile unsigned char*)(0x42782094UL))
#define bFM4_CLK_GATING_MRST0_MFSRST6          *((volatile unsigned char*)(0x42782098UL))
#define bFM4_CLK_GATING_MRST0_MFSRST7          *((volatile unsigned char*)(0x4278209CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST8          *((volatile unsigned char*)(0x427820A0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST9          *((volatile unsigned char*)(0x427820A4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST10         *((volatile unsigned char*)(0x427820A8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST11         *((volatile unsigned char*)(0x427820ACUL))
#define bFM4_CLK_GATING_MRST0_MFSRST12         *((volatile unsigned char*)(0x427820B0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST13         *((volatile unsigned char*)(0x427820B4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST14         *((volatile unsigned char*)(0x427820B8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST15         *((volatile unsigned char*)(0x427820BCUL))
#define bFM4_CLK_GATING_MRST0_ADCRST0          *((volatile unsigned char*)(0x427820C0UL))
#define bFM4_CLK_GATING_MRST0_ADCRST1          *((volatile unsigned char*)(0x427820C4UL))
#define bFM4_CLK_GATING_MRST0_ADCRST2          *((volatile unsigned char*)(0x427820C8UL))
#define bFM4_CLK_GATING_MRST0_ADCRST3          *((volatile unsigned char*)(0x427820CCUL))
#define bFM4_CLK_GATING_MRST0_DMARST           *((volatile unsigned char*)(0x427820E0UL))
#define bFM4_CLK_GATING_MRST0_EXBRST           *((volatile unsigned char*)(0x427820E8UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK0           *((volatile unsigned char*)(0x42782200UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK1           *((volatile unsigned char*)(0x42782204UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK2           *((volatile unsigned char*)(0x42782208UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK3           *((volatile unsigned char*)(0x4278220CUL))
#define bFM4_CLK_GATING_CKEN1_MFTCK0           *((volatile unsigned char*)(0x42782220UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK1           *((volatile unsigned char*)(0x42782224UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK2           *((volatile unsigned char*)(0x42782228UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK3           *((volatile unsigned char*)(0x4278222CUL))
#define bFM4_CLK_GATING_CKEN1_QDUCK0           *((volatile unsigned char*)(0x42782240UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK1           *((volatile unsigned char*)(0x42782244UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK2           *((volatile unsigned char*)(0x42782248UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK3           *((volatile unsigned char*)(0x4278224CUL))
#define bFM4_CLK_GATING_MRST1_BTMRST0          *((volatile unsigned char*)(0x42782280UL))
#define bFM4_CLK_GATING_MRST1_BTMRST1          *((volatile unsigned char*)(0x42782284UL))
#define bFM4_CLK_GATING_MRST1_BTMRST2          *((volatile unsigned char*)(0x42782288UL))
#define bFM4_CLK_GATING_MRST1_BTMRST3          *((volatile unsigned char*)(0x4278228CUL))
#define bFM4_CLK_GATING_MRST1_MFTRST0          *((volatile unsigned char*)(0x427822A0UL))
#define bFM4_CLK_GATING_MRST1_MFTRST1          *((volatile unsigned char*)(0x427822A4UL))
#define bFM4_CLK_GATING_MRST1_MFTRST2          *((volatile unsigned char*)(0x427822A8UL))
#define bFM4_CLK_GATING_MRST1_MFTRST3          *((volatile unsigned char*)(0x427822ACUL))
#define bFM4_CLK_GATING_MRST1_QDURST0          *((volatile unsigned char*)(0x427822C0UL))
#define bFM4_CLK_GATING_MRST1_QDURST1          *((volatile unsigned char*)(0x427822C4UL))
#define bFM4_CLK_GATING_MRST1_QDURST2          *((volatile unsigned char*)(0x427822C8UL))
#define bFM4_CLK_GATING_MRST1_QDURST3          *((volatile unsigned char*)(0x427822CCUL))
#define bFM4_CLK_GATING_CKEN2_USBCK0           *((volatile unsigned char*)(0x42782400UL))
#define bFM4_CLK_GATING_CKEN2_USBCK1           *((volatile unsigned char*)(0x42782404UL))
#define bFM4_CLK_GATING_CKEN2_CANCK0           *((volatile unsigned char*)(0x42782410UL))
#define bFM4_CLK_GATING_CKEN2_CANCK1           *((volatile unsigned char*)(0x42782414UL))
#define bFM4_CLK_GATING_CKEN2_CANCK2           *((volatile unsigned char*)(0x42782418UL))
#define bFM4_CLK_GATING_CKEN2_SDCCK            *((volatile unsigned char*)(0x42782420UL))
#define bFM4_CLK_GATING_CKEN2_I2SCK0           *((volatile unsigned char*)(0x42782440UL))
#define bFM4_CLK_GATING_CKEN2_I2SCK1           *((volatile unsigned char*)(0x42782444UL))
#define bFM4_CLK_GATING_CKEN2_PCRCCK           *((volatile unsigned char*)(0x42782450UL))
#define bFM4_CLK_GATING_CKEN2_CECCK0           *((volatile unsigned char*)(0x42782460UL))
#define bFM4_CLK_GATING_CKEN2_CECCK1           *((volatile unsigned char*)(0x42782464UL))
#define bFM4_CLK_GATING_CKEN2_QSPICK           *((volatile unsigned char*)(0x42782470UL))
#define bFM4_CLK_GATING_MRST2_USBRST0          *((volatile unsigned char*)(0x42782480UL))
#define bFM4_CLK_GATING_MRST2_USBRST1          *((volatile unsigned char*)(0x42782484UL))
#define bFM4_CLK_GATING_MRST2_CANRST0          *((volatile unsigned char*)(0x42782490UL))
#define bFM4_CLK_GATING_MRST2_CANRST1          *((volatile unsigned char*)(0x42782494UL))
#define bFM4_CLK_GATING_MRST2_CANRST2          *((volatile unsigned char*)(0x42782498UL))
#define bFM4_CLK_GATING_MRST2_SDCRST           *((volatile unsigned char*)(0x427824A0UL))
#define bFM4_CLK_GATING_MRST2_I2SRST0          *((volatile unsigned char*)(0x427824C0UL))
#define bFM4_CLK_GATING_MRST2_I2SRST1          *((volatile unsigned char*)(0x427824C4UL))
#define bFM4_CLK_GATING_MRST2_PCRCRST          *((volatile unsigned char*)(0x427824D0UL))
#define bFM4_CLK_GATING_MRST2_CECRST0          *((volatile unsigned char*)(0x427824E0UL))
#define bFM4_CLK_GATING_MRST2_CECRST1          *((volatile unsigned char*)(0x427824E4UL))
#define bFM4_CLK_GATING_MRST2_QSPIRST          *((volatile unsigned char*)(0x427824F0UL))

/* I2S Pre-scalor registers */
#define bFM4_I2SPRE_ICCR_I2SEN                                        *((volatile unsigned char*)(0x427A0000UL))
#define bFM4_I2SPRE_ICCR_ICSEL                                        *((volatile unsigned char*)(0x427A0004UL))
#define bFM4_I2SPRE_IPCR1_IPLLEN                                      *((volatile unsigned char*)(0x427A0080UL))
#define bFM4_I2SPRE_IPCR2_IPOWT0                                      *((volatile unsigned char*)(0x427A0100UL))
#define bFM4_I2SPRE_IPCR2_IPOWT1                                      *((volatile unsigned char*)(0x427A0104UL))
#define bFM4_I2SPRE_IPCR2_IPOWT2                                      *((volatile unsigned char*)(0x427A0108UL))
#define bFM4_I2SPRE_IPCR3_IPLLK0                                      *((volatile unsigned char*)(0x427A0180UL))
#define bFM4_I2SPRE_IPCR3_IPLLK1                                      *((volatile unsigned char*)(0x427A0184UL))
#define bFM4_I2SPRE_IPCR3_IPLLK2                                      *((volatile unsigned char*)(0x427A0188UL))
#define bFM4_I2SPRE_IPCR3_IPLLK3                                      *((volatile unsigned char*)(0x427A018CUL))
#define bFM4_I2SPRE_IPCR3_IPLLK4                                      *((volatile unsigned char*)(0x427A0190UL))
#define bFM4_I2SPRE_IPCR4_IPLLN0                                      *((volatile unsigned char*)(0x427A0200UL))
#define bFM4_I2SPRE_IPCR4_IPLLN1                                      *((volatile unsigned char*)(0x427A0204UL))
#define bFM4_I2SPRE_IPCR4_IPLLN2                                      *((volatile unsigned char*)(0x427A0208UL))
#define bFM4_I2SPRE_IPCR4_IPLLN3                                      *((volatile unsigned char*)(0x427A020CUL))
#define bFM4_I2SPRE_IPCR4_IPLLN4                                      *((volatile unsigned char*)(0x427A0210UL))
#define bFM4_I2SPRE_IPCR4_IPLLN5                                      *((volatile unsigned char*)(0x427A0214UL))
#define bFM4_I2SPRE_IPCR4_IPLLN6                                      *((volatile unsigned char*)(0x427A0218UL))
#define bFM4_I2SPRE_IP_STR_IPRDY                                      *((volatile unsigned char*)(0x427A0280UL))
#define bFM4_I2SPRE_IPINT_ENR_IPCSE                                   *((volatile unsigned char*)(0x427A0300UL))
#define bFM4_I2SPRE_IPINT_CLR_IPCSC                                   *((volatile unsigned char*)(0x427A0380UL))
#define bFM4_I2SPRE_IPINT_STR_IPCSI                                   *((volatile unsigned char*)(0x427A0400UL))
#define bFM4_I2SPRE_IPCR5_IPLLM0                                      *((volatile unsigned char*)(0x427A0480UL))
#define bFM4_I2SPRE_IPCR5_IPLLM1                                      *((volatile unsigned char*)(0x427A0484UL))
#define bFM4_I2SPRE_IPCR5_IPLLM2                                      *((volatile unsigned char*)(0x427A0488UL))
#define bFM4_I2SPRE_IPCR5_IPLLM3                                      *((volatile unsigned char*)(0x427A048CUL))
#define bFM4_I2SPRE_IPCR5_IPLLM4                                      *((volatile unsigned char*)(0x427A0490UL))
#define bFM4_I2SPRE_IPCR5_IPLLM5                                      *((volatile unsigned char*)(0x427A0494UL))
#define bFM4_I2SPRE_IPCR5_IPLLM6                                      *((volatile unsigned char*)(0x427A0498UL))
#define bFM4_I2SPRE_ICCR_1_I2SEN1                                     *((volatile unsigned char*)(0x427A0600UL))
#define bFM4_I2SPRE_ICCR_1_ICSEL1                                     *((volatile unsigned char*)(0x427A0604UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM10                                   *((volatile unsigned char*)(0x427A0680UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM11                                   *((volatile unsigned char*)(0x427A0684UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM12                                   *((volatile unsigned char*)(0x427A0688UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM13                                   *((volatile unsigned char*)(0x427A068CUL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM14                                   *((volatile unsigned char*)(0x427A0690UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM15                                   *((volatile unsigned char*)(0x427A0694UL))
#define bFM4_I2SPRE_IPCR5_1_IPLLM16                                   *((volatile unsigned char*)(0x427A0698UL))

/* GDC Pre-scaler registers */
#define bFM4_GDCPRE_GCCR_GSSEN                                        *((volatile unsigned char*)(0x427A2000UL))
#define bFM4_GDCPRE_GPCR1_GPLLEN                                      *((volatile unsigned char*)(0x427A2080UL))
#define bFM4_GDCPRE_GPCR1_GPINC                                       *((volatile unsigned char*)(0x427A2084UL))
#define bFM4_GDCPRE_GPCR2_GPOWT0                                      *((volatile unsigned char*)(0x427A2100UL))
#define bFM4_GDCPRE_GPCR2_GPOWT1                                      *((volatile unsigned char*)(0x427A2104UL))
#define bFM4_GDCPRE_GPCR2_GPOWT2                                      *((volatile unsigned char*)(0x427A2108UL))
#define bFM4_GDCPRE_GPCR3_GPLLK0                                      *((volatile unsigned char*)(0x427A2180UL))
#define bFM4_GDCPRE_GPCR3_GPLLK1                                      *((volatile unsigned char*)(0x427A2184UL))
#define bFM4_GDCPRE_GPCR3_GPLLK2                                      *((volatile unsigned char*)(0x427A2188UL))
#define bFM4_GDCPRE_GPCR3_GPLLK3                                      *((volatile unsigned char*)(0x427A218CUL))
#define bFM4_GDCPRE_GPCR3_GPLLK4                                      *((volatile unsigned char*)(0x427A2190UL))
#define bFM4_GDCPRE_GPCR4_GPLLN0                                      *((volatile unsigned char*)(0x427A2200UL))
#define bFM4_GDCPRE_GPCR4_GPLLN1                                      *((volatile unsigned char*)(0x427A2204UL))
#define bFM4_GDCPRE_GPCR4_GPLLN2                                      *((volatile unsigned char*)(0x427A2208UL))
#define bFM4_GDCPRE_GPCR4_GPLLN3                                      *((volatile unsigned char*)(0x427A220CUL))
#define bFM4_GDCPRE_GPCR4_GPLLN4                                      *((volatile unsigned char*)(0x427A2210UL))
#define bFM4_GDCPRE_GPCR4_GPLLN5                                      *((volatile unsigned char*)(0x427A2214UL))
#define bFM4_GDCPRE_GPCR4_GPLLN6                                      *((volatile unsigned char*)(0x427A2218UL))
#define bFM4_GDCPRE_GP_STR_GPRDY                                      *((volatile unsigned char*)(0x427A2280UL))
#define bFM4_GDCPRE_GPINT_ENR_GPCSE                                   *((volatile unsigned char*)(0x427A2300UL))
#define bFM4_GDCPRE_GPINT_CLR_GPCSC                                   *((volatile unsigned char*)(0x427A2380UL))
#define bFM4_GDCPRE_GPINT_STR_GPCSI                                   *((volatile unsigned char*)(0x427A2400UL))
#define bFM4_GDCPRE_GCSR_ASEL0                                        *((volatile unsigned char*)(0x427A2500UL))
#define bFM4_GDCPRE_GCSR_ASEL1                                        *((volatile unsigned char*)(0x427A2504UL))
#define bFM4_GDCPRE_GCSR_ACG                                          *((volatile unsigned char*)(0x427A2510UL))
#define bFM4_GDCPRE_GCSR_PSEL                                         *((volatile unsigned char*)(0x427A2520UL))
#define bFM4_GDCPRE_GCSR_PCG                                          *((volatile unsigned char*)(0x427A2530UL))
#define bFM4_GDCPRE_GRCR_RSTEN                                        *((volatile unsigned char*)(0x427A2580UL))
#define bFM4_GDCPRE_GMCR_TEN                                          *((volatile unsigned char*)(0x427A2600UL))

