MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_DMAC_DMACB5_FS                    *((volatile unsigned char*)(0x42C00CE4UL))
#define bFM4_DMAC_DMACB5_TW0                   *((volatile unsigned char*)(0x42C00CE8UL))
#define bFM4_DMAC_DMACB5_TW1                   *((volatile unsigned char*)(0x42C00CECUL))
#define bFM4_DMAC_DMACB5_MS0                   *((volatile unsigned char*)(0x42C00CF0UL))
#define bFM4_DMAC_DMACB5_MS1                   *((volatile unsigned char*)(0x42C00CF4UL))
#define bFM4_DMAC_DMACA6_TC0                   *((volatile unsigned char*)(0x42C00E00UL))
#define bFM4_DMAC_DMACA6_TC1                   *((volatile unsigned char*)(0x42C00E04UL))
#define bFM4_DMAC_DMACA6_TC2                   *((volatile unsigned char*)(0x42C00E08UL))
#define bFM4_DMAC_DMACA6_TC3                   *((volatile unsigned char*)(0x42C00E0CUL))
#define bFM4_DMAC_DMACA6_TC4                   *((volatile unsigned char*)(0x42C00E10UL))
#define bFM4_DMAC_DMACA6_TC5                   *((volatile unsigned char*)(0x42C00E14UL))
#define bFM4_DMAC_DMACA6_TC6                   *((volatile unsigned char*)(0x42C00E18UL))
#define bFM4_DMAC_DMACA6_TC7                   *((volatile unsigned char*)(0x42C00E1CUL))
#define bFM4_DMAC_DMACA6_TC8                   *((volatile unsigned char*)(0x42C00E20UL))
#define bFM4_DMAC_DMACA6_TC9                   *((volatile unsigned char*)(0x42C00E24UL))
#define bFM4_DMAC_DMACA6_TC10                  *((volatile unsigned char*)(0x42C00E28UL))
#define bFM4_DMAC_DMACA6_TC11                  *((volatile unsigned char*)(0x42C00E2CUL))
#define bFM4_DMAC_DMACA6_TC12                  *((volatile unsigned char*)(0x42C00E30UL))
#define bFM4_DMAC_DMACA6_TC13                  *((volatile unsigned char*)(0x42C00E34UL))
#define bFM4_DMAC_DMACA6_TC14                  *((volatile unsigned char*)(0x42C00E38UL))
#define bFM4_DMAC_DMACA6_TC15                  *((volatile unsigned char*)(0x42C00E3CUL))
#define bFM4_DMAC_DMACA6_BC0                   *((volatile unsigned char*)(0x42C00E40UL))
#define bFM4_DMAC_DMACA6_BC1                   *((volatile unsigned char*)(0x42C00E44UL))
#define bFM4_DMAC_DMACA6_BC2                   *((volatile unsigned char*)(0x42C00E48UL))
#define bFM4_DMAC_DMACA6_BC3                   *((volatile unsigned char*)(0x42C00E4CUL))
#define bFM4_DMAC_DMACA6_IS0                   *((volatile unsigned char*)(0x42C00E5CUL))
#define bFM4_DMAC_DMACA6_IS1                   *((volatile unsigned char*)(0x42C00E60UL))
#define bFM4_DMAC_DMACA6_IS2                   *((volatile unsigned char*)(0x42C00E64UL))
#define bFM4_DMAC_DMACA6_IS3                   *((volatile unsigned char*)(0x42C00E68UL))
#define bFM4_DMAC_DMACA6_IS4                   *((volatile unsigned char*)(0x42C00E6CUL))
#define bFM4_DMAC_DMACA6_IS5                   *((volatile unsigned char*)(0x42C00E70UL))
#define bFM4_DMAC_DMACA6_ST                    *((volatile unsigned char*)(0x42C00E74UL))
#define bFM4_DMAC_DMACA6_PB                    *((volatile unsigned char*)(0x42C00E78UL))
#define bFM4_DMAC_DMACA6_EB                    *((volatile unsigned char*)(0x42C00E7CUL))
#define bFM4_DMAC_DMACB6_EM                    *((volatile unsigned char*)(0x42C00E80UL))
#define bFM4_DMAC_DMACB6_SS0                   *((volatile unsigned char*)(0x42C00EC0UL))
#define bFM4_DMAC_DMACB6_SS1                   *((volatile unsigned char*)(0x42C00EC4UL))
#define bFM4_DMAC_DMACB6_SS2                   *((volatile unsigned char*)(0x42C00EC8UL))
#define bFM4_DMAC_DMACB6_CI                    *((volatile unsigned char*)(0x42C00ECCUL))
#define bFM4_DMAC_DMACB6_EI                    *((volatile unsigned char*)(0x42C00ED0UL))
#define bFM4_DMAC_DMACB6_RD                    *((volatile unsigned char*)(0x42C00ED4UL))
#define bFM4_DMAC_DMACB6_RS                    *((volatile unsigned char*)(0x42C00ED8UL))
#define bFM4_DMAC_DMACB6_RC                    *((volatile unsigned char*)(0x42C00EDCUL))
#define bFM4_DMAC_DMACB6_FD                    *((volatile unsigned char*)(0x42C00EE0UL))
#define bFM4_DMAC_DMACB6_FS                    *((volatile unsigned char*)(0x42C00EE4UL))
#define bFM4_DMAC_DMACB6_TW0                   *((volatile unsigned char*)(0x42C00EE8UL))
#define bFM4_DMAC_DMACB6_TW1                   *((volatile unsigned char*)(0x42C00EECUL))
#define bFM4_DMAC_DMACB6_MS0                   *((volatile unsigned char*)(0x42C00EF0UL))
#define bFM4_DMAC_DMACB6_MS1                   *((volatile unsigned char*)(0x42C00EF4UL))
#define bFM4_DMAC_DMACA7_TC0                   *((volatile unsigned char*)(0x42C01000UL))
#define bFM4_DMAC_DMACA7_TC1                   *((volatile unsigned char*)(0x42C01004UL))
#define bFM4_DMAC_DMACA7_TC2                   *((volatile unsigned char*)(0x42C01008UL))
#define bFM4_DMAC_DMACA7_TC3                   *((volatile unsigned char*)(0x42C0100CUL))
#define bFM4_DMAC_DMACA7_TC4                   *((volatile unsigned char*)(0x42C01010UL))
#define bFM4_DMAC_DMACA7_TC5                   *((volatile unsigned char*)(0x42C01014UL))
#define bFM4_DMAC_DMACA7_TC6                   *((volatile unsigned char*)(0x42C01018UL))
#define bFM4_DMAC_DMACA7_TC7                   *((volatile unsigned char*)(0x42C0101CUL))
#define bFM4_DMAC_DMACA7_TC8                   *((volatile unsigned char*)(0x42C01020UL))
#define bFM4_DMAC_DMACA7_TC9                   *((volatile unsigned char*)(0x42C01024UL))
#define bFM4_DMAC_DMACA7_TC10                  *((volatile unsigned char*)(0x42C01028UL))
#define bFM4_DMAC_DMACA7_TC11                  *((volatile unsigned char*)(0x42C0102CUL))
#define bFM4_DMAC_DMACA7_TC12                  *((volatile unsigned char*)(0x42C01030UL))
#define bFM4_DMAC_DMACA7_TC13                  *((volatile unsigned char*)(0x42C01034UL))
#define bFM4_DMAC_DMACA7_TC14                  *((volatile unsigned char*)(0x42C01038UL))
#define bFM4_DMAC_DMACA7_TC15                  *((volatile unsigned char*)(0x42C0103CUL))
#define bFM4_DMAC_DMACA7_BC0                   *((volatile unsigned char*)(0x42C01040UL))
#define bFM4_DMAC_DMACA7_BC1                   *((volatile unsigned char*)(0x42C01044UL))
#define bFM4_DMAC_DMACA7_BC2                   *((volatile unsigned char*)(0x42C01048UL))
#define bFM4_DMAC_DMACA7_BC3                   *((volatile unsigned char*)(0x42C0104CUL))
#define bFM4_DMAC_DMACA7_IS0                   *((volatile unsigned char*)(0x42C0105CUL))
#define bFM4_DMAC_DMACA7_IS1                   *((volatile unsigned char*)(0x42C01060UL))
#define bFM4_DMAC_DMACA7_IS2                   *((volatile unsigned char*)(0x42C01064UL))
#define bFM4_DMAC_DMACA7_IS3                   *((volatile unsigned char*)(0x42C01068UL))
#define bFM4_DMAC_DMACA7_IS4                   *((volatile unsigned char*)(0x42C0106CUL))
#define bFM4_DMAC_DMACA7_IS5                   *((volatile unsigned char*)(0x42C01070UL))
#define bFM4_DMAC_DMACA7_ST                    *((volatile unsigned char*)(0x42C01074UL))
#define bFM4_DMAC_DMACA7_PB                    *((volatile unsigned char*)(0x42C01078UL))
#define bFM4_DMAC_DMACA7_EB                    *((volatile unsigned char*)(0x42C0107CUL))
#define bFM4_DMAC_DMACB7_EM                    *((volatile unsigned char*)(0x42C01080UL))
#define bFM4_DMAC_DMACB7_SS0                   *((volatile unsigned char*)(0x42C010C0UL))
#define bFM4_DMAC_DMACB7_SS1                   *((volatile unsigned char*)(0x42C010C4UL))
#define bFM4_DMAC_DMACB7_SS2                   *((volatile unsigned char*)(0x42C010C8UL))
#define bFM4_DMAC_DMACB7_CI                    *((volatile unsigned char*)(0x42C010CCUL))
#define bFM4_DMAC_DMACB7_EI                    *((volatile unsigned char*)(0x42C010D0UL))
#define bFM4_DMAC_DMACB7_RD                    *((volatile unsigned char*)(0x42C010D4UL))
#define bFM4_DMAC_DMACB7_RS                    *((volatile unsigned char*)(0x42C010D8UL))
#define bFM4_DMAC_DMACB7_RC                    *((volatile unsigned char*)(0x42C010DCUL))
#define bFM4_DMAC_DMACB7_FD                    *((volatile unsigned char*)(0x42C010E0UL))
#define bFM4_DMAC_DMACB7_FS                    *((volatile unsigned char*)(0x42C010E4UL))
#define bFM4_DMAC_DMACB7_TW0                   *((volatile unsigned char*)(0x42C010E8UL))
#define bFM4_DMAC_DMACB7_TW1                   *((volatile unsigned char*)(0x42C010ECUL))
#define bFM4_DMAC_DMACB7_MS0                   *((volatile unsigned char*)(0x42C010F0UL))
#define bFM4_DMAC_DMACB7_MS1                   *((volatile unsigned char*)(0x42C010F4UL))

/* DSTC registers */
#define bFM4_DSTC_HWDESP_CHANNEL0                                     *((volatile unsigned char*)(0x42C20080UL))
#define bFM4_DSTC_HWDESP_CHANNEL1                                     *((volatile unsigned char*)(0x42C20084UL))
#define bFM4_DSTC_HWDESP_CHANNEL2                                     *((volatile unsigned char*)(0x42C20088UL))
#define bFM4_DSTC_HWDESP_CHANNEL3                                     *((volatile unsigned char*)(0x42C2008CUL))
#define bFM4_DSTC_HWDESP_CHANNEL4                                     *((volatile unsigned char*)(0x42C20090UL))
#define bFM4_DSTC_HWDESP_CHANNEL5                                     *((volatile unsigned char*)(0x42C20094UL))
#define bFM4_DSTC_HWDESP_CHANNEL6                                     *((volatile unsigned char*)(0x42C20098UL))
#define bFM4_DSTC_HWDESP_CHANNEL7                                     *((volatile unsigned char*)(0x42C2009CUL))
#define bFM4_DSTC_HWDESP_HWDESP0                                      *((volatile unsigned char*)(0x42C200C0UL))
#define bFM4_DSTC_HWDESP_HWDESP1                                      *((volatile unsigned char*)(0x42C200C4UL))
#define bFM4_DSTC_HWDESP_HWDESP2                                      *((volatile unsigned char*)(0x42C200C8UL))
#define bFM4_DSTC_HWDESP_HWDESP3                                      *((volatile unsigned char*)(0x42C200CCUL))
#define bFM4_DSTC_HWDESP_HWDESP4                                      *((volatile unsigned char*)(0x42C200D0UL))
#define bFM4_DSTC_HWDESP_HWDESP5                                      *((volatile unsigned char*)(0x42C200D4UL))
#define bFM4_DSTC_HWDESP_HWDESP6                                      *((volatile unsigned char*)(0x42C200D8UL))
#define bFM4_DSTC_HWDESP_HWDESP7                                      *((volatile unsigned char*)(0x42C200DCUL))
#define bFM4_DSTC_HWDESP_HWDESP8                                      *((volatile unsigned char*)(0x42C200E0UL))
#define bFM4_DSTC_HWDESP_HWDESP9                                      *((volatile unsigned char*)(0x42C200E4UL))
#define bFM4_DSTC_HWDESP_HWDESP10                                     *((volatile unsigned char*)(0x42C200E8UL))
#define bFM4_DSTC_HWDESP_HWDESP11                                     *((volatile unsigned char*)(0x42C200ECUL))
#define bFM4_DSTC_HWDESP_HWDESP12                                     *((volatile unsigned char*)(0x42C200F0UL))
#define bFM4_DSTC_HWDESP_HWDESP13                                     *((volatile unsigned char*)(0x42C200F4UL))
#define bFM4_DSTC_CFG_SWINTE                                          *((volatile unsigned char*)(0x42C20120UL))
#define bFM4_DSTC_CFG_ERINTE                                          *((volatile unsigned char*)(0x42C20124UL))
#define bFM4_DSTC_CFG_RBDIS                                           *((volatile unsigned char*)(0x42C20128UL))
#define bFM4_DSTC_CFG_ESTE                                            *((volatile unsigned char*)(0x42C2012CUL))
#define bFM4_DSTC_CFG_SWPR0                                           *((volatile unsigned char*)(0x42C20130UL))
#define bFM4_DSTC_CFG_SWPR1                                           *((volatile unsigned char*)(0x42C20134UL))
#define bFM4_DSTC_CFG_SWPR2                                           *((volatile unsigned char*)(0x42C20138UL))
#define bFM4_DSTC_SWTR_SWDESP0                                        *((volatile unsigned char*)(0x42C20140UL))
#define bFM4_DSTC_SWTR_SWDESP1                                        *((volatile unsigned char*)(0x42C20144UL))
#define bFM4_DSTC_SWTR_SWDESP2                                        *((volatile unsigned char*)(0x42C20148UL))
#define bFM4_DSTC_SWTR_SWDESP3                                        *((volatile unsigned char*)(0x42C2014CUL))
#define bFM4_DSTC_SWTR_SWDESP4                                        *((volatile unsigned char*)(0x42C20150UL))
#define bFM4_DSTC_SWTR_SWDESP5                                        *((volatile unsigned char*)(0x42C20154UL))
#define bFM4_DSTC_SWTR_SWDESP6                                        *((volatile unsigned char*)(0x42C20158UL))
#define bFM4_DSTC_SWTR_SWDESP7                                        *((volatile unsigned char*)(0x42C2015CUL))
#define bFM4_DSTC_SWTR_SWDESP8                                        *((volatile unsigned char*)(0x42C20160UL))
#define bFM4_DSTC_SWTR_SWDESP9                                        *((volatile unsigned char*)(0x42C20164UL))
#define bFM4_DSTC_SWTR_SWDESP10                                       *((volatile unsigned char*)(0x42C20168UL))
#define bFM4_DSTC_SWTR_SWDESP11                                       *((volatile unsigned char*)(0x42C2016CUL))
#define bFM4_DSTC_SWTR_SWDESP12                                       *((volatile unsigned char*)(0x42C20170UL))
#define bFM4_DSTC_SWTR_SWDESP13                                       *((volatile unsigned char*)(0x42C20174UL))
#define bFM4_DSTC_SWTR_SWREQ                                          *((volatile unsigned char*)(0x42C20178UL))
#define bFM4_DSTC_SWTR_SWST                                           *((volatile unsigned char*)(0x42C2017CUL))
#define bFM4_DSTC_MONERS_EST0                                         *((volatile unsigned char*)(0x42C20180UL))
#define bFM4_DSTC_MONERS_EST1                                         *((volatile unsigned char*)(0x42C20184UL))
#define bFM4_DSTC_MONERS_EST2                                         *((volatile unsigned char*)(0x42C20188UL))
#define bFM4_DSTC_MONERS_DER                                          *((volatile unsigned char*)(0x42C2018CUL))
#define bFM4_DSTC_MONERS_ESTOP                                        *((volatile unsigned char*)(0x42C20190UL))
#define bFM4_DSTC_MONERS_EHS                                          *((volatile unsigned char*)(0x42C20198UL))
#define bFM4_DSTC_MONERS_ECH0                                         *((volatile unsigned char*)(0x42C201A0UL))
#define bFM4_DSTC_MONERS_ECH1                                         *((volatile unsigned char*)(0x42C201A4UL))
#define bFM4_DSTC_MONERS_ECH2                                         *((volatile unsigned char*)(0x42C201A8UL))
#define bFM4_DSTC_MONERS_ECH3                                         *((volatile unsigned char*)(0x42C201ACUL))
#define bFM4_DSTC_MONERS_ECH4                                         *((volatile unsigned char*)(0x42C201B0UL))
#define bFM4_DSTC_MONERS_ECH5                                         *((volatile unsigned char*)(0x42C201B4UL))
#define bFM4_DSTC_MONERS_ECH6                                         *((volatile unsigned char*)(0x42C201B8UL))
#define bFM4_DSTC_MONERS_ECH7                                         *((volatile unsigned char*)(0x42C201BCUL))
#define bFM4_DSTC_MONERS_EDESP0                                       *((volatile unsigned char*)(0x42C201C0UL))
#define bFM4_DSTC_MONERS_EDESP1                                       *((volatile unsigned char*)(0x42C201C4UL))
#define bFM4_DSTC_MONERS_EDESP2                                       *((volatile unsigned char*)(0x42C201C8UL))
#define bFM4_DSTC_MONERS_EDESP3                                       *((volatile unsigned char*)(0x42C201CCUL))
#define bFM4_DSTC_MONERS_EDESP4                                       *((volatile unsigned char*)(0x42C201D0UL))
#define bFM4_DSTC_MONERS_EDESP5                                       *((volatile unsigned char*)(0x42C201D4UL))
#define bFM4_DSTC_MONERS_EDESP6                                       *((volatile unsigned char*)(0x42C201D8UL))
#define bFM4_DSTC_MONERS_EDESP7                                       *((volatile unsigned char*)(0x42C201DCUL))
#define bFM4_DSTC_MONERS_EDESP8                                       *((volatile unsigned char*)(0x42C201E0UL))
#define bFM4_DSTC_MONERS_EDESP9                                       *((volatile unsigned char*)(0x42C201E4UL))
#define bFM4_DSTC_MONERS_EDESP10                                      *((volatile unsigned char*)(0x42C201E8UL))
#define bFM4_DSTC_MONERS_EDESP11                                      *((volatile unsigned char*)(0x42C201ECUL))
#define bFM4_DSTC_MONERS_EDESP12                                      *((volatile unsigned char*)(0x42C201F0UL))
#define bFM4_DSTC_MONERS_EDESP13                                      *((volatile unsigned char*)(0x42C201F4UL))

/* CAN channel 0 registers */

/* CAN channel 1 registers */

/* Ethernet MAC 0 registers */

/* Ethernet MAC control registers */

