MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* I2S interface ch.1 registers */
#define bFM4_I2S1_RXFDAT_RXDATA0                                      *((volatile unsigned char*)(0x42D90000UL))
#define bFM4_I2S1_RXFDAT_RXDATA1                                      *((volatile unsigned char*)(0x42D90004UL))
#define bFM4_I2S1_RXFDAT_RXDATA2                                      *((volatile unsigned char*)(0x42D90008UL))
#define bFM4_I2S1_RXFDAT_RXDATA3                                      *((volatile unsigned char*)(0x42D9000CUL))
#define bFM4_I2S1_RXFDAT_RXDATA4                                      *((volatile unsigned char*)(0x42D90010UL))
#define bFM4_I2S1_RXFDAT_RXDATA5                                      *((volatile unsigned char*)(0x42D90014UL))
#define bFM4_I2S1_RXFDAT_RXDATA6                                      *((volatile unsigned char*)(0x42D90018UL))
#define bFM4_I2S1_RXFDAT_RXDATA7                                      *((volatile unsigned char*)(0x42D9001CUL))
#define bFM4_I2S1_RXFDAT_RXDATA8                                      *((volatile unsigned char*)(0x42D90020UL))
#define bFM4_I2S1_RXFDAT_RXDATA9                                      *((volatile unsigned char*)(0x42D90024UL))
#define bFM4_I2S1_RXFDAT_RXDATA10                                     *((volatile unsigned char*)(0x42D90028UL))
#define bFM4_I2S1_RXFDAT_RXDATA11                                     *((volatile unsigned char*)(0x42D9002CUL))
#define bFM4_I2S1_RXFDAT_RXDATA12                                     *((volatile unsigned char*)(0x42D90030UL))
#define bFM4_I2S1_RXFDAT_RXDATA13                                     *((volatile unsigned char*)(0x42D90034UL))
#define bFM4_I2S1_RXFDAT_RXDATA14                                     *((volatile unsigned char*)(0x42D90038UL))
#define bFM4_I2S1_RXFDAT_RXDATA15                                     *((volatile unsigned char*)(0x42D9003CUL))
#define bFM4_I2S1_RXFDAT_RXDATA16                                     *((volatile unsigned char*)(0x42D90040UL))
#define bFM4_I2S1_RXFDAT_RXDATA17                                     *((volatile unsigned char*)(0x42D90044UL))
#define bFM4_I2S1_RXFDAT_RXDATA18                                     *((volatile unsigned char*)(0x42D90048UL))
#define bFM4_I2S1_RXFDAT_RXDATA19                                     *((volatile unsigned char*)(0x42D9004CUL))
#define bFM4_I2S1_RXFDAT_RXDATA20                                     *((volatile unsigned char*)(0x42D90050UL))
#define bFM4_I2S1_RXFDAT_RXDATA21                                     *((volatile unsigned char*)(0x42D90054UL))
#define bFM4_I2S1_RXFDAT_RXDATA22                                     *((volatile unsigned char*)(0x42D90058UL))
#define bFM4_I2S1_RXFDAT_RXDATA23                                     *((volatile unsigned char*)(0x42D9005CUL))
#define bFM4_I2S1_RXFDAT_RXDATA24                                     *((volatile unsigned char*)(0x42D90060UL))
#define bFM4_I2S1_RXFDAT_RXDATA25                                     *((volatile unsigned char*)(0x42D90064UL))
#define bFM4_I2S1_RXFDAT_RXDATA26                                     *((volatile unsigned char*)(0x42D90068UL))
#define bFM4_I2S1_RXFDAT_RXDATA27                                     *((volatile unsigned char*)(0x42D9006CUL))
#define bFM4_I2S1_RXFDAT_RXDATA28                                     *((volatile unsigned char*)(0x42D90070UL))
#define bFM4_I2S1_RXFDAT_RXDATA29                                     *((volatile unsigned char*)(0x42D90074UL))
#define bFM4_I2S1_RXFDAT_RXDATA30                                     *((volatile unsigned char*)(0x42D90078UL))
#define bFM4_I2S1_RXFDAT_RXDATA31                                     *((volatile unsigned char*)(0x42D9007CUL))
#define bFM4_I2S1_TXFDAT_TXDATA0                                      *((volatile unsigned char*)(0x42D90080UL))
#define bFM4_I2S1_TXFDAT_TXDATA1                                      *((volatile unsigned char*)(0x42D90084UL))
#define bFM4_I2S1_TXFDAT_TXDATA2                                      *((volatile unsigned char*)(0x42D90088UL))
#define bFM4_I2S1_TXFDAT_TXDATA3                                      *((volatile unsigned char*)(0x42D9008CUL))
#define bFM4_I2S1_TXFDAT_TXDATA4                                      *((volatile unsigned char*)(0x42D90090UL))
#define bFM4_I2S1_TXFDAT_TXDATA5                                      *((volatile unsigned char*)(0x42D90094UL))
#define bFM4_I2S1_TXFDAT_TXDATA6                                      *((volatile unsigned char*)(0x42D90098UL))
#define bFM4_I2S1_TXFDAT_TXDATA7                                      *((volatile unsigned char*)(0x42D9009CUL))
#define bFM4_I2S1_TXFDAT_TXDATA8                                      *((volatile unsigned char*)(0x42D900A0UL))
#define bFM4_I2S1_TXFDAT_TXDATA9                                      *((volatile unsigned char*)(0x42D900A4UL))
#define bFM4_I2S1_TXFDAT_TXDATA10                                     *((volatile unsigned char*)(0x42D900A8UL))
#define bFM4_I2S1_TXFDAT_TXDATA11                                     *((volatile unsigned char*)(0x42D900ACUL))
#define bFM4_I2S1_TXFDAT_TXDATA12                                     *((volatile unsigned char*)(0x42D900B0UL))
#define bFM4_I2S1_TXFDAT_TXDATA13                                     *((volatile unsigned char*)(0x42D900B4UL))
#define bFM4_I2S1_TXFDAT_TXDATA14                                     *((volatile unsigned char*)(0x42D900B8UL))
#define bFM4_I2S1_TXFDAT_TXDATA15                                     *((volatile unsigned char*)(0x42D900BCUL))
#define bFM4_I2S1_TXFDAT_TXDATA16                                     *((volatile unsigned char*)(0x42D900C0UL))
#define bFM4_I2S1_TXFDAT_TXDATA17                                     *((volatile unsigned char*)(0x42D900C4UL))
#define bFM4_I2S1_TXFDAT_TXDATA18                                     *((volatile unsigned char*)(0x42D900C8UL))
#define bFM4_I2S1_TXFDAT_TXDATA19                                     *((volatile unsigned char*)(0x42D900CCUL))
#define bFM4_I2S1_TXFDAT_TXDATA20                                     *((volatile unsigned char*)(0x42D900D0UL))
#define bFM4_I2S1_TXFDAT_TXDATA21                                     *((volatile unsigned char*)(0x42D900D4UL))
#define bFM4_I2S1_TXFDAT_TXDATA22                                     *((volatile unsigned char*)(0x42D900D8UL))
#define bFM4_I2S1_TXFDAT_TXDATA23                                     *((volatile unsigned char*)(0x42D900DCUL))
#define bFM4_I2S1_TXFDAT_TXDATA24                                     *((volatile unsigned char*)(0x42D900E0UL))
#define bFM4_I2S1_TXFDAT_TXDATA25                                     *((volatile unsigned char*)(0x42D900E4UL))
#define bFM4_I2S1_TXFDAT_TXDATA26                                     *((volatile unsigned char*)(0x42D900E8UL))
#define bFM4_I2S1_TXFDAT_TXDATA27                                     *((volatile unsigned char*)(0x42D900ECUL))
#define bFM4_I2S1_TXFDAT_TXDATA28                                     *((volatile unsigned char*)(0x42D900F0UL))
#define bFM4_I2S1_TXFDAT_TXDATA29                                     *((volatile unsigned char*)(0x42D900F4UL))
#define bFM4_I2S1_TXFDAT_TXDATA30                                     *((volatile unsigned char*)(0x42D900F8UL))
#define bFM4_I2S1_TXFDAT_TXDATA31                                     *((volatile unsigned char*)(0x42D900FCUL))
#define bFM4_I2S1_CNTREG_FSPL                                         *((volatile unsigned char*)(0x42D90100UL))
#define bFM4_I2S1_CNTREG_FSLN                                         *((volatile unsigned char*)(0x42D90104UL))
#define bFM4_I2S1_CNTREG_FSPH                                         *((volatile unsigned char*)(0x42D90108UL))
#define bFM4_I2S1_CNTREG_CPOL                                         *((volatile unsigned char*)(0x42D9010CUL))
#define bFM4_I2S1_CNTREG_SMPL                                         *((volatile unsigned char*)(0x42D90110UL))
#define bFM4_I2S1_CNTREG_RXDIS                                        *((volatile unsigned char*)(0x42D90114UL))
#define bFM4_I2S1_CNTREG_TXDIS                                        *((volatile unsigned char*)(0x42D90118UL))
#define bFM4_I2S1_CNTREG_MLSB                                         *((volatile unsigned char*)(0x42D9011CUL))
#define bFM4_I2S1_CNTREG_FRUN                                         *((volatile unsigned char*)(0x42D90120UL))
#define bFM4_I2S1_CNTREG_BEXT                                         *((volatile unsigned char*)(0x42D90124UL))
#define bFM4_I2S1_CNTREG_ECKM                                         *((volatile unsigned char*)(0x42D90128UL))
#define bFM4_I2S1_CNTREG_RHLL                                         *((volatile unsigned char*)(0x42D9012CUL))
#define bFM4_I2S1_CNTREG_SBFN                                         *((volatile unsigned char*)(0x42D90130UL))
#define bFM4_I2S1_CNTREG_MSMD                                         *((volatile unsigned char*)(0x42D90134UL))
#define bFM4_I2S1_CNTREG_MSKB                                         *((volatile unsigned char*)(0x42D90138UL))
#define bFM4_I2S1_CNTREG_OVHD0                                        *((volatile unsigned char*)(0x42D90140UL))
#define bFM4_I2S1_CNTREG_OVHD1                                        *((volatile unsigned char*)(0x42D90144UL))
#define bFM4_I2S1_CNTREG_OVHD2                                        *((volatile unsigned char*)(0x42D90148UL))
#define bFM4_I2S1_CNTREG_OVHD3                                        *((volatile unsigned char*)(0x42D9014CUL))
#define bFM4_I2S1_CNTREG_OVHD4                                        *((volatile unsigned char*)(0x42D90150UL))
#define bFM4_I2S1_CNTREG_OVHD5                                        *((volatile unsigned char*)(0x42D90154UL))
#define bFM4_I2S1_CNTREG_OVHD6                                        *((volatile unsigned char*)(0x42D90158UL))
#define bFM4_I2S1_CNTREG_OVHD7                                        *((volatile unsigned char*)(0x42D9015CUL))
#define bFM4_I2S1_CNTREG_OVHD8                                        *((volatile unsigned char*)(0x42D90160UL))
#define bFM4_I2S1_CNTREG_OVHD9                                        *((volatile unsigned char*)(0x42D90164UL))
#define bFM4_I2S1_CNTREG_CKRT0                                        *((volatile unsigned char*)(0x42D90168UL))
#define bFM4_I2S1_CNTREG_CKRT1                                        *((volatile unsigned char*)(0x42D9016CUL))
#define bFM4_I2S1_CNTREG_CKRT2                                        *((volatile unsigned char*)(0x42D90170UL))
#define bFM4_I2S1_CNTREG_CKRT3                                        *((volatile unsigned char*)(0x42D90174UL))
#define bFM4_I2S1_CNTREG_CKRT4                                        *((volatile unsigned char*)(0x42D90178UL))
#define bFM4_I2S1_CNTREG_CKRT5                                        *((volatile unsigned char*)(0x42D9017CUL))
#define bFM4_I2S1_MCR0REG_S0WDL0                                      *((volatile unsigned char*)(0x42D90180UL))
#define bFM4_I2S1_MCR0REG_S0WDL1                                      *((volatile unsigned char*)(0x42D90184UL))
#define bFM4_I2S1_MCR0REG_S0WDL2                                      *((volatile unsigned char*)(0x42D90188UL))
#define bFM4_I2S1_MCR0REG_S0WDL3                                      *((volatile unsigned char*)(0x42D9018CUL))
#define bFM4_I2S1_MCR0REG_S0WDL4                                      *((volatile unsigned char*)(0x42D90190UL))
#define bFM4_I2S1_MCR0REG_S0CHL0                                      *((volatile unsigned char*)(0x42D90194UL))
#define bFM4_I2S1_MCR0REG_S0CHL1                                      *((volatile unsigned char*)(0x42D90198UL))
#define bFM4_I2S1_MCR0REG_S0CHL2                                      *((volatile unsigned char*)(0x42D9019CUL))
#define bFM4_I2S1_MCR0REG_S0CHL3                                      *((volatile unsigned char*)(0x42D901A0UL))
#define bFM4_I2S1_MCR0REG_S0CHL4                                      *((volatile unsigned char*)(0x42D901A4UL))
#define bFM4_I2S1_MCR0REG_S0CHN0                                      *((volatile unsigned char*)(0x42D901A8UL))
#define bFM4_I2S1_MCR0REG_S0CHN1                                      *((volatile unsigned char*)(0x42D901ACUL))
#define bFM4_I2S1_MCR0REG_S0CHN2                                      *((volatile unsigned char*)(0x42D901B0UL))
#define bFM4_I2S1_MCR0REG_S0CHN3                                      *((volatile unsigned char*)(0x42D901B4UL))
#define bFM4_I2S1_MCR0REG_S0CHN4                                      *((volatile unsigned char*)(0x42D901B8UL))
#define bFM4_I2S1_MCR0REG_S1WDL0                                      *((volatile unsigned char*)(0x42D901C0UL))
#define bFM4_I2S1_MCR0REG_S1WDL1                                      *((volatile unsigned char*)(0x42D901C4UL))
#define bFM4_I2S1_MCR0REG_S1WDL2                                      *((volatile unsigned char*)(0x42D901C8UL))
#define bFM4_I2S1_MCR0REG_S1WDL3                                      *((volatile unsigned char*)(0x42D901CCUL))
#define bFM4_I2S1_MCR0REG_S1WDL4                                      *((volatile unsigned char*)(0x42D901D0UL))
#define bFM4_I2S1_MCR0REG_S1CHL0                                      *((volatile unsigned char*)(0x42D901D4UL))
#define bFM4_I2S1_MCR0REG_S1CHL1                                      *((volatile unsigned char*)(0x42D901D8UL))
#define bFM4_I2S1_MCR0REG_S1CHL2                                      *((volatile unsigned char*)(0x42D901DCUL))
#define bFM4_I2S1_MCR0REG_S1CHL3                                      *((volatile unsigned char*)(0x42D901E0UL))
#define bFM4_I2S1_MCR0REG_S1CHL4                                      *((volatile unsigned char*)(0x42D901E4UL))
#define bFM4_I2S1_MCR0REG_S1CHN0                                      *((volatile unsigned char*)(0x42D901E8UL))
#define bFM4_I2S1_MCR0REG_S1CHN1                                      *((volatile unsigned char*)(0x42D901ECUL))
#define bFM4_I2S1_MCR0REG_S1CHN2                                      *((volatile unsigned char*)(0x42D901F0UL))
#define bFM4_I2S1_MCR0REG_S1CHN3                                      *((volatile unsigned char*)(0x42D901F4UL))
#define bFM4_I2S1_MCR0REG_S1CHN4                                      *((volatile unsigned char*)(0x42D901F8UL))
#define bFM4_I2S1_MCR1REG_S0CH00                                      *((volatile unsigned char*)(0x42D90200UL))
#define bFM4_I2S1_MCR1REG_S0CH01                                      *((volatile unsigned char*)(0x42D90204UL))
#define bFM4_I2S1_MCR1REG_S0CH02                                      *((volatile unsigned char*)(0x42D90208UL))
#define bFM4_I2S1_MCR1REG_S0CH03                                      *((volatile unsigned char*)(0x42D9020CUL))
#define bFM4_I2S1_MCR1REG_S0CH04                                      *((volatile unsigned char*)(0x42D90210UL))
#define bFM4_I2S1_MCR1REG_S0CH05                                      *((volatile unsigned char*)(0x42D90214UL))
#define bFM4_I2S1_MCR1REG_S0CH06                                      *((volatile unsigned char*)(0x42D90218UL))
#define bFM4_I2S1_MCR1REG_S0CH07                                      *((volatile unsigned char*)(0x42D9021CUL))
#define bFM4_I2S1_MCR1REG_S0CH08                                      *((volatile unsigned char*)(0x42D90220UL))
#define bFM4_I2S1_MCR1REG_S0CH09                                      *((volatile unsigned char*)(0x42D90224UL))
#define bFM4_I2S1_MCR1REG_S0CH10                                      *((volatile unsigned char*)(0x42D90228UL))
#define bFM4_I2S1_MCR1REG_S0CH11                                      *((volatile unsigned char*)(0x42D9022CUL))
#define bFM4_I2S1_MCR1REG_S0CH12                                      *((volatile unsigned char*)(0x42D90230UL))
#define bFM4_I2S1_MCR1REG_S0CH13                                      *((volatile unsigned char*)(0x42D90234UL))
#define bFM4_I2S1_MCR1REG_S0CH14                                      *((volatile unsigned char*)(0x42D90238UL))
#define bFM4_I2S1_MCR1REG_S0CH15                                      *((volatile unsigned char*)(0x42D9023CUL))
#define bFM4_I2S1_MCR1REG_S0CH16                                      *((volatile unsigned char*)(0x42D90240UL))
#define bFM4_I2S1_MCR1REG_S0CH17                                      *((volatile unsigned char*)(0x42D90244UL))
#define bFM4_I2S1_MCR1REG_S0CH18                                      *((volatile unsigned char*)(0x42D90248UL))
#define bFM4_I2S1_MCR1REG_S0CH19                                      *((volatile unsigned char*)(0x42D9024CUL))
#define bFM4_I2S1_MCR1REG_S0CH20                                      *((volatile unsigned char*)(0x42D90250UL))
#define bFM4_I2S1_MCR1REG_S0CH21                                      *((volatile unsigned char*)(0x42D90254UL))
#define bFM4_I2S1_MCR1REG_S0CH22                                      *((volatile unsigned char*)(0x42D90258UL))
#define bFM4_I2S1_MCR1REG_S0CH23                                      *((volatile unsigned char*)(0x42D9025CUL))
#define bFM4_I2S1_MCR1REG_S0CH24                                      *((volatile unsigned char*)(0x42D90260UL))
#define bFM4_I2S1_MCR1REG_S0CH25                                      *((volatile unsigned char*)(0x42D90264UL))
#define bFM4_I2S1_MCR1REG_S0CH26                                      *((volatile unsigned char*)(0x42D90268UL))
#define bFM4_I2S1_MCR1REG_S0CH27                                      *((volatile unsigned char*)(0x42D9026CUL))
#define bFM4_I2S1_MCR1REG_S0CH28                                      *((volatile unsigned char*)(0x42D90270UL))
#define bFM4_I2S1_MCR1REG_S0CH29                                      *((volatile unsigned char*)(0x42D90274UL))
#define bFM4_I2S1_MCR1REG_S0CH30                                      *((volatile unsigned char*)(0x42D90278UL))
#define bFM4_I2S1_MCR1REG_S0CH31                                      *((volatile unsigned char*)(0x42D9027CUL))
#define bFM4_I2S1_MCR2REG_S1CH00                                      *((volatile unsigned char*)(0x42D90280UL))
#define bFM4_I2S1_MCR2REG_S1CH01                                      *((volatile unsigned char*)(0x42D90284UL))
#define bFM4_I2S1_MCR2REG_S1CH02                                      *((volatile unsigned char*)(0x42D90288UL))
#define bFM4_I2S1_MCR2REG_S1CH03                                      *((volatile unsigned char*)(0x42D9028CUL))
#define bFM4_I2S1_MCR2REG_S1CH04                                      *((volatile unsigned char*)(0x42D90290UL))
#define bFM4_I2S1_MCR2REG_S1CH05                                      *((volatile unsigned char*)(0x42D90294UL))
#define bFM4_I2S1_MCR2REG_S1CH06                                      *((volatile unsigned char*)(0x42D90298UL))
#define bFM4_I2S1_MCR2REG_S1CH07                                      *((volatile unsigned char*)(0x42D9029CUL))
#define bFM4_I2S1_MCR2REG_S1CH08                                      *((volatile unsigned char*)(0x42D902A0UL))
#define bFM4_I2S1_MCR2REG_S1CH09                                      *((volatile unsigned char*)(0x42D902A4UL))
#define bFM4_I2S1_MCR2REG_S1CH10                                      *((volatile unsigned char*)(0x42D902A8UL))
#define bFM4_I2S1_MCR2REG_S1CH11                                      *((volatile unsigned char*)(0x42D902ACUL))
#define bFM4_I2S1_MCR2REG_S1CH12                                      *((volatile unsigned char*)(0x42D902B0UL))
#define bFM4_I2S1_MCR2REG_S1CH13                                      *((volatile unsigned char*)(0x42D902B4UL))
#define bFM4_I2S1_MCR2REG_S1CH14                                      *((volatile unsigned char*)(0x42D902B8UL))
#define bFM4_I2S1_MCR2REG_S1CH15                                      *((volatile unsigned char*)(0x42D902BCUL))
#define bFM4_I2S1_MCR2REG_S1CH16                                      *((volatile unsigned char*)(0x42D902C0UL))
#define bFM4_I2S1_MCR2REG_S1CH17                                      *((volatile unsigned char*)(0x42D902C4UL))
#define bFM4_I2S1_MCR2REG_S1CH18                                      *((volatile unsigned char*)(0x42D902C8UL))
#define bFM4_I2S1_MCR2REG_S1CH19                                      *((volatile unsigned char*)(0x42D902CCUL))
#define bFM4_I2S1_MCR2REG_S1CH20                                      *((volatile unsigned char*)(0x42D902D0UL))
#define bFM4_I2S1_MCR2REG_S1CH21                                      *((volatile unsigned char*)(0x42D902D4UL))
#define bFM4_I2S1_MCR2REG_S1CH22                                      *((volatile unsigned char*)(0x42D902D8UL))
#define bFM4_I2S1_MCR2REG_S1CH23                                      *((volatile unsigned char*)(0x42D902DCUL))
#define bFM4_I2S1_MCR2REG_S1CH24                                      *((volatile unsigned char*)(0x42D902E0UL))
#define bFM4_I2S1_MCR2REG_S1CH25                                      *((volatile unsigned char*)(0x42D902E4UL))
#define bFM4_I2S1_MCR2REG_S1CH26                                      *((volatile unsigned char*)(0x42D902E8UL))
#define bFM4_I2S1_MCR2REG_S1CH27                                      *((volatile unsigned char*)(0x42D902ECUL))
#define bFM4_I2S1_MCR2REG_S1CH28                                      *((volatile unsigned char*)(0x42D902F0UL))
#define bFM4_I2S1_MCR2REG_S1CH29                                      *((volatile unsigned char*)(0x42D902F4UL))
#define bFM4_I2S1_MCR2REG_S1CH30                                      *((volatile unsigned char*)(0x42D902F8UL))
#define bFM4_I2S1_MCR2REG_S1CH31                                      *((volatile unsigned char*)(0x42D902FCUL))
#define bFM4_I2S1_OPRREG_START                                        *((volatile unsigned char*)(0x42D90300UL))
#define bFM4_I2S1_OPRREG_TXENB                                        *((volatile unsigned char*)(0x42D90340UL))
#define bFM4_I2S1_OPRREG_RXENB                                        *((volatile unsigned char*)(0x42D90360UL))
#define bFM4_I2S1_SRST_SRST                                           *((volatile unsigned char*)(0x42D90380UL))
#define bFM4_I2S1_INTCNT_RFTH0                                        *((volatile unsigned char*)(0x42D90400UL))
#define bFM4_I2S1_INTCNT_RFTH1                                        *((volatile unsigned char*)(0x42D90404UL))
#define bFM4_I2S1_INTCNT_RFTH2                                        *((volatile unsigned char*)(0x42D90408UL))
#define bFM4_I2S1_INTCNT_RFTH3                                        *((volatile unsigned char*)(0x42D9040CUL))
#define bFM4_I2S1_INTCNT_RPTMR0                                       *((volatile unsigned char*)(0x42D90410UL))
#define bFM4_I2S1_INTCNT_RPTMR1                                       *((volatile unsigned char*)(0x42D90414UL))
#define bFM4_I2S1_INTCNT_TFTH0                                        *((volatile unsigned char*)(0x42D90420UL))
#define bFM4_I2S1_INTCNT_TFTH1                                        *((volatile unsigned char*)(0x42D90424UL))
#define bFM4_I2S1_INTCNT_TFTH2                                        *((volatile unsigned char*)(0x42D90428UL))
#define bFM4_I2S1_INTCNT_TFTH3                                        *((volatile unsigned char*)(0x42D9042CUL))
#define bFM4_I2S1_INTCNT_RXFIM                                        *((volatile unsigned char*)(0x42D90440UL))
#define bFM4_I2S1_INTCNT_RXFDM                                        *((volatile unsigned char*)(0x42D90444UL))
#define bFM4_I2S1_INTCNT_EOPM                                         *((volatile unsigned char*)(0x42D90448UL))
#define bFM4_I2S1_INTCNT_RXOVM                                        *((volatile unsigned char*)(0x42D9044CUL))
#define bFM4_I2S1_INTCNT_RXUDM                                        *((volatile unsigned char*)(0x42D90450UL))
#define bFM4_I2S1_INTCNT_RBERM                                        *((volatile unsigned char*)(0x42D90454UL))
#define bFM4_I2S1_INTCNT_TXFIM                                        *((volatile unsigned char*)(0x42D90460UL))
#define bFM4_I2S1_INTCNT_TXFDM                                        *((volatile unsigned char*)(0x42D90464UL))
#define bFM4_I2S1_INTCNT_TXOVM                                        *((volatile unsigned char*)(0x42D90468UL))
