MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* General purpose I/O registers */
#define bFM4_GPIO_PFR0_P0                                             *((volatile unsigned char*)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P1                                             *((volatile unsigned char*)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P2                                             *((volatile unsigned char*)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P3                                             *((volatile unsigned char*)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P4                                             *((volatile unsigned char*)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P5                                             *((volatile unsigned char*)(0x42DE0014UL))
#define bFM4_GPIO_PFR0_P6                                             *((volatile unsigned char*)(0x42DE0018UL))
#define bFM4_GPIO_PFR0_P7                                             *((volatile unsigned char*)(0x42DE001CUL))
#define bFM4_GPIO_PFR0_P8                                             *((volatile unsigned char*)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P9                                             *((volatile unsigned char*)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_PA                                             *((volatile unsigned char*)(0x42DE0028UL))
#define bFM4_GPIO_PFR0_PB                                             *((volatile unsigned char*)(0x42DE002CUL))
#define bFM4_GPIO_PFR0_PC                                             *((volatile unsigned char*)(0x42DE0030UL))
#define bFM4_GPIO_PFR0_PD                                             *((volatile unsigned char*)(0x42DE0034UL))
#define bFM4_GPIO_PFR0_PE                                             *((volatile unsigned char*)(0x42DE0038UL))
#define bFM4_GPIO_PFR1_P0                                             *((volatile unsigned char*)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P1                                             *((volatile unsigned char*)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P2                                             *((volatile unsigned char*)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P3                                             *((volatile unsigned char*)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P4                                             *((volatile unsigned char*)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P5                                             *((volatile unsigned char*)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P6                                             *((volatile unsigned char*)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P7                                             *((volatile unsigned char*)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P8                                             *((volatile unsigned char*)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P9                                             *((volatile unsigned char*)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_PA                                             *((volatile unsigned char*)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PB                                             *((volatile unsigned char*)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PC                                             *((volatile unsigned char*)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PD                                             *((volatile unsigned char*)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PE                                             *((volatile unsigned char*)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PF                                             *((volatile unsigned char*)(0x42DE00BCUL))
#define bFM4_GPIO_PFR2_P0                                             *((volatile unsigned char*)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P1                                             *((volatile unsigned char*)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P2                                             *((volatile unsigned char*)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P3                                             *((volatile unsigned char*)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P4                                             *((volatile unsigned char*)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P5                                             *((volatile unsigned char*)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P6                                             *((volatile unsigned char*)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P7                                             *((volatile unsigned char*)(0x42DE011CUL))
#define bFM4_GPIO_PFR3_P3                                             *((volatile unsigned char*)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P4                                             *((volatile unsigned char*)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P5                                             *((volatile unsigned char*)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P6                                             *((volatile unsigned char*)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P7                                             *((volatile unsigned char*)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P8                                             *((volatile unsigned char*)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P9                                             *((volatile unsigned char*)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_PA                                             *((volatile unsigned char*)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PB                                             *((volatile unsigned char*)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PC                                             *((volatile unsigned char*)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PD                                             *((volatile unsigned char*)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PE                                             *((volatile unsigned char*)(0x42DE01B8UL))
#define bFM4_GPIO_PFR3_PF                                             *((volatile unsigned char*)(0x42DE01BCUL))
#define bFM4_GPIO_PFR4_P6                                             *((volatile unsigned char*)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P7                                             *((volatile unsigned char*)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P8                                             *((volatile unsigned char*)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P9                                             *((volatile unsigned char*)(0x42DE0224UL))
#define bFM4_GPIO_PFR5_P0                                             *((volatile unsigned char*)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P1                                             *((volatile unsigned char*)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P2                                             *((volatile unsigned char*)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P3                                             *((volatile unsigned char*)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P4                                             *((volatile unsigned char*)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P5                                             *((volatile unsigned char*)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P6                                             *((volatile unsigned char*)(0x42DE0298UL))
#define bFM4_GPIO_PFR6_P0                                             *((volatile unsigned char*)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P1                                             *((volatile unsigned char*)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P2                                             *((volatile unsigned char*)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P3                                             *((volatile unsigned char*)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P4                                             *((volatile unsigned char*)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P5                                             *((volatile unsigned char*)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P6                                             *((volatile unsigned char*)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P7                                             *((volatile unsigned char*)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P8                                             *((volatile unsigned char*)(0x42DE0320UL))
#define bFM4_GPIO_PFR7_P0                                             *((volatile unsigned char*)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P1                                             *((volatile unsigned char*)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P2                                             *((volatile unsigned char*)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P3                                             *((volatile unsigned char*)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P4                                             *((volatile unsigned char*)(0x42DE0390UL))
#define bFM4_GPIO_PFR7_P5                                             *((volatile unsigned char*)(0x42DE0394UL))
#define bFM4_GPIO_PFR7_P6                                             *((volatile unsigned char*)(0x42DE0398UL))
#define bFM4_GPIO_PFR7_P7                                             *((volatile unsigned char*)(0x42DE039CUL))
#define bFM4_GPIO_PFR7_P8                                             *((volatile unsigned char*)(0x42DE03A0UL))
#define bFM4_GPIO_PFR7_P9                                             *((volatile unsigned char*)(0x42DE03A4UL))
#define bFM4_GPIO_PFR7_PA                                             *((volatile unsigned char*)(0x42DE03A8UL))
#define bFM4_GPIO_PFR7_PB                                             *((volatile unsigned char*)(0x42DE03ACUL))
#define bFM4_GPIO_PFR7_PC                                             *((volatile unsigned char*)(0x42DE03B0UL))
#define bFM4_GPIO_PFR8_P0                                             *((volatile unsigned char*)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P1                                             *((volatile unsigned char*)(0x42DE0404UL))
#define bFM4_GPIO_PFR9_P0                                             *((volatile unsigned char*)(0x42DE0480UL))
#define bFM4_GPIO_PFR9_P1                                             *((volatile unsigned char*)(0x42DE0484UL))
#define bFM4_GPIO_PFR9_P2                                             *((volatile unsigned char*)(0x42DE0488UL))
#define bFM4_GPIO_PFR9_P3                                             *((volatile unsigned char*)(0x42DE048CUL))
#define bFM4_GPIO_PFR9_P4                                             *((volatile unsigned char*)(0x42DE0490UL))
#define bFM4_GPIO_PFR9_P5                                             *((volatile unsigned char*)(0x42DE0494UL))
#define bFM4_GPIO_PFR9_P6                                             *((volatile unsigned char*)(0x42DE0498UL))
#define bFM4_GPIO_PFR9_P7                                             *((volatile unsigned char*)(0x42DE049CUL))
#define bFM4_GPIO_PFRA_P0                                             *((volatile unsigned char*)(0x42DE0500UL))
#define bFM4_GPIO_PFRA_P1                                             *((volatile unsigned char*)(0x42DE0504UL))
#define bFM4_GPIO_PFRA_P2                                             *((volatile unsigned char*)(0x42DE0508UL))
#define bFM4_GPIO_PFRA_P3                                             *((volatile unsigned char*)(0x42DE050CUL))
#define bFM4_GPIO_PFRA_P4                                             *((volatile unsigned char*)(0x42DE0510UL))
#define bFM4_GPIO_PFRA_P5                                             *((volatile unsigned char*)(0x42DE0514UL))
#define bFM4_GPIO_PFRA_P6                                             *((volatile unsigned char*)(0x42DE0518UL))
#define bFM4_GPIO_PFRA_P7                                             *((volatile unsigned char*)(0x42DE051CUL))
#define bFM4_GPIO_PFRA_P8                                             *((volatile unsigned char*)(0x42DE0520UL))
#define bFM4_GPIO_PFRA_P9                                             *((volatile unsigned char*)(0x42DE0524UL))
#define bFM4_GPIO_PFRA_PA                                             *((volatile unsigned char*)(0x42DE0528UL))
#define bFM4_GPIO_PFRA_PB                                             *((volatile unsigned char*)(0x42DE052CUL))
#define bFM4_GPIO_PFRA_PC                                             *((volatile unsigned char*)(0x42DE0530UL))
#define bFM4_GPIO_PFRA_PD                                             *((volatile unsigned char*)(0x42DE0534UL))
#define bFM4_GPIO_PFRB_P0                                             *((volatile unsigned char*)(0x42DE0580UL))
#define bFM4_GPIO_PFRB_P1                                             *((volatile unsigned char*)(0x42DE0584UL))
#define bFM4_GPIO_PFRB_P2                                             *((volatile unsigned char*)(0x42DE0588UL))
#define bFM4_GPIO_PFRB_P3                                             *((volatile unsigned char*)(0x42DE058CUL))
#define bFM4_GPIO_PFRB_P4                                             *((volatile unsigned char*)(0x42DE0590UL))
#define bFM4_GPIO_PFRB_P5                                             *((volatile unsigned char*)(0x42DE0594UL))
#define bFM4_GPIO_PFRB_P6                                             *((volatile unsigned char*)(0x42DE0598UL))
#define bFM4_GPIO_PFRB_P7                                             *((volatile unsigned char*)(0x42DE059CUL))
#define bFM4_GPIO_PFRB_P8                                             *((volatile unsigned char*)(0x42DE05A0UL))
#define bFM4_GPIO_PFRB_P9                                             *((volatile unsigned char*)(0x42DE05A4UL))
#define bFM4_GPIO_PFRB_PA                                             *((volatile unsigned char*)(0x42DE05A8UL))
#define bFM4_GPIO_PFRB_PB                                             *((volatile unsigned char*)(0x42DE05ACUL))
#define bFM4_GPIO_PFRB_PC                                             *((volatile unsigned char*)(0x42DE05B0UL))
#define bFM4_GPIO_PFRB_PD                                             *((volatile unsigned char*)(0x42DE05B4UL))
#define bFM4_GPIO_PFRC_P0                                             *((volatile unsigned char*)(0x42DE0600UL))
#define bFM4_GPIO_PFRC_P1                                             *((volatile unsigned char*)(0x42DE0604UL))
#define bFM4_GPIO_PFRC_P2                                             *((volatile unsigned char*)(0x42DE0608UL))
#define bFM4_GPIO_PFRC_P3                                             *((volatile unsigned char*)(0x42DE060CUL))
#define bFM4_GPIO_PFRC_P4                                             *((volatile unsigned char*)(0x42DE0610UL))
#define bFM4_GPIO_PFRC_P5                                             *((volatile unsigned char*)(0x42DE0614UL))
#define bFM4_GPIO_PFRC_P6                                             *((volatile unsigned char*)(0x42DE0618UL))
#define bFM4_GPIO_PFRC_P7                                             *((volatile unsigned char*)(0x42DE061CUL))
#define bFM4_GPIO_PFRC_P8                                             *((volatile unsigned char*)(0x42DE0620UL))
#define bFM4_GPIO_PFRC_P9                                             *((volatile unsigned char*)(0x42DE0624UL))
#define bFM4_GPIO_PFRC_PA                                             *((volatile unsigned char*)(0x42DE0628UL))
#define bFM4_GPIO_PFRC_PB                                             *((volatile unsigned char*)(0x42DE062CUL))
#define bFM4_GPIO_PFRC_PC                                             *((volatile unsigned char*)(0x42DE0630UL))
#define bFM4_GPIO_PFRC_PD                                             *((volatile unsigned char*)(0x42DE0634UL))
#define bFM4_GPIO_PFRD_P0                                             *((volatile unsigned char*)(0x42DE0680UL))
#define bFM4_GPIO_PFRD_P1                                             *((volatile unsigned char*)(0x42DE0684UL))
#define bFM4_GPIO_PFRD_P2                                             *((volatile unsigned char*)(0x42DE0688UL))
#define bFM4_GPIO_PFRD_P3                                             *((volatile unsigned char*)(0x42DE068CUL))
#define bFM4_GPIO_PFRD_P4                                             *((volatile unsigned char*)(0x42DE0690UL))
#define bFM4_GPIO_PFRD_P5                                             *((volatile unsigned char*)(0x42DE0694UL))
#define bFM4_GPIO_PFRD_P6                                             *((volatile unsigned char*)(0x42DE0698UL))
#define bFM4_GPIO_PFRD_P7                                             *((volatile unsigned char*)(0x42DE069CUL))
#define bFM4_GPIO_PFRD_P8                                             *((volatile unsigned char*)(0x42DE06A0UL))
#define bFM4_GPIO_PFRD_P9                                             *((volatile unsigned char*)(0x42DE06A4UL))
#define bFM4_GPIO_PFRD_PA                                             *((volatile unsigned char*)(0x42DE06A8UL))
#define bFM4_GPIO_PFRD_PB                                             *((volatile unsigned char*)(0x42DE06ACUL))
#define bFM4_GPIO_PFRD_PC                                             *((volatile unsigned char*)(0x42DE06B0UL))
#define bFM4_GPIO_PFRD_PD                                             *((volatile unsigned char*)(0x42DE06B4UL))
#define bFM4_GPIO_PFRE_P0                                             *((volatile unsigned char*)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P2                                             *((volatile unsigned char*)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P3                                             *((volatile unsigned char*)(0x42DE070CUL))
#define bFM4_GPIO_PCR0_P0                                             *((volatile unsigned char*)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P1                                             *((volatile unsigned char*)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P2                                             *((volatile unsigned char*)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P3                                             *((volatile unsigned char*)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P4                                             *((volatile unsigned char*)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P5                                             *((volatile unsigned char*)(0x42DE2014UL))
#define bFM4_GPIO_PCR0_P6                                             *((volatile unsigned char*)(0x42DE2018UL))
#define bFM4_GPIO_PCR0_P7                                             *((volatile unsigned char*)(0x42DE201CUL))
#define bFM4_GPIO_PCR0_P8                                             *((volatile unsigned char*)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P9                                             *((volatile unsigned char*)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_PA                                             *((volatile unsigned char*)(0x42DE2028UL))
#define bFM4_GPIO_PCR0_PB                                             *((volatile unsigned char*)(0x42DE202CUL))
#define bFM4_GPIO_PCR0_PC                                             *((volatile unsigned char*)(0x42DE2030UL))
#define bFM4_GPIO_PCR0_PD                                             *((volatile unsigned char*)(0x42DE2034UL))
#define bFM4_GPIO_PCR0_PE                                             *((volatile unsigned char*)(0x42DE2038UL))
#define bFM4_GPIO_PCR1_P0                                             *((volatile unsigned char*)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P1                                             *((volatile unsigned char*)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P2                                             *((volatile unsigned char*)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P3                                             *((volatile unsigned char*)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P4                                             *((volatile unsigned char*)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P5                                             *((volatile unsigned char*)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P6                                             *((volatile unsigned char*)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P7                                             *((volatile unsigned char*)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P8                                             *((volatile unsigned char*)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P9                                             *((volatile unsigned char*)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_PA                                             *((volatile unsigned char*)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_PB                                             *((volatile unsigned char*)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_PC                                             *((volatile unsigned char*)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_PD                                             *((volatile unsigned char*)(0x42DE20B4UL))
#define bFM4_GPIO_PCR1_PE                                             *((volatile unsigned char*)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_PF                                             *((volatile unsigned char*)(0x42DE20BCUL))
#define bFM4_GPIO_PCR2_P0                                             *((volatile unsigned char*)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P1                                             *((volatile unsigned char*)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P2                                             *((volatile unsigned char*)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P3                                             *((volatile unsigned char*)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P4                                             *((volatile unsigned char*)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P5                                             *((volatile unsigned char*)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P6                                             *((volatile unsigned char*)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P7                                             *((volatile unsigned char*)(0x42DE211CUL))
#define bFM4_GPIO_PCR3_P3                                             *((volatile unsigned char*)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P4                                             *((volatile unsigned char*)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P5                                             *((volatile unsigned char*)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P6                                             *((volatile unsigned char*)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P7                                             *((volatile unsigned char*)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P8                                             *((volatile unsigned char*)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P9                                             *((volatile unsigned char*)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_PA                                             *((volatile unsigned char*)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_PB                                             *((volatile unsigned char*)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_PC                                             *((volatile unsigned char*)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_PD                                             *((volatile unsigned char*)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_PE                                             *((volatile unsigned char*)(0x42DE21B8UL))
#define bFM4_GPIO_PCR3_PF                                             *((volatile unsigned char*)(0x42DE21BCUL))
#define bFM4_GPIO_PCR4_P6                                             *((volatile unsigned char*)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P7                                             *((volatile unsigned char*)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P8                                             *((volatile unsigned char*)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P9                                             *((volatile unsigned char*)(0x42DE2224UL))
#define bFM4_GPIO_PCR5_P0                                             *((volatile unsigned char*)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P1                                             *((volatile unsigned char*)(0x42DE2284UL))
