MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_PCR5_P2                                             *((volatile unsigned char*)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P3                                             *((volatile unsigned char*)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P4                                             *((volatile unsigned char*)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P5                                             *((volatile unsigned char*)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P6                                             *((volatile unsigned char*)(0x42DE2298UL))
#define bFM4_GPIO_PCR6_P0                                             *((volatile unsigned char*)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P1                                             *((volatile unsigned char*)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P2                                             *((volatile unsigned char*)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P3                                             *((volatile unsigned char*)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P4                                             *((volatile unsigned char*)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P5                                             *((volatile unsigned char*)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P6                                             *((volatile unsigned char*)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P7                                             *((volatile unsigned char*)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P8                                             *((volatile unsigned char*)(0x42DE2320UL))
#define bFM4_GPIO_PCR7_P0                                             *((volatile unsigned char*)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P1                                             *((volatile unsigned char*)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P2                                             *((volatile unsigned char*)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P3                                             *((volatile unsigned char*)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P4                                             *((volatile unsigned char*)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P5                                             *((volatile unsigned char*)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P6                                             *((volatile unsigned char*)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P7                                             *((volatile unsigned char*)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P8                                             *((volatile unsigned char*)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P9                                             *((volatile unsigned char*)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_PA                                             *((volatile unsigned char*)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PB                                             *((volatile unsigned char*)(0x42DE23ACUL))
#define bFM4_GPIO_PCR7_PC                                             *((volatile unsigned char*)(0x42DE23B0UL))
#define bFM4_GPIO_PCR9_P0                                             *((volatile unsigned char*)(0x42DE2480UL))
#define bFM4_GPIO_PCR9_P1                                             *((volatile unsigned char*)(0x42DE2484UL))
#define bFM4_GPIO_PCR9_P2                                             *((volatile unsigned char*)(0x42DE2488UL))
#define bFM4_GPIO_PCR9_P3                                             *((volatile unsigned char*)(0x42DE248CUL))
#define bFM4_GPIO_PCR9_P4                                             *((volatile unsigned char*)(0x42DE2490UL))
#define bFM4_GPIO_PCR9_P5                                             *((volatile unsigned char*)(0x42DE2494UL))
#define bFM4_GPIO_PCR9_P6                                             *((volatile unsigned char*)(0x42DE2498UL))
#define bFM4_GPIO_PCR9_P7                                             *((volatile unsigned char*)(0x42DE249CUL))
#define bFM4_GPIO_PCRA_P0                                             *((volatile unsigned char*)(0x42DE2500UL))
#define bFM4_GPIO_PCRA_P1                                             *((volatile unsigned char*)(0x42DE2504UL))
#define bFM4_GPIO_PCRA_P2                                             *((volatile unsigned char*)(0x42DE2508UL))
#define bFM4_GPIO_PCRA_P3                                             *((volatile unsigned char*)(0x42DE250CUL))
#define bFM4_GPIO_PCRA_P4                                             *((volatile unsigned char*)(0x42DE2510UL))
#define bFM4_GPIO_PCRA_P5                                             *((volatile unsigned char*)(0x42DE2514UL))
#define bFM4_GPIO_PCRA_P6                                             *((volatile unsigned char*)(0x42DE2518UL))
#define bFM4_GPIO_PCRA_P7                                             *((volatile unsigned char*)(0x42DE251CUL))
#define bFM4_GPIO_PCRA_P8                                             *((volatile unsigned char*)(0x42DE2520UL))
#define bFM4_GPIO_PCRA_P9                                             *((volatile unsigned char*)(0x42DE2524UL))
#define bFM4_GPIO_PCRA_PA                                             *((volatile unsigned char*)(0x42DE2528UL))
#define bFM4_GPIO_PCRA_PB                                             *((volatile unsigned char*)(0x42DE252CUL))
#define bFM4_GPIO_PCRA_PC                                             *((volatile unsigned char*)(0x42DE2530UL))
#define bFM4_GPIO_PCRA_PD                                             *((volatile unsigned char*)(0x42DE2534UL))
#define bFM4_GPIO_PCRB_P0                                             *((volatile unsigned char*)(0x42DE2580UL))
#define bFM4_GPIO_PCRB_P1                                             *((volatile unsigned char*)(0x42DE2584UL))
#define bFM4_GPIO_PCRB_P2                                             *((volatile unsigned char*)(0x42DE2588UL))
#define bFM4_GPIO_PCRB_P3                                             *((volatile unsigned char*)(0x42DE258CUL))
#define bFM4_GPIO_PCRB_P4                                             *((volatile unsigned char*)(0x42DE2590UL))
#define bFM4_GPIO_PCRB_P5                                             *((volatile unsigned char*)(0x42DE2594UL))
#define bFM4_GPIO_PCRB_P6                                             *((volatile unsigned char*)(0x42DE2598UL))
#define bFM4_GPIO_PCRB_P7                                             *((volatile unsigned char*)(0x42DE259CUL))
#define bFM4_GPIO_PCRB_P8                                             *((volatile unsigned char*)(0x42DE25A0UL))
#define bFM4_GPIO_PCRB_P9                                             *((volatile unsigned char*)(0x42DE25A4UL))
#define bFM4_GPIO_PCRB_PA                                             *((volatile unsigned char*)(0x42DE25A8UL))
#define bFM4_GPIO_PCRB_PB                                             *((volatile unsigned char*)(0x42DE25ACUL))
#define bFM4_GPIO_PCRB_PC                                             *((volatile unsigned char*)(0x42DE25B0UL))
#define bFM4_GPIO_PCRB_PD                                             *((volatile unsigned char*)(0x42DE25B4UL))
#define bFM4_GPIO_PCRC_P0                                             *((volatile unsigned char*)(0x42DE2600UL))
#define bFM4_GPIO_PCRC_P1                                             *((volatile unsigned char*)(0x42DE2604UL))
#define bFM4_GPIO_PCRC_P2                                             *((volatile unsigned char*)(0x42DE2608UL))
#define bFM4_GPIO_PCRC_P3                                             *((volatile unsigned char*)(0x42DE260CUL))
#define bFM4_GPIO_PCRC_P4                                             *((volatile unsigned char*)(0x42DE2610UL))
#define bFM4_GPIO_PCRC_P5                                             *((volatile unsigned char*)(0x42DE2614UL))
#define bFM4_GPIO_PCRC_P6                                             *((volatile unsigned char*)(0x42DE2618UL))
#define bFM4_GPIO_PCRC_P7                                             *((volatile unsigned char*)(0x42DE261CUL))
#define bFM4_GPIO_PCRC_P8                                             *((volatile unsigned char*)(0x42DE2620UL))
#define bFM4_GPIO_PCRC_P9                                             *((volatile unsigned char*)(0x42DE2624UL))
#define bFM4_GPIO_PCRC_PA                                             *((volatile unsigned char*)(0x42DE2628UL))
#define bFM4_GPIO_PCRC_PB                                             *((volatile unsigned char*)(0x42DE262CUL))
#define bFM4_GPIO_PCRC_PC                                             *((volatile unsigned char*)(0x42DE2630UL))
#define bFM4_GPIO_PCRC_PD                                             *((volatile unsigned char*)(0x42DE2634UL))
#define bFM4_GPIO_PCRD_P0                                             *((volatile unsigned char*)(0x42DE2680UL))
#define bFM4_GPIO_PCRD_P1                                             *((volatile unsigned char*)(0x42DE2684UL))
#define bFM4_GPIO_PCRD_P2                                             *((volatile unsigned char*)(0x42DE2688UL))
#define bFM4_GPIO_PCRD_P3                                             *((volatile unsigned char*)(0x42DE268CUL))
#define bFM4_GPIO_PCRD_P4                                             *((volatile unsigned char*)(0x42DE2690UL))
#define bFM4_GPIO_PCRD_P5                                             *((volatile unsigned char*)(0x42DE2694UL))
#define bFM4_GPIO_PCRD_P6                                             *((volatile unsigned char*)(0x42DE2698UL))
#define bFM4_GPIO_PCRD_P7                                             *((volatile unsigned char*)(0x42DE269CUL))
#define bFM4_GPIO_PCRD_P8                                             *((volatile unsigned char*)(0x42DE26A0UL))
#define bFM4_GPIO_PCRD_P9                                             *((volatile unsigned char*)(0x42DE26A4UL))
#define bFM4_GPIO_PCRD_PA                                             *((volatile unsigned char*)(0x42DE26A8UL))
#define bFM4_GPIO_PCRD_PB                                             *((volatile unsigned char*)(0x42DE26ACUL))
#define bFM4_GPIO_PCRD_PC                                             *((volatile unsigned char*)(0x42DE26B0UL))
#define bFM4_GPIO_PCRD_PD                                             *((volatile unsigned char*)(0x42DE26B4UL))
#define bFM4_GPIO_PCRE_P0                                             *((volatile unsigned char*)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P2                                             *((volatile unsigned char*)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P3                                             *((volatile unsigned char*)(0x42DE270CUL))
#define bFM4_GPIO_DDR0_P0                                             *((volatile unsigned char*)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P1                                             *((volatile unsigned char*)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P2                                             *((volatile unsigned char*)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P3                                             *((volatile unsigned char*)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P4                                             *((volatile unsigned char*)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P5                                             *((volatile unsigned char*)(0x42DE4014UL))
#define bFM4_GPIO_DDR0_P6                                             *((volatile unsigned char*)(0x42DE4018UL))
#define bFM4_GPIO_DDR0_P7                                             *((volatile unsigned char*)(0x42DE401CUL))
#define bFM4_GPIO_DDR0_P8                                             *((volatile unsigned char*)(0x42DE4020UL))
#define bFM4_GPIO_DDR0_P9                                             *((volatile unsigned char*)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_PA                                             *((volatile unsigned char*)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_PB                                             *((volatile unsigned char*)(0x42DE402CUL))
#define bFM4_GPIO_DDR0_PC                                             *((volatile unsigned char*)(0x42DE4030UL))
#define bFM4_GPIO_DDR0_PD                                             *((volatile unsigned char*)(0x42DE4034UL))
#define bFM4_GPIO_DDR0_PE                                             *((volatile unsigned char*)(0x42DE4038UL))
#define bFM4_GPIO_DDR1_P0                                             *((volatile unsigned char*)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P1                                             *((volatile unsigned char*)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P2                                             *((volatile unsigned char*)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P3                                             *((volatile unsigned char*)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P4                                             *((volatile unsigned char*)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P5                                             *((volatile unsigned char*)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P6                                             *((volatile unsigned char*)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P7                                             *((volatile unsigned char*)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P8                                             *((volatile unsigned char*)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P9                                             *((volatile unsigned char*)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_PA                                             *((volatile unsigned char*)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_PB                                             *((volatile unsigned char*)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_PC                                             *((volatile unsigned char*)(0x42DE40B0UL))
#define bFM4_GPIO_DDR1_PD                                             *((volatile unsigned char*)(0x42DE40B4UL))
#define bFM4_GPIO_DDR1_PE                                             *((volatile unsigned char*)(0x42DE40B8UL))
#define bFM4_GPIO_DDR1_PF                                             *((volatile unsigned char*)(0x42DE40BCUL))
#define bFM4_GPIO_DDR2_P0                                             *((volatile unsigned char*)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P1                                             *((volatile unsigned char*)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P2                                             *((volatile unsigned char*)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P3                                             *((volatile unsigned char*)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P4                                             *((volatile unsigned char*)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P5                                             *((volatile unsigned char*)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P6                                             *((volatile unsigned char*)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P7                                             *((volatile unsigned char*)(0x42DE411CUL))
#define bFM4_GPIO_DDR3_P3                                             *((volatile unsigned char*)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P4                                             *((volatile unsigned char*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P5                                             *((volatile unsigned char*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P6                                             *((volatile unsigned char*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P7                                             *((volatile unsigned char*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P8                                             *((volatile unsigned char*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P9                                             *((volatile unsigned char*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_PA                                             *((volatile unsigned char*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_PB                                             *((volatile unsigned char*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_PC                                             *((volatile unsigned char*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_PD                                             *((volatile unsigned char*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_PE                                             *((volatile unsigned char*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_PF                                             *((volatile unsigned char*)(0x42DE41BCUL))
#define bFM4_GPIO_DDR4_P6                                             *((volatile unsigned char*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P7                                             *((volatile unsigned char*)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P8                                             *((volatile unsigned char*)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P9                                             *((volatile unsigned char*)(0x42DE4224UL))
#define bFM4_GPIO_DDR5_P0                                             *((volatile unsigned char*)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P1                                             *((volatile unsigned char*)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P2                                             *((volatile unsigned char*)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P3                                             *((volatile unsigned char*)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P4                                             *((volatile unsigned char*)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P5                                             *((volatile unsigned char*)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P6                                             *((volatile unsigned char*)(0x42DE4298UL))
#define bFM4_GPIO_DDR6_P0                                             *((volatile unsigned char*)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P1                                             *((volatile unsigned char*)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P2                                             *((volatile unsigned char*)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P3                                             *((volatile unsigned char*)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P4                                             *((volatile unsigned char*)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P5                                             *((volatile unsigned char*)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P6                                             *((volatile unsigned char*)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P7                                             *((volatile unsigned char*)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P8                                             *((volatile unsigned char*)(0x42DE4320UL))
#define bFM4_GPIO_DDR7_P0                                             *((volatile unsigned char*)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P1                                             *((volatile unsigned char*)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P2                                             *((volatile unsigned char*)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P3                                             *((volatile unsigned char*)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P4                                             *((volatile unsigned char*)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P5                                             *((volatile unsigned char*)(0x42DE4394UL))
#define bFM4_GPIO_DDR7_P6                                             *((volatile unsigned char*)(0x42DE4398UL))
#define bFM4_GPIO_DDR7_P7                                             *((volatile unsigned char*)(0x42DE439CUL))
#define bFM4_GPIO_DDR7_P8                                             *((volatile unsigned char*)(0x42DE43A0UL))
#define bFM4_GPIO_DDR7_P9                                             *((volatile unsigned char*)(0x42DE43A4UL))
#define bFM4_GPIO_DDR7_PA                                             *((volatile unsigned char*)(0x42DE43A8UL))
#define bFM4_GPIO_DDR7_PB                                             *((volatile unsigned char*)(0x42DE43ACUL))
#define bFM4_GPIO_DDR7_PC                                             *((volatile unsigned char*)(0x42DE43B0UL))
#define bFM4_GPIO_DDR8_P0                                             *((volatile unsigned char*)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P1                                             *((volatile unsigned char*)(0x42DE4404UL))
#define bFM4_GPIO_DDR9_P0                                             *((volatile unsigned char*)(0x42DE4480UL))
#define bFM4_GPIO_DDR9_P1                                             *((volatile unsigned char*)(0x42DE4484UL))
#define bFM4_GPIO_DDR9_P2                                             *((volatile unsigned char*)(0x42DE4488UL))
#define bFM4_GPIO_DDR9_P3                                             *((volatile unsigned char*)(0x42DE448CUL))
#define bFM4_GPIO_DDR9_P4                                             *((volatile unsigned char*)(0x42DE4490UL))
#define bFM4_GPIO_DDR9_P5                                             *((volatile unsigned char*)(0x42DE4494UL))
#define bFM4_GPIO_DDR9_P6                                             *((volatile unsigned char*)(0x42DE4498UL))
#define bFM4_GPIO_DDR9_P7                                             *((volatile unsigned char*)(0x42DE449CUL))
#define bFM4_GPIO_DDRA_P0                                             *((volatile unsigned char*)(0x42DE4500UL))
#define bFM4_GPIO_DDRA_P1                                             *((volatile unsigned char*)(0x42DE4504UL))
#define bFM4_GPIO_DDRA_P2                                             *((volatile unsigned char*)(0x42DE4508UL))
#define bFM4_GPIO_DDRA_P3                                             *((volatile unsigned char*)(0x42DE450CUL))
#define bFM4_GPIO_DDRA_P4                                             *((volatile unsigned char*)(0x42DE4510UL))
#define bFM4_GPIO_DDRA_P5                                             *((volatile unsigned char*)(0x42DE4514UL))
#define bFM4_GPIO_DDRA_P6                                             *((volatile unsigned char*)(0x42DE4518UL))
#define bFM4_GPIO_DDRA_P7                                             *((volatile unsigned char*)(0x42DE451CUL))
#define bFM4_GPIO_DDRA_P8                                             *((volatile unsigned char*)(0x42DE4520UL))
#define bFM4_GPIO_DDRA_P9                                             *((volatile unsigned char*)(0x42DE4524UL))
#define bFM4_GPIO_DDRA_PA                                             *((volatile unsigned char*)(0x42DE4528UL))
#define bFM4_GPIO_DDRA_PB                                             *((volatile unsigned char*)(0x42DE452CUL))
#define bFM4_GPIO_DDRA_PC                                             *((volatile unsigned char*)(0x42DE4530UL))
#define bFM4_GPIO_DDRA_PD                                             *((volatile unsigned char*)(0x42DE4534UL))
#define bFM4_GPIO_DDRB_P0                                             *((volatile unsigned char*)(0x42DE4580UL))
#define bFM4_GPIO_DDRB_P1                                             *((volatile unsigned char*)(0x42DE4584UL))
#define bFM4_GPIO_DDRB_P2                                             *((volatile unsigned char*)(0x42DE4588UL))
#define bFM4_GPIO_DDRB_P3                                             *((volatile unsigned char*)(0x42DE458CUL))
#define bFM4_GPIO_DDRB_P4                                             *((volatile unsigned char*)(0x42DE4590UL))
#define bFM4_GPIO_DDRB_P5                                             *((volatile unsigned char*)(0x42DE4594UL))
#define bFM4_GPIO_DDRB_P6                                             *((volatile unsigned char*)(0x42DE4598UL))
#define bFM4_GPIO_DDRB_P7                                             *((volatile unsigned char*)(0x42DE459CUL))
#define bFM4_GPIO_DDRB_P8                                             *((volatile unsigned char*)(0x42DE45A0UL))
