MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_DDRB_P9                                             *((volatile unsigned char*)(0x42DE45A4UL))
#define bFM4_GPIO_DDRB_PA                                             *((volatile unsigned char*)(0x42DE45A8UL))
#define bFM4_GPIO_DDRB_PB                                             *((volatile unsigned char*)(0x42DE45ACUL))
#define bFM4_GPIO_DDRB_PC                                             *((volatile unsigned char*)(0x42DE45B0UL))
#define bFM4_GPIO_DDRB_PD                                             *((volatile unsigned char*)(0x42DE45B4UL))
#define bFM4_GPIO_DDRC_P0                                             *((volatile unsigned char*)(0x42DE4600UL))
#define bFM4_GPIO_DDRC_P1                                             *((volatile unsigned char*)(0x42DE4604UL))
#define bFM4_GPIO_DDRC_P2                                             *((volatile unsigned char*)(0x42DE4608UL))
#define bFM4_GPIO_DDRC_P3                                             *((volatile unsigned char*)(0x42DE460CUL))
#define bFM4_GPIO_DDRC_P4                                             *((volatile unsigned char*)(0x42DE4610UL))
#define bFM4_GPIO_DDRC_P5                                             *((volatile unsigned char*)(0x42DE4614UL))
#define bFM4_GPIO_DDRC_P6                                             *((volatile unsigned char*)(0x42DE4618UL))
#define bFM4_GPIO_DDRC_P7                                             *((volatile unsigned char*)(0x42DE461CUL))
#define bFM4_GPIO_DDRC_P8                                             *((volatile unsigned char*)(0x42DE4620UL))
#define bFM4_GPIO_DDRC_P9                                             *((volatile unsigned char*)(0x42DE4624UL))
#define bFM4_GPIO_DDRC_PA                                             *((volatile unsigned char*)(0x42DE4628UL))
#define bFM4_GPIO_DDRC_PB                                             *((volatile unsigned char*)(0x42DE462CUL))
#define bFM4_GPIO_DDRC_PC                                             *((volatile unsigned char*)(0x42DE4630UL))
#define bFM4_GPIO_DDRC_PD                                             *((volatile unsigned char*)(0x42DE4634UL))
#define bFM4_GPIO_DDRD_P0                                             *((volatile unsigned char*)(0x42DE4680UL))
#define bFM4_GPIO_DDRD_P1                                             *((volatile unsigned char*)(0x42DE4684UL))
#define bFM4_GPIO_DDRD_P2                                             *((volatile unsigned char*)(0x42DE4688UL))
#define bFM4_GPIO_DDRD_P3                                             *((volatile unsigned char*)(0x42DE468CUL))
#define bFM4_GPIO_DDRD_P4                                             *((volatile unsigned char*)(0x42DE4690UL))
#define bFM4_GPIO_DDRD_P5                                             *((volatile unsigned char*)(0x42DE4694UL))
#define bFM4_GPIO_DDRD_P6                                             *((volatile unsigned char*)(0x42DE4698UL))
#define bFM4_GPIO_DDRD_P7                                             *((volatile unsigned char*)(0x42DE469CUL))
#define bFM4_GPIO_DDRD_P8                                             *((volatile unsigned char*)(0x42DE46A0UL))
#define bFM4_GPIO_DDRD_P9                                             *((volatile unsigned char*)(0x42DE46A4UL))
#define bFM4_GPIO_DDRD_PA                                             *((volatile unsigned char*)(0x42DE46A8UL))
#define bFM4_GPIO_DDRD_PB                                             *((volatile unsigned char*)(0x42DE46ACUL))
#define bFM4_GPIO_DDRD_PC                                             *((volatile unsigned char*)(0x42DE46B0UL))
#define bFM4_GPIO_DDRD_PD                                             *((volatile unsigned char*)(0x42DE46B4UL))
#define bFM4_GPIO_DDRE_P0                                             *((volatile unsigned char*)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P2                                             *((volatile unsigned char*)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P3                                             *((volatile unsigned char*)(0x42DE470CUL))
#define bFM4_GPIO_PDIR0_P0                                            *((volatile unsigned char*)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P1                                            *((volatile unsigned char*)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P2                                            *((volatile unsigned char*)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P3                                            *((volatile unsigned char*)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P4                                            *((volatile unsigned char*)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P5                                            *((volatile unsigned char*)(0x42DE6014UL))
#define bFM4_GPIO_PDIR0_P6                                            *((volatile unsigned char*)(0x42DE6018UL))
#define bFM4_GPIO_PDIR0_P7                                            *((volatile unsigned char*)(0x42DE601CUL))
#define bFM4_GPIO_PDIR0_P8                                            *((volatile unsigned char*)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P9                                            *((volatile unsigned char*)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_PA                                            *((volatile unsigned char*)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_PB                                            *((volatile unsigned char*)(0x42DE602CUL))
#define bFM4_GPIO_PDIR0_PC                                            *((volatile unsigned char*)(0x42DE6030UL))
#define bFM4_GPIO_PDIR0_PD                                            *((volatile unsigned char*)(0x42DE6034UL))
#define bFM4_GPIO_PDIR0_PE                                            *((volatile unsigned char*)(0x42DE6038UL))
#define bFM4_GPIO_PDIR1_P0                                            *((volatile unsigned char*)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P1                                            *((volatile unsigned char*)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P2                                            *((volatile unsigned char*)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P3                                            *((volatile unsigned char*)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P4                                            *((volatile unsigned char*)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P5                                            *((volatile unsigned char*)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P6                                            *((volatile unsigned char*)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P7                                            *((volatile unsigned char*)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P8                                            *((volatile unsigned char*)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P9                                            *((volatile unsigned char*)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_PA                                            *((volatile unsigned char*)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PB                                            *((volatile unsigned char*)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PC                                            *((volatile unsigned char*)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PD                                            *((volatile unsigned char*)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PE                                            *((volatile unsigned char*)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PF                                            *((volatile unsigned char*)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR2_P0                                            *((volatile unsigned char*)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P1                                            *((volatile unsigned char*)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P2                                            *((volatile unsigned char*)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P3                                            *((volatile unsigned char*)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P4                                            *((volatile unsigned char*)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P5                                            *((volatile unsigned char*)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P6                                            *((volatile unsigned char*)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P7                                            *((volatile unsigned char*)(0x42DE611CUL))
#define bFM4_GPIO_PDIR3_P3                                            *((volatile unsigned char*)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P4                                            *((volatile unsigned char*)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P5                                            *((volatile unsigned char*)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P6                                            *((volatile unsigned char*)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P7                                            *((volatile unsigned char*)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P8                                            *((volatile unsigned char*)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P9                                            *((volatile unsigned char*)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_PA                                            *((volatile unsigned char*)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PB                                            *((volatile unsigned char*)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PC                                            *((volatile unsigned char*)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PD                                            *((volatile unsigned char*)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PE                                            *((volatile unsigned char*)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PF                                            *((volatile unsigned char*)(0x42DE61BCUL))
#define bFM4_GPIO_PDIR4_P6                                            *((volatile unsigned char*)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P7                                            *((volatile unsigned char*)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P8                                            *((volatile unsigned char*)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P9                                            *((volatile unsigned char*)(0x42DE6224UL))
#define bFM4_GPIO_PDIR5_P0                                            *((volatile unsigned char*)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P1                                            *((volatile unsigned char*)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P2                                            *((volatile unsigned char*)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P3                                            *((volatile unsigned char*)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P4                                            *((volatile unsigned char*)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P5                                            *((volatile unsigned char*)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P6                                            *((volatile unsigned char*)(0x42DE6298UL))
#define bFM4_GPIO_PDIR6_P0                                            *((volatile unsigned char*)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P1                                            *((volatile unsigned char*)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P2                                            *((volatile unsigned char*)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P3                                            *((volatile unsigned char*)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P4                                            *((volatile unsigned char*)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P5                                            *((volatile unsigned char*)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P6                                            *((volatile unsigned char*)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P7                                            *((volatile unsigned char*)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P8                                            *((volatile unsigned char*)(0x42DE6320UL))
#define bFM4_GPIO_PDIR7_P0                                            *((volatile unsigned char*)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P1                                            *((volatile unsigned char*)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P2                                            *((volatile unsigned char*)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P3                                            *((volatile unsigned char*)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P4                                            *((volatile unsigned char*)(0x42DE6390UL))
#define bFM4_GPIO_PDIR7_P5                                            *((volatile unsigned char*)(0x42DE6394UL))
#define bFM4_GPIO_PDIR7_P6                                            *((volatile unsigned char*)(0x42DE6398UL))
#define bFM4_GPIO_PDIR7_P7                                            *((volatile unsigned char*)(0x42DE639CUL))
#define bFM4_GPIO_PDIR7_P8                                            *((volatile unsigned char*)(0x42DE63A0UL))
#define bFM4_GPIO_PDIR7_P9                                            *((volatile unsigned char*)(0x42DE63A4UL))
#define bFM4_GPIO_PDIR7_PA                                            *((volatile unsigned char*)(0x42DE63A8UL))
#define bFM4_GPIO_PDIR7_PB                                            *((volatile unsigned char*)(0x42DE63ACUL))
#define bFM4_GPIO_PDIR7_PC                                            *((volatile unsigned char*)(0x42DE63B0UL))
#define bFM4_GPIO_PDIR8_P0                                            *((volatile unsigned char*)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P1                                            *((volatile unsigned char*)(0x42DE6404UL))
#define bFM4_GPIO_PDIR9_P0                                            *((volatile unsigned char*)(0x42DE6480UL))
#define bFM4_GPIO_PDIR9_P1                                            *((volatile unsigned char*)(0x42DE6484UL))
#define bFM4_GPIO_PDIR9_P2                                            *((volatile unsigned char*)(0x42DE6488UL))
#define bFM4_GPIO_PDIR9_P3                                            *((volatile unsigned char*)(0x42DE648CUL))
#define bFM4_GPIO_PDIR9_P4                                            *((volatile unsigned char*)(0x42DE6490UL))
#define bFM4_GPIO_PDIR9_P5                                            *((volatile unsigned char*)(0x42DE6494UL))
#define bFM4_GPIO_PDIR9_P6                                            *((volatile unsigned char*)(0x42DE6498UL))
#define bFM4_GPIO_PDIR9_P7                                            *((volatile unsigned char*)(0x42DE649CUL))
#define bFM4_GPIO_PDIRA_P0                                            *((volatile unsigned char*)(0x42DE6500UL))
#define bFM4_GPIO_PDIRA_P1                                            *((volatile unsigned char*)(0x42DE6504UL))
#define bFM4_GPIO_PDIRA_P2                                            *((volatile unsigned char*)(0x42DE6508UL))
#define bFM4_GPIO_PDIRA_P3                                            *((volatile unsigned char*)(0x42DE650CUL))
#define bFM4_GPIO_PDIRA_P4                                            *((volatile unsigned char*)(0x42DE6510UL))
#define bFM4_GPIO_PDIRA_P5                                            *((volatile unsigned char*)(0x42DE6514UL))
#define bFM4_GPIO_PDIRA_P6                                            *((volatile unsigned char*)(0x42DE6518UL))
#define bFM4_GPIO_PDIRA_P7                                            *((volatile unsigned char*)(0x42DE651CUL))
#define bFM4_GPIO_PDIRA_P8                                            *((volatile unsigned char*)(0x42DE6520UL))
#define bFM4_GPIO_PDIRA_P9                                            *((volatile unsigned char*)(0x42DE6524UL))
#define bFM4_GPIO_PDIRA_PA                                            *((volatile unsigned char*)(0x42DE6528UL))
#define bFM4_GPIO_PDIRA_PB                                            *((volatile unsigned char*)(0x42DE652CUL))
#define bFM4_GPIO_PDIRA_PC                                            *((volatile unsigned char*)(0x42DE6530UL))
#define bFM4_GPIO_PDIRA_PD                                            *((volatile unsigned char*)(0x42DE6534UL))
#define bFM4_GPIO_PDIRB_P0                                            *((volatile unsigned char*)(0x42DE6580UL))
#define bFM4_GPIO_PDIRB_P1                                            *((volatile unsigned char*)(0x42DE6584UL))
#define bFM4_GPIO_PDIRB_P2                                            *((volatile unsigned char*)(0x42DE6588UL))
#define bFM4_GPIO_PDIRB_P3                                            *((volatile unsigned char*)(0x42DE658CUL))
#define bFM4_GPIO_PDIRB_P4                                            *((volatile unsigned char*)(0x42DE6590UL))
#define bFM4_GPIO_PDIRB_P5                                            *((volatile unsigned char*)(0x42DE6594UL))
#define bFM4_GPIO_PDIRB_P6                                            *((volatile unsigned char*)(0x42DE6598UL))
#define bFM4_GPIO_PDIRB_P7                                            *((volatile unsigned char*)(0x42DE659CUL))
#define bFM4_GPIO_PDIRB_P8                                            *((volatile unsigned char*)(0x42DE65A0UL))
#define bFM4_GPIO_PDIRB_P9                                            *((volatile unsigned char*)(0x42DE65A4UL))
#define bFM4_GPIO_PDIRB_PA                                            *((volatile unsigned char*)(0x42DE65A8UL))
#define bFM4_GPIO_PDIRB_PB                                            *((volatile unsigned char*)(0x42DE65ACUL))
#define bFM4_GPIO_PDIRB_PC                                            *((volatile unsigned char*)(0x42DE65B0UL))
#define bFM4_GPIO_PDIRB_PD                                            *((volatile unsigned char*)(0x42DE65B4UL))
#define bFM4_GPIO_PDIRC_P0                                            *((volatile unsigned char*)(0x42DE6600UL))
#define bFM4_GPIO_PDIRC_P1                                            *((volatile unsigned char*)(0x42DE6604UL))
#define bFM4_GPIO_PDIRC_P2                                            *((volatile unsigned char*)(0x42DE6608UL))
#define bFM4_GPIO_PDIRC_P3                                            *((volatile unsigned char*)(0x42DE660CUL))
#define bFM4_GPIO_PDIRC_P4                                            *((volatile unsigned char*)(0x42DE6610UL))
#define bFM4_GPIO_PDIRC_P5                                            *((volatile unsigned char*)(0x42DE6614UL))
#define bFM4_GPIO_PDIRC_P6                                            *((volatile unsigned char*)(0x42DE6618UL))
#define bFM4_GPIO_PDIRC_P7                                            *((volatile unsigned char*)(0x42DE661CUL))
#define bFM4_GPIO_PDIRC_P8                                            *((volatile unsigned char*)(0x42DE6620UL))
#define bFM4_GPIO_PDIRC_P9                                            *((volatile unsigned char*)(0x42DE6624UL))
#define bFM4_GPIO_PDIRC_PA                                            *((volatile unsigned char*)(0x42DE6628UL))
#define bFM4_GPIO_PDIRC_PB                                            *((volatile unsigned char*)(0x42DE662CUL))
#define bFM4_GPIO_PDIRC_PC                                            *((volatile unsigned char*)(0x42DE6630UL))
#define bFM4_GPIO_PDIRC_PD                                            *((volatile unsigned char*)(0x42DE6634UL))
#define bFM4_GPIO_PDIRD_P0                                            *((volatile unsigned char*)(0x42DE6680UL))
#define bFM4_GPIO_PDIRD_P1                                            *((volatile unsigned char*)(0x42DE6684UL))
#define bFM4_GPIO_PDIRD_P2                                            *((volatile unsigned char*)(0x42DE6688UL))
#define bFM4_GPIO_PDIRD_P3                                            *((volatile unsigned char*)(0x42DE668CUL))
#define bFM4_GPIO_PDIRD_P4                                            *((volatile unsigned char*)(0x42DE6690UL))
#define bFM4_GPIO_PDIRD_P5                                            *((volatile unsigned char*)(0x42DE6694UL))
#define bFM4_GPIO_PDIRD_P6                                            *((volatile unsigned char*)(0x42DE6698UL))
#define bFM4_GPIO_PDIRD_P7                                            *((volatile unsigned char*)(0x42DE669CUL))
#define bFM4_GPIO_PDIRD_P8                                            *((volatile unsigned char*)(0x42DE66A0UL))
#define bFM4_GPIO_PDIRD_P9                                            *((volatile unsigned char*)(0x42DE66A4UL))
#define bFM4_GPIO_PDIRD_PA                                            *((volatile unsigned char*)(0x42DE66A8UL))
#define bFM4_GPIO_PDIRD_PB                                            *((volatile unsigned char*)(0x42DE66ACUL))
#define bFM4_GPIO_PDIRD_PC                                            *((volatile unsigned char*)(0x42DE66B0UL))
#define bFM4_GPIO_PDIRD_PD                                            *((volatile unsigned char*)(0x42DE66B4UL))
#define bFM4_GPIO_PDIRE_P0                                            *((volatile unsigned char*)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P2                                            *((volatile unsigned char*)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P3                                            *((volatile unsigned char*)(0x42DE670CUL))
#define bFM4_GPIO_PDOR0_P0                                            *((volatile unsigned char*)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P1                                            *((volatile unsigned char*)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P2                                            *((volatile unsigned char*)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P3                                            *((volatile unsigned char*)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P4                                            *((volatile unsigned char*)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P5                                            *((volatile unsigned char*)(0x42DE8014UL))
#define bFM4_GPIO_PDOR0_P6                                            *((volatile unsigned char*)(0x42DE8018UL))
#define bFM4_GPIO_PDOR0_P7                                            *((volatile unsigned char*)(0x42DE801CUL))
#define bFM4_GPIO_PDOR0_P8                                            *((volatile unsigned char*)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P9                                            *((volatile unsigned char*)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_PA                                            *((volatile unsigned char*)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PB                                            *((volatile unsigned char*)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_PC                                            *((volatile unsigned char*)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_PD                                            *((volatile unsigned char*)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_PE                                            *((volatile unsigned char*)(0x42DE8038UL))
#define bFM4_GPIO_PDOR1_P0                                            *((volatile unsigned char*)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P1                                            *((volatile unsigned char*)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P2                                            *((volatile unsigned char*)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P3                                            *((volatile unsigned char*)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P4                                            *((volatile unsigned char*)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P5                                            *((volatile unsigned char*)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P6                                            *((volatile unsigned char*)(0x42DE8098UL))
