MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_PDOR1_P7                                            *((volatile unsigned char*)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P8                                            *((volatile unsigned char*)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P9                                            *((volatile unsigned char*)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_PA                                            *((volatile unsigned char*)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PB                                            *((volatile unsigned char*)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PC                                            *((volatile unsigned char*)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PD                                            *((volatile unsigned char*)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PE                                            *((volatile unsigned char*)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PF                                            *((volatile unsigned char*)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR2_P0                                            *((volatile unsigned char*)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P1                                            *((volatile unsigned char*)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P2                                            *((volatile unsigned char*)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P3                                            *((volatile unsigned char*)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P4                                            *((volatile unsigned char*)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P5                                            *((volatile unsigned char*)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P6                                            *((volatile unsigned char*)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P7                                            *((volatile unsigned char*)(0x42DE811CUL))
#define bFM4_GPIO_PDOR3_P3                                            *((volatile unsigned char*)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P4                                            *((volatile unsigned char*)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P5                                            *((volatile unsigned char*)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P6                                            *((volatile unsigned char*)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P7                                            *((volatile unsigned char*)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P8                                            *((volatile unsigned char*)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P9                                            *((volatile unsigned char*)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_PA                                            *((volatile unsigned char*)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PB                                            *((volatile unsigned char*)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PC                                            *((volatile unsigned char*)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PD                                            *((volatile unsigned char*)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PE                                            *((volatile unsigned char*)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PF                                            *((volatile unsigned char*)(0x42DE81BCUL))
#define bFM4_GPIO_PDOR4_P6                                            *((volatile unsigned char*)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P7                                            *((volatile unsigned char*)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P8                                            *((volatile unsigned char*)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P9                                            *((volatile unsigned char*)(0x42DE8224UL))
#define bFM4_GPIO_PDOR5_P0                                            *((volatile unsigned char*)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P1                                            *((volatile unsigned char*)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P2                                            *((volatile unsigned char*)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P3                                            *((volatile unsigned char*)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P4                                            *((volatile unsigned char*)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P5                                            *((volatile unsigned char*)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P6                                            *((volatile unsigned char*)(0x42DE8298UL))
#define bFM4_GPIO_PDOR6_P0                                            *((volatile unsigned char*)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P1                                            *((volatile unsigned char*)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P2                                            *((volatile unsigned char*)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P3                                            *((volatile unsigned char*)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P4                                            *((volatile unsigned char*)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P5                                            *((volatile unsigned char*)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P6                                            *((volatile unsigned char*)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P7                                            *((volatile unsigned char*)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P8                                            *((volatile unsigned char*)(0x42DE8320UL))
#define bFM4_GPIO_PDOR7_P0                                            *((volatile unsigned char*)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P1                                            *((volatile unsigned char*)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P2                                            *((volatile unsigned char*)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P3                                            *((volatile unsigned char*)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P4                                            *((volatile unsigned char*)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P5                                            *((volatile unsigned char*)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P6                                            *((volatile unsigned char*)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P7                                            *((volatile unsigned char*)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P8                                            *((volatile unsigned char*)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P9                                            *((volatile unsigned char*)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_PA                                            *((volatile unsigned char*)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PB                                            *((volatile unsigned char*)(0x42DE83ACUL))
#define bFM4_GPIO_PDOR7_PC                                            *((volatile unsigned char*)(0x42DE83B0UL))
#define bFM4_GPIO_PDOR8_P0                                            *((volatile unsigned char*)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P1                                            *((volatile unsigned char*)(0x42DE8404UL))
#define bFM4_GPIO_PDOR9_P0                                            *((volatile unsigned char*)(0x42DE8480UL))
#define bFM4_GPIO_PDOR9_P1                                            *((volatile unsigned char*)(0x42DE8484UL))
#define bFM4_GPIO_PDOR9_P2                                            *((volatile unsigned char*)(0x42DE8488UL))
#define bFM4_GPIO_PDOR9_P3                                            *((volatile unsigned char*)(0x42DE848CUL))
#define bFM4_GPIO_PDOR9_P4                                            *((volatile unsigned char*)(0x42DE8490UL))
#define bFM4_GPIO_PDOR9_P5                                            *((volatile unsigned char*)(0x42DE8494UL))
#define bFM4_GPIO_PDOR9_P6                                            *((volatile unsigned char*)(0x42DE8498UL))
#define bFM4_GPIO_PDOR9_P7                                            *((volatile unsigned char*)(0x42DE849CUL))
#define bFM4_GPIO_PDORA_P0                                            *((volatile unsigned char*)(0x42DE8500UL))
#define bFM4_GPIO_PDORA_P1                                            *((volatile unsigned char*)(0x42DE8504UL))
#define bFM4_GPIO_PDORA_P2                                            *((volatile unsigned char*)(0x42DE8508UL))
#define bFM4_GPIO_PDORA_P3                                            *((volatile unsigned char*)(0x42DE850CUL))
#define bFM4_GPIO_PDORA_P4                                            *((volatile unsigned char*)(0x42DE8510UL))
#define bFM4_GPIO_PDORA_P5                                            *((volatile unsigned char*)(0x42DE8514UL))
#define bFM4_GPIO_PDORA_P6                                            *((volatile unsigned char*)(0x42DE8518UL))
#define bFM4_GPIO_PDORA_P7                                            *((volatile unsigned char*)(0x42DE851CUL))
#define bFM4_GPIO_PDORA_P8                                            *((volatile unsigned char*)(0x42DE8520UL))
#define bFM4_GPIO_PDORA_P9                                            *((volatile unsigned char*)(0x42DE8524UL))
#define bFM4_GPIO_PDORA_PA                                            *((volatile unsigned char*)(0x42DE8528UL))
#define bFM4_GPIO_PDORA_PB                                            *((volatile unsigned char*)(0x42DE852CUL))
#define bFM4_GPIO_PDORA_PC                                            *((volatile unsigned char*)(0x42DE8530UL))
#define bFM4_GPIO_PDORA_PD                                            *((volatile unsigned char*)(0x42DE8534UL))
#define bFM4_GPIO_PDORB_P0                                            *((volatile unsigned char*)(0x42DE8580UL))
#define bFM4_GPIO_PDORB_P1                                            *((volatile unsigned char*)(0x42DE8584UL))
#define bFM4_GPIO_PDORB_P2                                            *((volatile unsigned char*)(0x42DE8588UL))
#define bFM4_GPIO_PDORB_P3                                            *((volatile unsigned char*)(0x42DE858CUL))
#define bFM4_GPIO_PDORB_P4                                            *((volatile unsigned char*)(0x42DE8590UL))
#define bFM4_GPIO_PDORB_P5                                            *((volatile unsigned char*)(0x42DE8594UL))
#define bFM4_GPIO_PDORB_P6                                            *((volatile unsigned char*)(0x42DE8598UL))
#define bFM4_GPIO_PDORB_P7                                            *((volatile unsigned char*)(0x42DE859CUL))
#define bFM4_GPIO_PDORB_P8                                            *((volatile unsigned char*)(0x42DE85A0UL))
#define bFM4_GPIO_PDORB_P9                                            *((volatile unsigned char*)(0x42DE85A4UL))
#define bFM4_GPIO_PDORB_PA                                            *((volatile unsigned char*)(0x42DE85A8UL))
#define bFM4_GPIO_PDORB_PB                                            *((volatile unsigned char*)(0x42DE85ACUL))
#define bFM4_GPIO_PDORB_PC                                            *((volatile unsigned char*)(0x42DE85B0UL))
#define bFM4_GPIO_PDORB_PD                                            *((volatile unsigned char*)(0x42DE85B4UL))
#define bFM4_GPIO_PDORC_P0                                            *((volatile unsigned char*)(0x42DE8600UL))
#define bFM4_GPIO_PDORC_P1                                            *((volatile unsigned char*)(0x42DE8604UL))
#define bFM4_GPIO_PDORC_P2                                            *((volatile unsigned char*)(0x42DE8608UL))
#define bFM4_GPIO_PDORC_P3                                            *((volatile unsigned char*)(0x42DE860CUL))
#define bFM4_GPIO_PDORC_P4                                            *((volatile unsigned char*)(0x42DE8610UL))
#define bFM4_GPIO_PDORC_P5                                            *((volatile unsigned char*)(0x42DE8614UL))
#define bFM4_GPIO_PDORC_P6                                            *((volatile unsigned char*)(0x42DE8618UL))
#define bFM4_GPIO_PDORC_P7                                            *((volatile unsigned char*)(0x42DE861CUL))
#define bFM4_GPIO_PDORC_P8                                            *((volatile unsigned char*)(0x42DE8620UL))
#define bFM4_GPIO_PDORC_P9                                            *((volatile unsigned char*)(0x42DE8624UL))
#define bFM4_GPIO_PDORC_PA                                            *((volatile unsigned char*)(0x42DE8628UL))
#define bFM4_GPIO_PDORC_PB                                            *((volatile unsigned char*)(0x42DE862CUL))
#define bFM4_GPIO_PDORC_PC                                            *((volatile unsigned char*)(0x42DE8630UL))
#define bFM4_GPIO_PDORC_PD                                            *((volatile unsigned char*)(0x42DE8634UL))
#define bFM4_GPIO_PDORD_P0                                            *((volatile unsigned char*)(0x42DE8680UL))
#define bFM4_GPIO_PDORD_P1                                            *((volatile unsigned char*)(0x42DE8684UL))
#define bFM4_GPIO_PDORD_P2                                            *((volatile unsigned char*)(0x42DE8688UL))
#define bFM4_GPIO_PDORD_P3                                            *((volatile unsigned char*)(0x42DE868CUL))
#define bFM4_GPIO_PDORD_P4                                            *((volatile unsigned char*)(0x42DE8690UL))
#define bFM4_GPIO_PDORD_P5                                            *((volatile unsigned char*)(0x42DE8694UL))
#define bFM4_GPIO_PDORD_P6                                            *((volatile unsigned char*)(0x42DE8698UL))
#define bFM4_GPIO_PDORD_P7                                            *((volatile unsigned char*)(0x42DE869CUL))
#define bFM4_GPIO_PDORD_P8                                            *((volatile unsigned char*)(0x42DE86A0UL))
#define bFM4_GPIO_PDORD_P9                                            *((volatile unsigned char*)(0x42DE86A4UL))
#define bFM4_GPIO_PDORD_PA                                            *((volatile unsigned char*)(0x42DE86A8UL))
#define bFM4_GPIO_PDORD_PB                                            *((volatile unsigned char*)(0x42DE86ACUL))
#define bFM4_GPIO_PDORD_PC                                            *((volatile unsigned char*)(0x42DE86B0UL))
#define bFM4_GPIO_PDORD_PD                                            *((volatile unsigned char*)(0x42DE86B4UL))
#define bFM4_GPIO_PDORE_P0                                            *((volatile unsigned char*)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P2                                            *((volatile unsigned char*)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P3                                            *((volatile unsigned char*)(0x42DE870CUL))
#define bFM4_GPIO_ADE_AN00                                            *((volatile unsigned char*)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN01                                            *((volatile unsigned char*)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN02                                            *((volatile unsigned char*)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN03                                            *((volatile unsigned char*)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN04                                            *((volatile unsigned char*)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN05                                            *((volatile unsigned char*)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN06                                            *((volatile unsigned char*)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN07                                            *((volatile unsigned char*)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN08                                            *((volatile unsigned char*)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN09                                            *((volatile unsigned char*)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN10                                            *((volatile unsigned char*)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN11                                            *((volatile unsigned char*)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN12                                            *((volatile unsigned char*)(0x42DEA030UL))
#define bFM4_GPIO_ADE_AN13                                            *((volatile unsigned char*)(0x42DEA034UL))
#define bFM4_GPIO_ADE_AN14                                            *((volatile unsigned char*)(0x42DEA038UL))
#define bFM4_GPIO_ADE_AN15                                            *((volatile unsigned char*)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN16                                            *((volatile unsigned char*)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN17                                            *((volatile unsigned char*)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN18                                            *((volatile unsigned char*)(0x42DEA048UL))
#define bFM4_GPIO_ADE_AN19                                            *((volatile unsigned char*)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN20                                            *((volatile unsigned char*)(0x42DEA050UL))
#define bFM4_GPIO_ADE_AN21                                            *((volatile unsigned char*)(0x42DEA054UL))
#define bFM4_GPIO_ADE_AN22                                            *((volatile unsigned char*)(0x42DEA058UL))
#define bFM4_GPIO_ADE_AN23                                            *((volatile unsigned char*)(0x42DEA05CUL))
#define bFM4_GPIO_ADE_AN24                                            *((volatile unsigned char*)(0x42DEA060UL))
#define bFM4_GPIO_ADE_AN25                                            *((volatile unsigned char*)(0x42DEA064UL))
#define bFM4_GPIO_ADE_AN26                                            *((volatile unsigned char*)(0x42DEA068UL))
#define bFM4_GPIO_ADE_AN27                                            *((volatile unsigned char*)(0x42DEA06CUL))
#define bFM4_GPIO_ADE_AN28                                            *((volatile unsigned char*)(0x42DEA070UL))
#define bFM4_GPIO_ADE_AN29                                            *((volatile unsigned char*)(0x42DEA074UL))
#define bFM4_GPIO_ADE_AN30                                            *((volatile unsigned char*)(0x42DEA078UL))
#define bFM4_GPIO_ADE_AN31                                            *((volatile unsigned char*)(0x42DEA07CUL))
#define bFM4_GPIO_SPSR_MAINXC0                                        *((volatile unsigned char*)(0x42DEB008UL))
#define bFM4_GPIO_SPSR_MAINXC1                                        *((volatile unsigned char*)(0x42DEB00CUL))
#define bFM4_GPIO_SPSR_USB0C                                          *((volatile unsigned char*)(0x42DEB010UL))
#define bFM4_GPIO_EPFR00_NMIS                                         *((volatile unsigned char*)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_CROUTE0                                      *((volatile unsigned char*)(0x42DEC004UL))
#define bFM4_GPIO_EPFR00_CROUTE1                                      *((volatile unsigned char*)(0x42DEC008UL))
#define bFM4_GPIO_EPFR00_RTCCOE0                                      *((volatile unsigned char*)(0x42DEC010UL))
#define bFM4_GPIO_EPFR00_RTCCOE1                                      *((volatile unsigned char*)(0x42DEC014UL))
#define bFM4_GPIO_EPFR00_SUBOUTE0                                     *((volatile unsigned char*)(0x42DEC018UL))
#define bFM4_GPIO_EPFR00_SUBOUTE1                                     *((volatile unsigned char*)(0x42DEC01CUL))
#define bFM4_GPIO_EPFR00_USBP0E                                       *((volatile unsigned char*)(0x42DEC024UL))
#define bFM4_GPIO_EPFR00_JTAGEN0B                                     *((volatile unsigned char*)(0x42DEC040UL))
#define bFM4_GPIO_EPFR00_JTAGEN1S                                     *((volatile unsigned char*)(0x42DEC044UL))
#define bFM4_GPIO_EPFR00_TRC0E                                        *((volatile unsigned char*)(0x42DEC060UL))
#define bFM4_GPIO_EPFR00_TRC1E                                        *((volatile unsigned char*)(0x42DEC064UL))
#define bFM4_GPIO_EPFR01_RTO00E0                                      *((volatile unsigned char*)(0x42DEC080UL))
#define bFM4_GPIO_EPFR01_RTO00E1                                      *((volatile unsigned char*)(0x42DEC084UL))
#define bFM4_GPIO_EPFR01_RTO01E0                                      *((volatile unsigned char*)(0x42DEC088UL))
#define bFM4_GPIO_EPFR01_RTO01E1                                      *((volatile unsigned char*)(0x42DEC08CUL))
#define bFM4_GPIO_EPFR01_RTO02E0                                      *((volatile unsigned char*)(0x42DEC090UL))
#define bFM4_GPIO_EPFR01_RTO02E1                                      *((volatile unsigned char*)(0x42DEC094UL))
#define bFM4_GPIO_EPFR01_RTO03E0                                      *((volatile unsigned char*)(0x42DEC098UL))
#define bFM4_GPIO_EPFR01_RTO03E1                                      *((volatile unsigned char*)(0x42DEC09CUL))
#define bFM4_GPIO_EPFR01_RTO04E0                                      *((volatile unsigned char*)(0x42DEC0A0UL))
#define bFM4_GPIO_EPFR01_RTO04E1                                      *((volatile unsigned char*)(0x42DEC0A4UL))
#define bFM4_GPIO_EPFR01_RTO05E0                                      *((volatile unsigned char*)(0x42DEC0A8UL))
#define bFM4_GPIO_EPFR01_RTO05E1                                      *((volatile unsigned char*)(0x42DEC0ACUL))
#define bFM4_GPIO_EPFR01_DTTI0C                                       *((volatile unsigned char*)(0x42DEC0B0UL))
#define bFM4_GPIO_EPFR01_DTTI0S0                                      *((volatile unsigned char*)(0x42DEC0C0UL))
#define bFM4_GPIO_EPFR01_DTTI0S1                                      *((volatile unsigned char*)(0x42DEC0C4UL))
#define bFM4_GPIO_EPFR01_FRCK0S0                                      *((volatile unsigned char*)(0x42DEC0C8UL))
#define bFM4_GPIO_EPFR01_FRCK0S1                                      *((volatile unsigned char*)(0x42DEC0CCUL))
#define bFM4_GPIO_EPFR01_IC00S0                                       *((volatile unsigned char*)(0x42DEC0D0UL))
#define bFM4_GPIO_EPFR01_IC00S1                                       *((volatile unsigned char*)(0x42DEC0D4UL))
#define bFM4_GPIO_EPFR01_IC00S2                                       *((volatile unsigned char*)(0x42DEC0D8UL))
#define bFM4_GPIO_EPFR01_IC01S0                                       *((volatile unsigned char*)(0x42DEC0DCUL))
#define bFM4_GPIO_EPFR01_IC01S1                                       *((volatile unsigned char*)(0x42DEC0E0UL))
#define bFM4_GPIO_EPFR01_IC01S2                                       *((volatile unsigned char*)(0x42DEC0E4UL))
#define bFM4_GPIO_EPFR01_IC02S0                                       *((volatile unsigned char*)(0x42DEC0E8UL))
#define bFM4_GPIO_EPFR01_IC02S1                                       *((volatile unsigned char*)(0x42DEC0ECUL))
#define bFM4_GPIO_EPFR01_IC02S2                                       *((volatile unsigned char*)(0x42DEC0F0UL))
#define bFM4_GPIO_EPFR01_IC03S0                                       *((volatile unsigned char*)(0x42DEC0F4UL))
#define bFM4_GPIO_EPFR01_IC03S1                                       *((volatile unsigned char*)(0x42DEC0F8UL))
#define bFM4_GPIO_EPFR01_IC03S2                                       *((volatile unsigned char*)(0x42DEC0FCUL))
#define bFM4_GPIO_EPFR04_TIOA0E0                                      *((volatile unsigned char*)(0x42DEC208UL))
#define bFM4_GPIO_EPFR04_TIOA0E1                                      *((volatile unsigned char*)(0x42DEC20CUL))
#define bFM4_GPIO_EPFR04_TIOB0S0                                      *((volatile unsigned char*)(0x42DEC210UL))
#define bFM4_GPIO_EPFR04_TIOB0S1                                      *((volatile unsigned char*)(0x42DEC214UL))
