MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_EPFR04_TIOB0S2                                      *((volatile unsigned char*)(0x42DEC218UL))
#define bFM4_GPIO_EPFR04_TIOA1S0                                      *((volatile unsigned char*)(0x42DEC220UL))
#define bFM4_GPIO_EPFR04_TIOA1S1                                      *((volatile unsigned char*)(0x42DEC224UL))
#define bFM4_GPIO_EPFR04_TIOA1E0                                      *((volatile unsigned char*)(0x42DEC228UL))
#define bFM4_GPIO_EPFR04_TIOA1E1                                      *((volatile unsigned char*)(0x42DEC22CUL))
#define bFM4_GPIO_EPFR04_TIOB1S0                                      *((volatile unsigned char*)(0x42DEC230UL))
#define bFM4_GPIO_EPFR04_TIOB1S1                                      *((volatile unsigned char*)(0x42DEC234UL))
#define bFM4_GPIO_EPFR04_TIOA2E0                                      *((volatile unsigned char*)(0x42DEC248UL))
#define bFM4_GPIO_EPFR04_TIOA2E1                                      *((volatile unsigned char*)(0x42DEC24CUL))
#define bFM4_GPIO_EPFR04_TIOB2S0                                      *((volatile unsigned char*)(0x42DEC250UL))
#define bFM4_GPIO_EPFR04_TIOB2S1                                      *((volatile unsigned char*)(0x42DEC254UL))
#define bFM4_GPIO_EPFR04_TIOA3S0                                      *((volatile unsigned char*)(0x42DEC260UL))
#define bFM4_GPIO_EPFR04_TIOA3S1                                      *((volatile unsigned char*)(0x42DEC264UL))
#define bFM4_GPIO_EPFR04_TIOA3E0                                      *((volatile unsigned char*)(0x42DEC268UL))
#define bFM4_GPIO_EPFR04_TIOA3E1                                      *((volatile unsigned char*)(0x42DEC26CUL))
#define bFM4_GPIO_EPFR04_TIOB3S0                                      *((volatile unsigned char*)(0x42DEC270UL))
#define bFM4_GPIO_EPFR04_TIOB3S1                                      *((volatile unsigned char*)(0x42DEC274UL))
#define bFM4_GPIO_EPFR05_TIOA4E0                                      *((volatile unsigned char*)(0x42DEC288UL))
#define bFM4_GPIO_EPFR05_TIOA4E1                                      *((volatile unsigned char*)(0x42DEC28CUL))
#define bFM4_GPIO_EPFR05_TIOB4S0                                      *((volatile unsigned char*)(0x42DEC290UL))
#define bFM4_GPIO_EPFR05_TIOB4S1                                      *((volatile unsigned char*)(0x42DEC294UL))
#define bFM4_GPIO_EPFR05_TIOA5S0                                      *((volatile unsigned char*)(0x42DEC2A0UL))
#define bFM4_GPIO_EPFR05_TIOA5S1                                      *((volatile unsigned char*)(0x42DEC2A4UL))
#define bFM4_GPIO_EPFR05_TIOA5E0                                      *((volatile unsigned char*)(0x42DEC2A8UL))
#define bFM4_GPIO_EPFR05_TIOA5E1                                      *((volatile unsigned char*)(0x42DEC2ACUL))
#define bFM4_GPIO_EPFR05_TIOB5S0                                      *((volatile unsigned char*)(0x42DEC2B0UL))
#define bFM4_GPIO_EPFR05_TIOB5S1                                      *((volatile unsigned char*)(0x42DEC2B4UL))
#define bFM4_GPIO_EPFR05_TIOA6E0                                      *((volatile unsigned char*)(0x42DEC2C8UL))
#define bFM4_GPIO_EPFR05_TIOA6E1                                      *((volatile unsigned char*)(0x42DEC2CCUL))
#define bFM4_GPIO_EPFR05_TIOB6S0                                      *((volatile unsigned char*)(0x42DEC2D0UL))
#define bFM4_GPIO_EPFR05_TIOB6S1                                      *((volatile unsigned char*)(0x42DEC2D4UL))
#define bFM4_GPIO_EPFR05_TIOA7S0                                      *((volatile unsigned char*)(0x42DEC2E0UL))
#define bFM4_GPIO_EPFR05_TIOA7S1                                      *((volatile unsigned char*)(0x42DEC2E4UL))
#define bFM4_GPIO_EPFR05_TIOA7E0                                      *((volatile unsigned char*)(0x42DEC2E8UL))
#define bFM4_GPIO_EPFR05_TIOA7E1                                      *((volatile unsigned char*)(0x42DEC2ECUL))
#define bFM4_GPIO_EPFR05_TIOB7S0                                      *((volatile unsigned char*)(0x42DEC2F0UL))
#define bFM4_GPIO_EPFR05_TIOB7S1                                      *((volatile unsigned char*)(0x42DEC2F4UL))
#define bFM4_GPIO_EPFR06_EINT00S0                                     *((volatile unsigned char*)(0x42DEC300UL))
#define bFM4_GPIO_EPFR06_EINT00S1                                     *((volatile unsigned char*)(0x42DEC304UL))
#define bFM4_GPIO_EPFR06_EINT01S0                                     *((volatile unsigned char*)(0x42DEC308UL))
#define bFM4_GPIO_EPFR06_EINT01S1                                     *((volatile unsigned char*)(0x42DEC30CUL))
#define bFM4_GPIO_EPFR06_EINT02S0                                     *((volatile unsigned char*)(0x42DEC310UL))
#define bFM4_GPIO_EPFR06_EINT02S1                                     *((volatile unsigned char*)(0x42DEC314UL))
#define bFM4_GPIO_EPFR06_EINT03S0                                     *((volatile unsigned char*)(0x42DEC318UL))
#define bFM4_GPIO_EPFR06_EINT03S1                                     *((volatile unsigned char*)(0x42DEC31CUL))
#define bFM4_GPIO_EPFR06_EINT04S0                                     *((volatile unsigned char*)(0x42DEC320UL))
#define bFM4_GPIO_EPFR06_EINT04S1                                     *((volatile unsigned char*)(0x42DEC324UL))
#define bFM4_GPIO_EPFR06_EINT05S0                                     *((volatile unsigned char*)(0x42DEC328UL))
#define bFM4_GPIO_EPFR06_EINT05S1                                     *((volatile unsigned char*)(0x42DEC32CUL))
#define bFM4_GPIO_EPFR06_EINT06S0                                     *((volatile unsigned char*)(0x42DEC330UL))
#define bFM4_GPIO_EPFR06_EINT06S1                                     *((volatile unsigned char*)(0x42DEC334UL))
#define bFM4_GPIO_EPFR06_EINT07S0                                     *((volatile unsigned char*)(0x42DEC338UL))
#define bFM4_GPIO_EPFR06_EINT07S1                                     *((volatile unsigned char*)(0x42DEC33CUL))
#define bFM4_GPIO_EPFR06_EINT08S0                                     *((volatile unsigned char*)(0x42DEC340UL))
#define bFM4_GPIO_EPFR06_EINT08S1                                     *((volatile unsigned char*)(0x42DEC344UL))
#define bFM4_GPIO_EPFR06_EINT09S0                                     *((volatile unsigned char*)(0x42DEC348UL))
#define bFM4_GPIO_EPFR06_EINT09S1                                     *((volatile unsigned char*)(0x42DEC34CUL))
#define bFM4_GPIO_EPFR06_EINT10S0                                     *((volatile unsigned char*)(0x42DEC350UL))
#define bFM4_GPIO_EPFR06_EINT10S1                                     *((volatile unsigned char*)(0x42DEC354UL))
#define bFM4_GPIO_EPFR06_EINT11S0                                     *((volatile unsigned char*)(0x42DEC358UL))
#define bFM4_GPIO_EPFR06_EINT11S1                                     *((volatile unsigned char*)(0x42DEC35CUL))
#define bFM4_GPIO_EPFR06_EINT12S0                                     *((volatile unsigned char*)(0x42DEC360UL))
#define bFM4_GPIO_EPFR06_EINT12S1                                     *((volatile unsigned char*)(0x42DEC364UL))
#define bFM4_GPIO_EPFR06_EINT13S0                                     *((volatile unsigned char*)(0x42DEC368UL))
#define bFM4_GPIO_EPFR06_EINT13S1                                     *((volatile unsigned char*)(0x42DEC36CUL))
#define bFM4_GPIO_EPFR06_EINT14S0                                     *((volatile unsigned char*)(0x42DEC370UL))
#define bFM4_GPIO_EPFR06_EINT14S1                                     *((volatile unsigned char*)(0x42DEC374UL))
#define bFM4_GPIO_EPFR06_EINT15S0                                     *((volatile unsigned char*)(0x42DEC378UL))
#define bFM4_GPIO_EPFR06_EINT15S1                                     *((volatile unsigned char*)(0x42DEC37CUL))
#define bFM4_GPIO_EPFR07_SIN0S0                                       *((volatile unsigned char*)(0x42DEC390UL))
#define bFM4_GPIO_EPFR07_SIN0S1                                       *((volatile unsigned char*)(0x42DEC394UL))
#define bFM4_GPIO_EPFR07_SOT0B0                                       *((volatile unsigned char*)(0x42DEC398UL))
#define bFM4_GPIO_EPFR07_SOT0B1                                       *((volatile unsigned char*)(0x42DEC39CUL))
#define bFM4_GPIO_EPFR07_SCK0B0                                       *((volatile unsigned char*)(0x42DEC3A0UL))
#define bFM4_GPIO_EPFR07_SCK0B1                                       *((volatile unsigned char*)(0x42DEC3A4UL))
#define bFM4_GPIO_EPFR07_SIN1S0                                       *((volatile unsigned char*)(0x42DEC3A8UL))
#define bFM4_GPIO_EPFR07_SIN1S1                                       *((volatile unsigned char*)(0x42DEC3ACUL))
#define bFM4_GPIO_EPFR07_SOT1B0                                       *((volatile unsigned char*)(0x42DEC3B0UL))
#define bFM4_GPIO_EPFR07_SOT1B1                                       *((volatile unsigned char*)(0x42DEC3B4UL))
#define bFM4_GPIO_EPFR07_SCK1B0                                       *((volatile unsigned char*)(0x42DEC3B8UL))
#define bFM4_GPIO_EPFR07_SCK1B1                                       *((volatile unsigned char*)(0x42DEC3BCUL))
#define bFM4_GPIO_EPFR07_SIN2S0                                       *((volatile unsigned char*)(0x42DEC3C0UL))
#define bFM4_GPIO_EPFR07_SIN2S1                                       *((volatile unsigned char*)(0x42DEC3C4UL))
#define bFM4_GPIO_EPFR07_SOT2B0                                       *((volatile unsigned char*)(0x42DEC3C8UL))
#define bFM4_GPIO_EPFR07_SOT2B1                                       *((volatile unsigned char*)(0x42DEC3CCUL))
#define bFM4_GPIO_EPFR07_SCK2B0                                       *((volatile unsigned char*)(0x42DEC3D0UL))
#define bFM4_GPIO_EPFR07_SCK2B1                                       *((volatile unsigned char*)(0x42DEC3D4UL))
#define bFM4_GPIO_EPFR07_SIN3S0                                       *((volatile unsigned char*)(0x42DEC3D8UL))
#define bFM4_GPIO_EPFR07_SIN3S1                                       *((volatile unsigned char*)(0x42DEC3DCUL))
#define bFM4_GPIO_EPFR07_SOT3B0                                       *((volatile unsigned char*)(0x42DEC3E0UL))
#define bFM4_GPIO_EPFR07_SOT3B1                                       *((volatile unsigned char*)(0x42DEC3E4UL))
#define bFM4_GPIO_EPFR07_SCK3B0                                       *((volatile unsigned char*)(0x42DEC3E8UL))
#define bFM4_GPIO_EPFR07_SCK3B1                                       *((volatile unsigned char*)(0x42DEC3ECUL))
#define bFM4_GPIO_EPFR08_RTS4E0                                       *((volatile unsigned char*)(0x42DEC400UL))
#define bFM4_GPIO_EPFR08_RTS4E1                                       *((volatile unsigned char*)(0x42DEC404UL))
#define bFM4_GPIO_EPFR08_CTS4S0                                       *((volatile unsigned char*)(0x42DEC408UL))
#define bFM4_GPIO_EPFR08_CTS4S1                                       *((volatile unsigned char*)(0x42DEC40CUL))
#define bFM4_GPIO_EPFR08_SIN4S0                                       *((volatile unsigned char*)(0x42DEC410UL))
#define bFM4_GPIO_EPFR08_SIN4S1                                       *((volatile unsigned char*)(0x42DEC414UL))
#define bFM4_GPIO_EPFR08_SOT4B0                                       *((volatile unsigned char*)(0x42DEC418UL))
#define bFM4_GPIO_EPFR08_SOT4B1                                       *((volatile unsigned char*)(0x42DEC41CUL))
#define bFM4_GPIO_EPFR08_SCK4B0                                       *((volatile unsigned char*)(0x42DEC420UL))
#define bFM4_GPIO_EPFR08_SCK4B1                                       *((volatile unsigned char*)(0x42DEC424UL))
#define bFM4_GPIO_EPFR08_SIN5S0                                       *((volatile unsigned char*)(0x42DEC428UL))
#define bFM4_GPIO_EPFR08_SIN5S1                                       *((volatile unsigned char*)(0x42DEC42CUL))
#define bFM4_GPIO_EPFR08_SOT5B0                                       *((volatile unsigned char*)(0x42DEC430UL))
#define bFM4_GPIO_EPFR08_SOT5B1                                       *((volatile unsigned char*)(0x42DEC434UL))
#define bFM4_GPIO_EPFR08_SCK5B0                                       *((volatile unsigned char*)(0x42DEC438UL))
#define bFM4_GPIO_EPFR08_SCK5B1                                       *((volatile unsigned char*)(0x42DEC43CUL))
#define bFM4_GPIO_EPFR08_SIN6S0                                       *((volatile unsigned char*)(0x42DEC440UL))
#define bFM4_GPIO_EPFR08_SIN6S1                                       *((volatile unsigned char*)(0x42DEC444UL))
#define bFM4_GPIO_EPFR08_SOT6B0                                       *((volatile unsigned char*)(0x42DEC448UL))
#define bFM4_GPIO_EPFR08_SOT6B1                                       *((volatile unsigned char*)(0x42DEC44CUL))
#define bFM4_GPIO_EPFR08_SCK6B0                                       *((volatile unsigned char*)(0x42DEC450UL))
#define bFM4_GPIO_EPFR08_SCK6B1                                       *((volatile unsigned char*)(0x42DEC454UL))
#define bFM4_GPIO_EPFR08_SIN7S0                                       *((volatile unsigned char*)(0x42DEC458UL))
#define bFM4_GPIO_EPFR08_SIN7S1                                       *((volatile unsigned char*)(0x42DEC45CUL))
#define bFM4_GPIO_EPFR08_SOT7B0                                       *((volatile unsigned char*)(0x42DEC460UL))
#define bFM4_GPIO_EPFR08_SOT7B1                                       *((volatile unsigned char*)(0x42DEC464UL))
#define bFM4_GPIO_EPFR08_SCK7B0                                       *((volatile unsigned char*)(0x42DEC468UL))
#define bFM4_GPIO_EPFR08_SCK7B1                                       *((volatile unsigned char*)(0x42DEC46CUL))
#define bFM4_GPIO_EPFR08_RTS5E0                                       *((volatile unsigned char*)(0x42DEC470UL))
#define bFM4_GPIO_EPFR08_RTS5E1                                       *((volatile unsigned char*)(0x42DEC474UL))
#define bFM4_GPIO_EPFR08_CTS5S0                                       *((volatile unsigned char*)(0x42DEC478UL))
#define bFM4_GPIO_EPFR08_CTS5S1                                       *((volatile unsigned char*)(0x42DEC47CUL))
#define bFM4_GPIO_EPFR09_QAIN0S0                                      *((volatile unsigned char*)(0x42DEC480UL))
#define bFM4_GPIO_EPFR09_QAIN0S1                                      *((volatile unsigned char*)(0x42DEC484UL))
#define bFM4_GPIO_EPFR09_QBIN0S0                                      *((volatile unsigned char*)(0x42DEC488UL))
#define bFM4_GPIO_EPFR09_QBIN0S1                                      *((volatile unsigned char*)(0x42DEC48CUL))
#define bFM4_GPIO_EPFR09_QZIN0S0                                      *((volatile unsigned char*)(0x42DEC490UL))
#define bFM4_GPIO_EPFR09_QZIN0S1                                      *((volatile unsigned char*)(0x42DEC494UL))
#define bFM4_GPIO_EPFR09_ADTRG0S0                                     *((volatile unsigned char*)(0x42DEC4B0UL))
#define bFM4_GPIO_EPFR09_ADTRG0S1                                     *((volatile unsigned char*)(0x42DEC4B4UL))
#define bFM4_GPIO_EPFR09_ADTRG0S2                                     *((volatile unsigned char*)(0x42DEC4B8UL))
#define bFM4_GPIO_EPFR09_ADTRG0S3                                     *((volatile unsigned char*)(0x42DEC4BCUL))
#define bFM4_GPIO_EPFR09_ADTRG1S0                                     *((volatile unsigned char*)(0x42DEC4C0UL))
#define bFM4_GPIO_EPFR09_ADTRG1S1                                     *((volatile unsigned char*)(0x42DEC4C4UL))
#define bFM4_GPIO_EPFR09_ADTRG1S2                                     *((volatile unsigned char*)(0x42DEC4C8UL))
#define bFM4_GPIO_EPFR09_ADTRG1S3                                     *((volatile unsigned char*)(0x42DEC4CCUL))
#define bFM4_GPIO_EPFR10_UEDEFB                                       *((volatile unsigned char*)(0x42DEC500UL))
#define bFM4_GPIO_EPFR10_UEDTHB                                       *((volatile unsigned char*)(0x42DEC504UL))
#define bFM4_GPIO_EPFR10_UECLKE                                       *((volatile unsigned char*)(0x42DEC508UL))
#define bFM4_GPIO_EPFR10_UEWEXE                                       *((volatile unsigned char*)(0x42DEC50CUL))
#define bFM4_GPIO_EPFR10_UEDQME                                       *((volatile unsigned char*)(0x42DEC510UL))
#define bFM4_GPIO_EPFR10_UEOEXE                                       *((volatile unsigned char*)(0x42DEC514UL))
#define bFM4_GPIO_EPFR10_UEFLSE                                       *((volatile unsigned char*)(0x42DEC518UL))
#define bFM4_GPIO_EPFR10_UEAOOE                                       *((volatile unsigned char*)(0x42DEC538UL))
#define bFM4_GPIO_EPFR10_UEA08E                                       *((volatile unsigned char*)(0x42DEC53CUL))
#define bFM4_GPIO_EPFR10_UEA09E                                       *((volatile unsigned char*)(0x42DEC540UL))
#define bFM4_GPIO_EPFR10_UEA10E                                       *((volatile unsigned char*)(0x42DEC544UL))
#define bFM4_GPIO_EPFR10_UEA11E                                       *((volatile unsigned char*)(0x42DEC548UL))
#define bFM4_GPIO_EPFR10_UEA12E                                       *((volatile unsigned char*)(0x42DEC54CUL))
#define bFM4_GPIO_EPFR10_UEA13E                                       *((volatile unsigned char*)(0x42DEC550UL))
#define bFM4_GPIO_EPFR10_UEA14E                                       *((volatile unsigned char*)(0x42DEC554UL))
#define bFM4_GPIO_EPFR10_UEA15E                                       *((volatile unsigned char*)(0x42DEC558UL))
#define bFM4_GPIO_EPFR10_UEA16E                                       *((volatile unsigned char*)(0x42DEC55CUL))
#define bFM4_GPIO_EPFR10_UEA17E                                       *((volatile unsigned char*)(0x42DEC560UL))
#define bFM4_GPIO_EPFR10_UEA18E                                       *((volatile unsigned char*)(0x42DEC564UL))
#define bFM4_GPIO_EPFR10_UEA19E                                       *((volatile unsigned char*)(0x42DEC568UL))
#define bFM4_GPIO_EPFR10_UEA20E                                       *((volatile unsigned char*)(0x42DEC56CUL))
#define bFM4_GPIO_EPFR10_UEA21E                                       *((volatile unsigned char*)(0x42DEC570UL))
#define bFM4_GPIO_EPFR10_UEA22E                                       *((volatile unsigned char*)(0x42DEC574UL))
#define bFM4_GPIO_EPFR10_UEA23E                                       *((volatile unsigned char*)(0x42DEC578UL))
#define bFM4_GPIO_EPFR10_UEA24E                                       *((volatile unsigned char*)(0x42DEC57CUL))
#define bFM4_GPIO_EPFR11_UEALEE                                       *((volatile unsigned char*)(0x42DEC580UL))
#define bFM4_GPIO_EPFR11_UECS0E                                       *((volatile unsigned char*)(0x42DEC584UL))
#define bFM4_GPIO_EPFR11_UEA01E                                       *((volatile unsigned char*)(0x42DEC588UL))
#define bFM4_GPIO_EPFR11_UEA02E                                       *((volatile unsigned char*)(0x42DEC58CUL))
#define bFM4_GPIO_EPFR11_UEA03E                                       *((volatile unsigned char*)(0x42DEC590UL))
#define bFM4_GPIO_EPFR11_UEA04E                                       *((volatile unsigned char*)(0x42DEC594UL))
#define bFM4_GPIO_EPFR11_UEA05E                                       *((volatile unsigned char*)(0x42DEC598UL))
#define bFM4_GPIO_EPFR11_UEA06E                                       *((volatile unsigned char*)(0x42DEC59CUL))
#define bFM4_GPIO_EPFR11_UEA07E                                       *((volatile unsigned char*)(0x42DEC5A0UL))
#define bFM4_GPIO_EPFR11_UED00B                                       *((volatile unsigned char*)(0x42DEC5A4UL))
#define bFM4_GPIO_EPFR11_UED01B                                       *((volatile unsigned char*)(0x42DEC5A8UL))
#define bFM4_GPIO_EPFR11_UED02B                                       *((volatile unsigned char*)(0x42DEC5ACUL))
#define bFM4_GPIO_EPFR11_UED03B                                       *((volatile unsigned char*)(0x42DEC5B0UL))
#define bFM4_GPIO_EPFR11_UED04B                                       *((volatile unsigned char*)(0x42DEC5B4UL))
#define bFM4_GPIO_EPFR11_UED05B                                       *((volatile unsigned char*)(0x42DEC5B8UL))
#define bFM4_GPIO_EPFR11_UED06B                                       *((volatile unsigned char*)(0x42DEC5BCUL))
#define bFM4_GPIO_EPFR11_UED07B                                       *((volatile unsigned char*)(0x42DEC5C0UL))
#define bFM4_GPIO_EPFR11_UED08B                                       *((volatile unsigned char*)(0x42DEC5C4UL))
#define bFM4_GPIO_EPFR11_UED09B                                       *((volatile unsigned char*)(0x42DEC5C8UL))
#define bFM4_GPIO_EPFR11_UED10B                                       *((volatile unsigned char*)(0x42DEC5CCUL))
#define bFM4_GPIO_EPFR11_UED11B                                       *((volatile unsigned char*)(0x42DEC5D0UL))
#define bFM4_GPIO_EPFR11_UED12B                                       *((volatile unsigned char*)(0x42DEC5D4UL))
#define bFM4_GPIO_EPFR11_UED13B                                       *((volatile unsigned char*)(0x42DEC5D8UL))
#define bFM4_GPIO_EPFR11_UED14B                                       *((volatile unsigned char*)(0x42DEC5DCUL))
#define bFM4_GPIO_EPFR11_UED15B                                       *((volatile unsigned char*)(0x42DEC5E0UL))
#define bFM4_GPIO_EPFR11_UERLC                                        *((volatile unsigned char*)(0x42DEC5E4UL))
#define bFM4_GPIO_EPFR16_SCS6B0                                       *((volatile unsigned char*)(0x42DEC800UL))
#define bFM4_GPIO_EPFR16_SCS6B1                                       *((volatile unsigned char*)(0x42DEC804UL))
#define bFM4_GPIO_EPFR16_SCS7B0                                       *((volatile unsigned char*)(0x42DEC808UL))
#define bFM4_GPIO_EPFR16_SCS7B1                                       *((volatile unsigned char*)(0x42DEC80CUL))
#define bFM4_GPIO_EPFR16_SFMPAC                                       *((volatile unsigned char*)(0x42DEC870UL))
#define bFM4_GPIO_EPFR16_SFMPBC                                       *((volatile unsigned char*)(0x42DEC874UL))
#define bFM4_GPIO_EPFR18_SDCLKE0                                      *((volatile unsigned char*)(0x42DEC938UL))
#define bFM4_GPIO_EPFR18_SDCLKE1                                      *((volatile unsigned char*)(0x42DEC93CUL))
#define bFM4_GPIO_EPFR18_SDCMDB0                                      *((volatile unsigned char*)(0x42DEC940UL))
#define bFM4_GPIO_EPFR18_SDCMDB1                                      *((volatile unsigned char*)(0x42DEC944UL))
#define bFM4_GPIO_EPFR18_SDDATA0B0                                    *((volatile unsigned char*)(0x42DEC948UL))
#define bFM4_GPIO_EPFR18_SDDATA0B1                                    *((volatile unsigned char*)(0x42DEC94CUL))
#define bFM4_GPIO_EPFR18_SDDATA1B0                                    *((volatile unsigned char*)(0x42DEC950UL))
#define bFM4_GPIO_EPFR18_SDDATA1B1                                    *((volatile unsigned char*)(0x42DEC954UL))
#define bFM4_GPIO_EPFR18_SDDATA2B0                                    *((volatile unsigned char*)(0x42DEC958UL))
#define bFM4_GPIO_EPFR18_SDDATA2B1                                    *((volatile unsigned char*)(0x42DEC95CUL))
#define bFM4_GPIO_EPFR18_SDDATA3B0                                    *((volatile unsigned char*)(0x42DEC960UL))
#define bFM4_GPIO_EPFR18_SDDATA3B1                                    *((volatile unsigned char*)(0x42DEC964UL))
#define bFM4_GPIO_EPFR18_SDCDS0                                       *((volatile unsigned char*)(0x42DEC968UL))
#define bFM4_GPIO_EPFR18_SDCDS1                                       *((volatile unsigned char*)(0x42DEC96CUL))
#define bFM4_GPIO_EPFR18_SDWPS0                                       *((volatile unsigned char*)(0x42DEC970UL))
#define bFM4_GPIO_EPFR18_SDWPS1                                       *((volatile unsigned char*)(0x42DEC974UL))
