MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_EPFR20_UESMCKE                                      *((volatile unsigned char*)(0x42DECA00UL))
#define bFM4_GPIO_EPFR20_UESMCEE                                      *((volatile unsigned char*)(0x42DECA04UL))
#define bFM4_GPIO_EPFR20_UERASE                                       *((volatile unsigned char*)(0x42DECA08UL))
#define bFM4_GPIO_EPFR20_UECASE                                       *((volatile unsigned char*)(0x42DECA0CUL))
#define bFM4_GPIO_EPFR20_UEDWEXE                                      *((volatile unsigned char*)(0x42DECA10UL))
#define bFM4_GPIO_EPFR20_UECSXE                                       *((volatile unsigned char*)(0x42DECA14UL))
#define bFM4_GPIO_EPFR23_SCS60E0                                      *((volatile unsigned char*)(0x42DECB80UL))
#define bFM4_GPIO_EPFR23_SCS60E1                                      *((volatile unsigned char*)(0x42DECB84UL))
#define bFM4_GPIO_EPFR23_SCS70E0                                      *((volatile unsigned char*)(0x42DECBA0UL))
#define bFM4_GPIO_EPFR23_SCS70E1                                      *((volatile unsigned char*)(0x42DECBA4UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S0                                *((volatile unsigned char*)(0x42DECC00UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S1                                *((volatile unsigned char*)(0x42DECC04UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E0                                *((volatile unsigned char*)(0x42DECC08UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E1                                *((volatile unsigned char*)(0x42DECC0CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B0                                 *((volatile unsigned char*)(0x42DECC10UL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B1                                 *((volatile unsigned char*)(0x42DECC14UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B0                                  *((volatile unsigned char*)(0x42DECC18UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B1                                  *((volatile unsigned char*)(0x42DECC1CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S0                                 *((volatile unsigned char*)(0x42DECC20UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S1                                 *((volatile unsigned char*)(0x42DECC24UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E0                                 *((volatile unsigned char*)(0x42DECC28UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E1                                 *((volatile unsigned char*)(0x42DECC2CUL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK1S0                                *((volatile unsigned char*)(0x42DECC40UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK1S1                                *((volatile unsigned char*)(0x42DECC44UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK1E0                                *((volatile unsigned char*)(0x42DECC48UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK1E1                                *((volatile unsigned char*)(0x42DECC4CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK1B0                                 *((volatile unsigned char*)(0x42DECC50UL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK1B1                                 *((volatile unsigned char*)(0x42DECC54UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS1B0                                  *((volatile unsigned char*)(0x42DECC58UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS1B1                                  *((volatile unsigned char*)(0x42DECC5CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI1S0                                 *((volatile unsigned char*)(0x42DECC60UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI1S1                                 *((volatile unsigned char*)(0x42DECC64UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO1E0                                 *((volatile unsigned char*)(0x42DECC68UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO1E1                                 *((volatile unsigned char*)(0x42DECC6CUL))
#define bFM4_GPIO_EPFR25_MCRX2S0                                      *((volatile unsigned char*)(0x42DECC80UL))
#define bFM4_GPIO_EPFR25_MCRX2S1                                      *((volatile unsigned char*)(0x42DECC84UL))
#define bFM4_GPIO_EPFR25_MCTX2E0                                      *((volatile unsigned char*)(0x42DECC88UL))
#define bFM4_GPIO_EPFR25_MCTX2E1                                      *((volatile unsigned char*)(0x42DECC8CUL))
#define bFM4_GPIO_EPFR26_Q_SCKB0                                      *((volatile unsigned char*)(0x42DECD00UL))
#define bFM4_GPIO_EPFR26_Q_SCKB1                                      *((volatile unsigned char*)(0x42DECD04UL))
#define bFM4_GPIO_EPFR26_Q_CS0E0                                      *((volatile unsigned char*)(0x42DECD08UL))
#define bFM4_GPIO_EPFR26_Q_CS0E1                                      *((volatile unsigned char*)(0x42DECD0CUL))
#define bFM4_GPIO_EPFR26_Q_IO0B0                                      *((volatile unsigned char*)(0x42DECD28UL))
#define bFM4_GPIO_EPFR26_Q_IO0B1                                      *((volatile unsigned char*)(0x42DECD2CUL))
#define bFM4_GPIO_EPFR26_Q_IO1B0                                      *((volatile unsigned char*)(0x42DECD30UL))
#define bFM4_GPIO_EPFR26_Q_IO1B1                                      *((volatile unsigned char*)(0x42DECD34UL))
#define bFM4_GPIO_EPFR26_Q_IO2B0                                      *((volatile unsigned char*)(0x42DECD38UL))
#define bFM4_GPIO_EPFR26_Q_IO2B1                                      *((volatile unsigned char*)(0x42DECD3CUL))
#define bFM4_GPIO_EPFR26_Q_IO3B0                                      *((volatile unsigned char*)(0x42DECD40UL))
#define bFM4_GPIO_EPFR26_Q_IO3B1                                      *((volatile unsigned char*)(0x42DECD44UL))
#define bFM4_GPIO_EPFR27_HBCKE0                                       *((volatile unsigned char*)(0x42DECD80UL))
#define bFM4_GPIO_EPFR27_HBCKE1                                       *((volatile unsigned char*)(0x42DECD84UL))
#define bFM4_GPIO_EPFR27_HBCSX_0E0                                    *((volatile unsigned char*)(0x42DECD88UL))
#define bFM4_GPIO_EPFR27_HBCSX_0E1                                    *((volatile unsigned char*)(0x42DECD8CUL))
#define bFM4_GPIO_EPFR27_HBCSX_1E0                                    *((volatile unsigned char*)(0x42DECD90UL))
#define bFM4_GPIO_EPFR27_HBCSX_1E1                                    *((volatile unsigned char*)(0x42DECD94UL))
#define bFM4_GPIO_EPFR27_HBRWDSB0                                     *((volatile unsigned char*)(0x42DECD98UL))
#define bFM4_GPIO_EPFR27_HBRWDSB1                                     *((volatile unsigned char*)(0x42DECD9CUL))
#define bFM4_GPIO_EPFR27_HBDQ0B0                                      *((volatile unsigned char*)(0x42DECDA0UL))
#define bFM4_GPIO_EPFR27_HBDQ0B1                                      *((volatile unsigned char*)(0x42DECDA4UL))
#define bFM4_GPIO_EPFR27_HBDQ1B0                                      *((volatile unsigned char*)(0x42DECDA8UL))
#define bFM4_GPIO_EPFR27_HBDQ1B1                                      *((volatile unsigned char*)(0x42DECDACUL))
#define bFM4_GPIO_EPFR27_HBDQ2B0                                      *((volatile unsigned char*)(0x42DECDB0UL))
#define bFM4_GPIO_EPFR27_HBDQ2B1                                      *((volatile unsigned char*)(0x42DECDB4UL))
#define bFM4_GPIO_EPFR27_HBDQ3B0                                      *((volatile unsigned char*)(0x42DECDB8UL))
#define bFM4_GPIO_EPFR27_HBDQ3B1                                      *((volatile unsigned char*)(0x42DECDBCUL))
#define bFM4_GPIO_EPFR27_HBDQ4B0                                      *((volatile unsigned char*)(0x42DECDC0UL))
#define bFM4_GPIO_EPFR27_HBDQ4B1                                      *((volatile unsigned char*)(0x42DECDC4UL))
#define bFM4_GPIO_EPFR27_HBDQ5B0                                      *((volatile unsigned char*)(0x42DECDC8UL))
#define bFM4_GPIO_EPFR27_HBDQ5B1                                      *((volatile unsigned char*)(0x42DECDCCUL))
#define bFM4_GPIO_EPFR27_HBDQ6B0                                      *((volatile unsigned char*)(0x42DECDD0UL))
#define bFM4_GPIO_EPFR27_HBDQ6B1                                      *((volatile unsigned char*)(0x42DECDD4UL))
#define bFM4_GPIO_EPFR27_HBDQ7B0                                      *((volatile unsigned char*)(0x42DECDD8UL))
#define bFM4_GPIO_EPFR27_HBDQ7B1                                      *((volatile unsigned char*)(0x42DECDDCUL))
#define bFM4_GPIO_EPFR27_HBWPXE0                                      *((volatile unsigned char*)(0x42DECDE0UL))
#define bFM4_GPIO_EPFR27_HBWPXE1                                      *((volatile unsigned char*)(0x42DECDE4UL))
#define bFM4_GPIO_EPFR27_HBRESETXE0                                   *((volatile unsigned char*)(0x42DECDE8UL))
#define bFM4_GPIO_EPFR27_HBRESETXE1                                   *((volatile unsigned char*)(0x42DECDECUL))
#define bFM4_GPIO_EPFR27_HBRSTOXS0                                    *((volatile unsigned char*)(0x42DECDF0UL))
#define bFM4_GPIO_EPFR27_HBRSTOXS1                                    *((volatile unsigned char*)(0x42DECDF4UL))
#define bFM4_GPIO_EPFR27_HBINTXS0                                     *((volatile unsigned char*)(0x42DECDF8UL))
#define bFM4_GPIO_EPFR27_HBINTXS1                                     *((volatile unsigned char*)(0x42DECDFCUL))
#define bFM4_GPIO_EPFR28_PNL_PD0E0                                    *((volatile unsigned char*)(0x42DECE00UL))
#define bFM4_GPIO_EPFR28_PNL_PD0E1                                    *((volatile unsigned char*)(0x42DECE04UL))
#define bFM4_GPIO_EPFR28_PNL_PD1E0                                    *((volatile unsigned char*)(0x42DECE08UL))
#define bFM4_GPIO_EPFR28_PNL_PD1E1                                    *((volatile unsigned char*)(0x42DECE0CUL))
#define bFM4_GPIO_EPFR28_PNL_PD2E0                                    *((volatile unsigned char*)(0x42DECE10UL))
#define bFM4_GPIO_EPFR28_PNL_PD2E1                                    *((volatile unsigned char*)(0x42DECE14UL))
#define bFM4_GPIO_EPFR28_PNL_PD3E0                                    *((volatile unsigned char*)(0x42DECE18UL))
#define bFM4_GPIO_EPFR28_PNL_PD3E1                                    *((volatile unsigned char*)(0x42DECE1CUL))
#define bFM4_GPIO_EPFR28_PNL_PD4E0                                    *((volatile unsigned char*)(0x42DECE20UL))
#define bFM4_GPIO_EPFR28_PNL_PD4E1                                    *((volatile unsigned char*)(0x42DECE24UL))
#define bFM4_GPIO_EPFR28_PNL_PD5E0                                    *((volatile unsigned char*)(0x42DECE28UL))
#define bFM4_GPIO_EPFR28_PNL_PD5E1                                    *((volatile unsigned char*)(0x42DECE2CUL))
#define bFM4_GPIO_EPFR28_PNL_PD6E0                                    *((volatile unsigned char*)(0x42DECE30UL))
#define bFM4_GPIO_EPFR28_PNL_PD6E1                                    *((volatile unsigned char*)(0x42DECE34UL))
#define bFM4_GPIO_EPFR28_PNL_PD7E0                                    *((volatile unsigned char*)(0x42DECE38UL))
#define bFM4_GPIO_EPFR28_PNL_PD7E1                                    *((volatile unsigned char*)(0x42DECE3CUL))
#define bFM4_GPIO_EPFR28_PNL_PD8E0                                    *((volatile unsigned char*)(0x42DECE40UL))
#define bFM4_GPIO_EPFR28_PNL_PD8E1                                    *((volatile unsigned char*)(0x42DECE44UL))
#define bFM4_GPIO_EPFR28_PNL_PD9E0                                    *((volatile unsigned char*)(0x42DECE48UL))
#define bFM4_GPIO_EPFR28_PNL_PD9E1                                    *((volatile unsigned char*)(0x42DECE4CUL))
#define bFM4_GPIO_EPFR28_PNL_PD10E0                                   *((volatile unsigned char*)(0x42DECE50UL))
#define bFM4_GPIO_EPFR28_PNL_PD10E1                                   *((volatile unsigned char*)(0x42DECE54UL))
#define bFM4_GPIO_EPFR28_PNL_PD11E0                                   *((volatile unsigned char*)(0x42DECE58UL))
#define bFM4_GPIO_EPFR28_PNL_PD11E1                                   *((volatile unsigned char*)(0x42DECE5CUL))
#define bFM4_GPIO_EPFR28_PNL_PD12E0                                   *((volatile unsigned char*)(0x42DECE60UL))
#define bFM4_GPIO_EPFR28_PNL_PD12E1                                   *((volatile unsigned char*)(0x42DECE64UL))
#define bFM4_GPIO_EPFR28_PNL_PD13E0                                   *((volatile unsigned char*)(0x42DECE68UL))
#define bFM4_GPIO_EPFR28_PNL_PD13E1                                   *((volatile unsigned char*)(0x42DECE6CUL))
#define bFM4_GPIO_EPFR28_PNL_PD14E0                                   *((volatile unsigned char*)(0x42DECE70UL))
#define bFM4_GPIO_EPFR28_PNL_PD14E1                                   *((volatile unsigned char*)(0x42DECE74UL))
#define bFM4_GPIO_EPFR28_PNL_PD15E0                                   *((volatile unsigned char*)(0x42DECE78UL))
#define bFM4_GPIO_EPFR28_PNL_PD15E1                                   *((volatile unsigned char*)(0x42DECE7CUL))
#define bFM4_GPIO_EPFR29_PNL_PD16E0                                   *((volatile unsigned char*)(0x42DECE80UL))
#define bFM4_GPIO_EPFR29_PNL_PD16E1                                   *((volatile unsigned char*)(0x42DECE84UL))
#define bFM4_GPIO_EPFR29_PNL_PD17E0                                   *((volatile unsigned char*)(0x42DECE88UL))
#define bFM4_GPIO_EPFR29_PNL_PD17E1                                   *((volatile unsigned char*)(0x42DECE8CUL))
#define bFM4_GPIO_EPFR29_PNL_PD18E0                                   *((volatile unsigned char*)(0x42DECE90UL))
#define bFM4_GPIO_EPFR29_PNL_PD18E1                                   *((volatile unsigned char*)(0x42DECE94UL))
#define bFM4_GPIO_EPFR29_PNL_PD19E0                                   *((volatile unsigned char*)(0x42DECE98UL))
#define bFM4_GPIO_EPFR29_PNL_PD19E1                                   *((volatile unsigned char*)(0x42DECE9CUL))
#define bFM4_GPIO_EPFR29_PNL_PD20E0                                   *((volatile unsigned char*)(0x42DECEA0UL))
#define bFM4_GPIO_EPFR29_PNL_PD20E1                                   *((volatile unsigned char*)(0x42DECEA4UL))
#define bFM4_GPIO_EPFR29_PNL_PD21E0                                   *((volatile unsigned char*)(0x42DECEA8UL))
#define bFM4_GPIO_EPFR29_PNL_PD21E1                                   *((volatile unsigned char*)(0x42DECEACUL))
#define bFM4_GPIO_EPFR29_PNL_PD22E0                                   *((volatile unsigned char*)(0x42DECEB0UL))
#define bFM4_GPIO_EPFR29_PNL_PD22E1                                   *((volatile unsigned char*)(0x42DECEB4UL))
#define bFM4_GPIO_EPFR29_PNL_PD23E0                                   *((volatile unsigned char*)(0x42DECEB8UL))
#define bFM4_GPIO_EPFR29_PNL_PD23E1                                   *((volatile unsigned char*)(0x42DECEBCUL))
#define bFM4_GPIO_EPFR29_PNL_TSIG5E0                                  *((volatile unsigned char*)(0x42DECEC8UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG5E1                                  *((volatile unsigned char*)(0x42DECECCUL))
#define bFM4_GPIO_EPFR29_PNL_TSIG6E0                                  *((volatile unsigned char*)(0x42DECED0UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG6E1                                  *((volatile unsigned char*)(0x42DECED4UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG7E0                                  *((volatile unsigned char*)(0x42DECED8UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG7E1                                  *((volatile unsigned char*)(0x42DECEDCUL))
#define bFM4_GPIO_EPFR29_PNL_TSIG8E0                                  *((volatile unsigned char*)(0x42DECEE0UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG8E1                                  *((volatile unsigned char*)(0x42DECEE4UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG9E0                                  *((volatile unsigned char*)(0x42DECEE8UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG9E1                                  *((volatile unsigned char*)(0x42DECEECUL))
#define bFM4_GPIO_EPFR29_PNL_TSIG10E0                                 *((volatile unsigned char*)(0x42DECEF0UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG10E1                                 *((volatile unsigned char*)(0x42DECEF4UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG11E0                                 *((volatile unsigned char*)(0x42DECEF8UL))
#define bFM4_GPIO_EPFR29_PNL_TSIG11E1                                 *((volatile unsigned char*)(0x42DECEFCUL))
#define bFM4_GPIO_EPFR30_PNL_PWEE0                                    *((volatile unsigned char*)(0x42DECF00UL))
#define bFM4_GPIO_EPFR30_PNL_PWEE1                                    *((volatile unsigned char*)(0x42DECF04UL))
#define bFM4_GPIO_EPFR30_PNL_DCLKE0                                   *((volatile unsigned char*)(0x42DECF08UL))
#define bFM4_GPIO_EPFR30_PNL_DCLKE1                                   *((volatile unsigned char*)(0x42DECF0CUL))
#define bFM4_GPIO_EPFR30_PNL_DENE0                                    *((volatile unsigned char*)(0x42DECF10UL))
#define bFM4_GPIO_EPFR30_PNL_DENE1                                    *((volatile unsigned char*)(0x42DECF14UL))
#define bFM4_GPIO_EPFR30_PNL_LEE0                                     *((volatile unsigned char*)(0x42DECF18UL))
#define bFM4_GPIO_EPFR30_PNL_LEE1                                     *((volatile unsigned char*)(0x42DECF1CUL))
#define bFM4_GPIO_EPFR30_PNL_FV_SYNCE0                                *((volatile unsigned char*)(0x42DECF20UL))
#define bFM4_GPIO_EPFR30_PNL_FV_SYNCE1                                *((volatile unsigned char*)(0x42DECF24UL))
#define bFM4_GPIO_EPFR30_PNL_LH_SYNCE0                                *((volatile unsigned char*)(0x42DECF28UL))
#define bFM4_GPIO_EPFR30_PNL_LH_SYNCE1                                *((volatile unsigned char*)(0x42DECF2CUL))
#define bFM4_GPIO_EPFR30_PNL_TSIG0E0                                  *((volatile unsigned char*)(0x42DECF40UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG0E1                                  *((volatile unsigned char*)(0x42DECF44UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG1E0                                  *((volatile unsigned char*)(0x42DECF48UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG1E1                                  *((volatile unsigned char*)(0x42DECF4CUL))
#define bFM4_GPIO_EPFR30_PNL_TSIG2E0                                  *((volatile unsigned char*)(0x42DECF50UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG2E1                                  *((volatile unsigned char*)(0x42DECF54UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG3E0                                  *((volatile unsigned char*)(0x42DECF58UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG3E1                                  *((volatile unsigned char*)(0x42DECF5CUL))
#define bFM4_GPIO_EPFR30_PNL_TSIG4E0                                  *((volatile unsigned char*)(0x42DECF60UL))
#define bFM4_GPIO_EPFR30_PNL_TSIG4E1                                  *((volatile unsigned char*)(0x42DECF64UL))
#define bFM4_GPIO_PZR0_P0                                             *((volatile unsigned char*)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P1                                             *((volatile unsigned char*)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P2                                             *((volatile unsigned char*)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P3                                             *((volatile unsigned char*)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P4                                             *((volatile unsigned char*)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P5                                             *((volatile unsigned char*)(0x42DEE014UL))
#define bFM4_GPIO_PZR0_P6                                             *((volatile unsigned char*)(0x42DEE018UL))
#define bFM4_GPIO_PZR0_P7                                             *((volatile unsigned char*)(0x42DEE01CUL))
#define bFM4_GPIO_PZR0_P8                                             *((volatile unsigned char*)(0x42DEE020UL))
#define bFM4_GPIO_PZR0_P9                                             *((volatile unsigned char*)(0x42DEE024UL))
#define bFM4_GPIO_PZR0_PA                                             *((volatile unsigned char*)(0x42DEE028UL))
#define bFM4_GPIO_PZR0_PB                                             *((volatile unsigned char*)(0x42DEE02CUL))
#define bFM4_GPIO_PZR0_PC                                             *((volatile unsigned char*)(0x42DEE030UL))
#define bFM4_GPIO_PZR0_PD                                             *((volatile unsigned char*)(0x42DEE034UL))
#define bFM4_GPIO_PZR0_PE                                             *((volatile unsigned char*)(0x42DEE038UL))
#define bFM4_GPIO_PZR1_P0                                             *((volatile unsigned char*)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P1                                             *((volatile unsigned char*)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P2                                             *((volatile unsigned char*)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P3                                             *((volatile unsigned char*)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P4                                             *((volatile unsigned char*)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P5                                             *((volatile unsigned char*)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P6                                             *((volatile unsigned char*)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P7                                             *((volatile unsigned char*)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P8                                             *((volatile unsigned char*)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P9                                             *((volatile unsigned char*)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_PA                                             *((volatile unsigned char*)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PB                                             *((volatile unsigned char*)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PC                                             *((volatile unsigned char*)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PD                                             *((volatile unsigned char*)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PE                                             *((volatile unsigned char*)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PF                                             *((volatile unsigned char*)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR2_P0                                             *((volatile unsigned char*)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P1                                             *((volatile unsigned char*)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P2                                             *((volatile unsigned char*)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P3                                             *((volatile unsigned char*)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P4                                             *((volatile unsigned char*)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P5                                             *((volatile unsigned char*)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P6                                             *((volatile unsigned char*)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P7                                             *((volatile unsigned char*)(0x42DEE11CUL))
#define bFM4_GPIO_PZR3_P3                                             *((volatile unsigned char*)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P4                                             *((volatile unsigned char*)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P5                                             *((volatile unsigned char*)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P6                                             *((volatile unsigned char*)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P7                                             *((volatile unsigned char*)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P8                                             *((volatile unsigned char*)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P9                                             *((volatile unsigned char*)(0x42DEE1A4UL))
