MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GPIO_PZR3_PA                                             *((volatile unsigned char*)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PB                                             *((volatile unsigned char*)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PC                                             *((volatile unsigned char*)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PD                                             *((volatile unsigned char*)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PE                                             *((volatile unsigned char*)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR3_PF                                             *((volatile unsigned char*)(0x42DEE1BCUL))
#define bFM4_GPIO_PZR4_P6                                             *((volatile unsigned char*)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P7                                             *((volatile unsigned char*)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P8                                             *((volatile unsigned char*)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P9                                             *((volatile unsigned char*)(0x42DEE224UL))
#define bFM4_GPIO_PZR5_P0                                             *((volatile unsigned char*)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P1                                             *((volatile unsigned char*)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P2                                             *((volatile unsigned char*)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P3                                             *((volatile unsigned char*)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P4                                             *((volatile unsigned char*)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P5                                             *((volatile unsigned char*)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P6                                             *((volatile unsigned char*)(0x42DEE298UL))
#define bFM4_GPIO_PZR6_P0                                             *((volatile unsigned char*)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P1                                             *((volatile unsigned char*)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P2                                             *((volatile unsigned char*)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P3                                             *((volatile unsigned char*)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P4                                             *((volatile unsigned char*)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P5                                             *((volatile unsigned char*)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P6                                             *((volatile unsigned char*)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P7                                             *((volatile unsigned char*)(0x42DEE31CUL))
#define bFM4_GPIO_PZR6_P8                                             *((volatile unsigned char*)(0x42DEE320UL))
#define bFM4_GPIO_PZR7_P0                                             *((volatile unsigned char*)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P1                                             *((volatile unsigned char*)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P2                                             *((volatile unsigned char*)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P3                                             *((volatile unsigned char*)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P4                                             *((volatile unsigned char*)(0x42DEE390UL))
#define bFM4_GPIO_PZR7_P5                                             *((volatile unsigned char*)(0x42DEE394UL))
#define bFM4_GPIO_PZR7_P6                                             *((volatile unsigned char*)(0x42DEE398UL))
#define bFM4_GPIO_PZR7_P7                                             *((volatile unsigned char*)(0x42DEE39CUL))
#define bFM4_GPIO_PZR7_P8                                             *((volatile unsigned char*)(0x42DEE3A0UL))
#define bFM4_GPIO_PZR7_P9                                             *((volatile unsigned char*)(0x42DEE3A4UL))
#define bFM4_GPIO_PZR7_PA                                             *((volatile unsigned char*)(0x42DEE3A8UL))
#define bFM4_GPIO_PZR7_PB                                             *((volatile unsigned char*)(0x42DEE3ACUL))
#define bFM4_GPIO_PZR7_PC                                             *((volatile unsigned char*)(0x42DEE3B0UL))
#define bFM4_GPIO_PZR8_P0                                             *((volatile unsigned char*)(0x42DEE400UL))
#define bFM4_GPIO_PZR8_P1                                             *((volatile unsigned char*)(0x42DEE404UL))
#define bFM4_GPIO_PZR9_P0                                             *((volatile unsigned char*)(0x42DEE480UL))
#define bFM4_GPIO_PZR9_P1                                             *((volatile unsigned char*)(0x42DEE484UL))
#define bFM4_GPIO_PZR9_P2                                             *((volatile unsigned char*)(0x42DEE488UL))
#define bFM4_GPIO_PZR9_P3                                             *((volatile unsigned char*)(0x42DEE48CUL))
#define bFM4_GPIO_PZR9_P4                                             *((volatile unsigned char*)(0x42DEE490UL))
#define bFM4_GPIO_PZR9_P5                                             *((volatile unsigned char*)(0x42DEE494UL))
#define bFM4_GPIO_PZR9_P6                                             *((volatile unsigned char*)(0x42DEE498UL))
#define bFM4_GPIO_PZR9_P7                                             *((volatile unsigned char*)(0x42DEE49CUL))
#define bFM4_GPIO_PZRA_P0                                             *((volatile unsigned char*)(0x42DEE500UL))
#define bFM4_GPIO_PZRA_P1                                             *((volatile unsigned char*)(0x42DEE504UL))
#define bFM4_GPIO_PZRA_P2                                             *((volatile unsigned char*)(0x42DEE508UL))
#define bFM4_GPIO_PZRA_P3                                             *((volatile unsigned char*)(0x42DEE50CUL))
#define bFM4_GPIO_PZRA_P4                                             *((volatile unsigned char*)(0x42DEE510UL))
#define bFM4_GPIO_PZRA_P5                                             *((volatile unsigned char*)(0x42DEE514UL))
#define bFM4_GPIO_PZRA_P6                                             *((volatile unsigned char*)(0x42DEE518UL))
#define bFM4_GPIO_PZRA_P7                                             *((volatile unsigned char*)(0x42DEE51CUL))
#define bFM4_GPIO_PZRA_P8                                             *((volatile unsigned char*)(0x42DEE520UL))
#define bFM4_GPIO_PZRA_P9                                             *((volatile unsigned char*)(0x42DEE524UL))
#define bFM4_GPIO_PZRA_PA                                             *((volatile unsigned char*)(0x42DEE528UL))
#define bFM4_GPIO_PZRA_PB                                             *((volatile unsigned char*)(0x42DEE52CUL))
#define bFM4_GPIO_PZRA_PC                                             *((volatile unsigned char*)(0x42DEE530UL))
#define bFM4_GPIO_PZRA_PD                                             *((volatile unsigned char*)(0x42DEE534UL))
#define bFM4_GPIO_PZRB_P0                                             *((volatile unsigned char*)(0x42DEE580UL))
#define bFM4_GPIO_PZRB_P1                                             *((volatile unsigned char*)(0x42DEE584UL))
#define bFM4_GPIO_PZRB_P2                                             *((volatile unsigned char*)(0x42DEE588UL))
#define bFM4_GPIO_PZRB_P3                                             *((volatile unsigned char*)(0x42DEE58CUL))
#define bFM4_GPIO_PZRB_P4                                             *((volatile unsigned char*)(0x42DEE590UL))
#define bFM4_GPIO_PZRB_P5                                             *((volatile unsigned char*)(0x42DEE594UL))
#define bFM4_GPIO_PZRB_P6                                             *((volatile unsigned char*)(0x42DEE598UL))
#define bFM4_GPIO_PZRB_P7                                             *((volatile unsigned char*)(0x42DEE59CUL))
#define bFM4_GPIO_PZRB_P8                                             *((volatile unsigned char*)(0x42DEE5A0UL))
#define bFM4_GPIO_PZRB_P9                                             *((volatile unsigned char*)(0x42DEE5A4UL))
#define bFM4_GPIO_PZRB_PA                                             *((volatile unsigned char*)(0x42DEE5A8UL))
#define bFM4_GPIO_PZRB_PB                                             *((volatile unsigned char*)(0x42DEE5ACUL))
#define bFM4_GPIO_PZRB_PC                                             *((volatile unsigned char*)(0x42DEE5B0UL))
#define bFM4_GPIO_PZRB_PD                                             *((volatile unsigned char*)(0x42DEE5B4UL))
#define bFM4_GPIO_PZRC_P0                                             *((volatile unsigned char*)(0x42DEE600UL))
#define bFM4_GPIO_PZRC_P1                                             *((volatile unsigned char*)(0x42DEE604UL))
#define bFM4_GPIO_PZRC_P2                                             *((volatile unsigned char*)(0x42DEE608UL))
#define bFM4_GPIO_PZRC_P3                                             *((volatile unsigned char*)(0x42DEE60CUL))
#define bFM4_GPIO_PZRC_P4                                             *((volatile unsigned char*)(0x42DEE610UL))
#define bFM4_GPIO_PZRC_P5                                             *((volatile unsigned char*)(0x42DEE614UL))
#define bFM4_GPIO_PZRC_P6                                             *((volatile unsigned char*)(0x42DEE618UL))
#define bFM4_GPIO_PZRC_P7                                             *((volatile unsigned char*)(0x42DEE61CUL))
#define bFM4_GPIO_PZRC_P8                                             *((volatile unsigned char*)(0x42DEE620UL))
#define bFM4_GPIO_PZRC_P9                                             *((volatile unsigned char*)(0x42DEE624UL))
#define bFM4_GPIO_PZRC_PA                                             *((volatile unsigned char*)(0x42DEE628UL))
#define bFM4_GPIO_PZRC_PB                                             *((volatile unsigned char*)(0x42DEE62CUL))
#define bFM4_GPIO_PZRC_PC                                             *((volatile unsigned char*)(0x42DEE630UL))
#define bFM4_GPIO_PZRC_PD                                             *((volatile unsigned char*)(0x42DEE634UL))
#define bFM4_GPIO_PZRD_P0                                             *((volatile unsigned char*)(0x42DEE680UL))
#define bFM4_GPIO_PZRD_P1                                             *((volatile unsigned char*)(0x42DEE684UL))
#define bFM4_GPIO_PZRD_P2                                             *((volatile unsigned char*)(0x42DEE688UL))
#define bFM4_GPIO_PZRD_P3                                             *((volatile unsigned char*)(0x42DEE68CUL))
#define bFM4_GPIO_PZRD_P4                                             *((volatile unsigned char*)(0x42DEE690UL))
#define bFM4_GPIO_PZRD_P5                                             *((volatile unsigned char*)(0x42DEE694UL))
#define bFM4_GPIO_PZRD_P6                                             *((volatile unsigned char*)(0x42DEE698UL))
#define bFM4_GPIO_PZRD_P7                                             *((volatile unsigned char*)(0x42DEE69CUL))
#define bFM4_GPIO_PZRD_P8                                             *((volatile unsigned char*)(0x42DEE6A0UL))
#define bFM4_GPIO_PZRD_P9                                             *((volatile unsigned char*)(0x42DEE6A4UL))
#define bFM4_GPIO_PZRD_PA                                             *((volatile unsigned char*)(0x42DEE6A8UL))
#define bFM4_GPIO_PZRD_PB                                             *((volatile unsigned char*)(0x42DEE6ACUL))
#define bFM4_GPIO_PZRD_PC                                             *((volatile unsigned char*)(0x42DEE6B0UL))
#define bFM4_GPIO_PZRD_PD                                             *((volatile unsigned char*)(0x42DEE6B4UL))
#define bFM4_GPIO_PZRE_P0                                             *((volatile unsigned char*)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P2                                             *((volatile unsigned char*)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P3                                             *((volatile unsigned char*)(0x42DEE70CUL))

