MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_CANFD_RXF0S_F0FL3                 *((volatile unsigned char*)(0x42E0148CUL))
#define bFM4_CANFD_RXF0S_F0FL4                 *((volatile unsigned char*)(0x42E01490UL))
#define bFM4_CANFD_RXF0S_F0FL5                 *((volatile unsigned char*)(0x42E01494UL))
#define bFM4_CANFD_RXF0S_F0FL6                 *((volatile unsigned char*)(0x42E01498UL))
#define bFM4_CANFD_RXF0S_F0GI0                 *((volatile unsigned char*)(0x42E014A0UL))
#define bFM4_CANFD_RXF0S_F0GI1                 *((volatile unsigned char*)(0x42E014A4UL))
#define bFM4_CANFD_RXF0S_F0GI2                 *((volatile unsigned char*)(0x42E014A8UL))
#define bFM4_CANFD_RXF0S_F0GI3                 *((volatile unsigned char*)(0x42E014ACUL))
#define bFM4_CANFD_RXF0S_F0GI4                 *((volatile unsigned char*)(0x42E014B0UL))
#define bFM4_CANFD_RXF0S_F0GI5                 *((volatile unsigned char*)(0x42E014B4UL))
#define bFM4_CANFD_RXF0S_F0PI0                 *((volatile unsigned char*)(0x42E014C0UL))
#define bFM4_CANFD_RXF0S_F0PI1                 *((volatile unsigned char*)(0x42E014C4UL))
#define bFM4_CANFD_RXF0S_F0PI2                 *((volatile unsigned char*)(0x42E014C8UL))
#define bFM4_CANFD_RXF0S_F0PI3                 *((volatile unsigned char*)(0x42E014CCUL))
#define bFM4_CANFD_RXF0S_F0PI4                 *((volatile unsigned char*)(0x42E014D0UL))
#define bFM4_CANFD_RXF0S_F0PI5                 *((volatile unsigned char*)(0x42E014D4UL))
#define bFM4_CANFD_RXF0S_F0F                   *((volatile unsigned char*)(0x42E014E0UL))
#define bFM4_CANFD_RXF0S_RF0L                  *((volatile unsigned char*)(0x42E014E4UL))
#define bFM4_CANFD_RXF0A_F0AI0                 *((volatile unsigned char*)(0x42E01500UL))
#define bFM4_CANFD_RXF0A_F0AI1                 *((volatile unsigned char*)(0x42E01504UL))
#define bFM4_CANFD_RXF0A_F0AI2                 *((volatile unsigned char*)(0x42E01508UL))
#define bFM4_CANFD_RXF0A_F0AI3                 *((volatile unsigned char*)(0x42E0150CUL))
#define bFM4_CANFD_RXF0A_F0AI4                 *((volatile unsigned char*)(0x42E01510UL))
#define bFM4_CANFD_RXF0A_F0AI5                 *((volatile unsigned char*)(0x42E01514UL))
#define bFM4_CANFD_RXBC_RBSA0                  *((volatile unsigned char*)(0x42E01588UL))
#define bFM4_CANFD_RXBC_RBSA1                  *((volatile unsigned char*)(0x42E0158CUL))
#define bFM4_CANFD_RXBC_RBSA2                  *((volatile unsigned char*)(0x42E01590UL))
#define bFM4_CANFD_RXBC_RBSA3                  *((volatile unsigned char*)(0x42E01594UL))
#define bFM4_CANFD_RXBC_RBSA4                  *((volatile unsigned char*)(0x42E01598UL))
#define bFM4_CANFD_RXBC_RBSA5                  *((volatile unsigned char*)(0x42E0159CUL))
#define bFM4_CANFD_RXBC_RBSA6                  *((volatile unsigned char*)(0x42E015A0UL))
#define bFM4_CANFD_RXBC_RBSA7                  *((volatile unsigned char*)(0x42E015A4UL))
#define bFM4_CANFD_RXBC_RBSA8                  *((volatile unsigned char*)(0x42E015A8UL))
#define bFM4_CANFD_RXBC_RBSA9                  *((volatile unsigned char*)(0x42E015ACUL))
#define bFM4_CANFD_RXBC_RBSA10                 *((volatile unsigned char*)(0x42E015B0UL))
#define bFM4_CANFD_RXBC_RBSA11                 *((volatile unsigned char*)(0x42E015B4UL))
#define bFM4_CANFD_RXBC_RBSA12                 *((volatile unsigned char*)(0x42E015B8UL))
#define bFM4_CANFD_RXBC_RBSA13                 *((volatile unsigned char*)(0x42E015BCUL))
#define bFM4_CANFD_RXF1C_F1SA0                 *((volatile unsigned char*)(0x42E01608UL))
#define bFM4_CANFD_RXF1C_F1SA1                 *((volatile unsigned char*)(0x42E0160CUL))
#define bFM4_CANFD_RXF1C_F1SA2                 *((volatile unsigned char*)(0x42E01610UL))
#define bFM4_CANFD_RXF1C_F1SA3                 *((volatile unsigned char*)(0x42E01614UL))
#define bFM4_CANFD_RXF1C_F1SA4                 *((volatile unsigned char*)(0x42E01618UL))
#define bFM4_CANFD_RXF1C_F1SA5                 *((volatile unsigned char*)(0x42E0161CUL))
#define bFM4_CANFD_RXF1C_F1SA6                 *((volatile unsigned char*)(0x42E01620UL))
#define bFM4_CANFD_RXF1C_F1SA7                 *((volatile unsigned char*)(0x42E01624UL))
#define bFM4_CANFD_RXF1C_F1SA8                 *((volatile unsigned char*)(0x42E01628UL))
#define bFM4_CANFD_RXF1C_F1SA9                 *((volatile unsigned char*)(0x42E0162CUL))
#define bFM4_CANFD_RXF1C_F1SA10                *((volatile unsigned char*)(0x42E01630UL))
#define bFM4_CANFD_RXF1C_F1SA11                *((volatile unsigned char*)(0x42E01634UL))
#define bFM4_CANFD_RXF1C_F1SA12                *((volatile unsigned char*)(0x42E01638UL))
#define bFM4_CANFD_RXF1C_F1SA13                *((volatile unsigned char*)(0x42E0163CUL))
#define bFM4_CANFD_RXF1C_F1S0                  *((volatile unsigned char*)(0x42E01640UL))
#define bFM4_CANFD_RXF1C_F1S1                  *((volatile unsigned char*)(0x42E01644UL))
#define bFM4_CANFD_RXF1C_F1S2                  *((volatile unsigned char*)(0x42E01648UL))
#define bFM4_CANFD_RXF1C_F1S3                  *((volatile unsigned char*)(0x42E0164CUL))
#define bFM4_CANFD_RXF1C_F1S4                  *((volatile unsigned char*)(0x42E01650UL))
#define bFM4_CANFD_RXF1C_F1S5                  *((volatile unsigned char*)(0x42E01654UL))
#define bFM4_CANFD_RXF1C_F1S6                  *((volatile unsigned char*)(0x42E01658UL))
#define bFM4_CANFD_RXF1C_F1WM0                 *((volatile unsigned char*)(0x42E01660UL))
#define bFM4_CANFD_RXF1C_F1WM1                 *((volatile unsigned char*)(0x42E01664UL))
#define bFM4_CANFD_RXF1C_F1WM2                 *((volatile unsigned char*)(0x42E01668UL))
#define bFM4_CANFD_RXF1C_F1WM3                 *((volatile unsigned char*)(0x42E0166CUL))
#define bFM4_CANFD_RXF1C_F1WM4                 *((volatile unsigned char*)(0x42E01670UL))
#define bFM4_CANFD_RXF1C_F1WM5                 *((volatile unsigned char*)(0x42E01674UL))
#define bFM4_CANFD_RXF1C_F1WM6                 *((volatile unsigned char*)(0x42E01678UL))
#define bFM4_CANFD_RXF1C_F1OM                  *((volatile unsigned char*)(0x42E0167CUL))
#define bFM4_CANFD_RXF1S_F1FL0                 *((volatile unsigned char*)(0x42E01680UL))
#define bFM4_CANFD_RXF1S_F1FL1                 *((volatile unsigned char*)(0x42E01684UL))
#define bFM4_CANFD_RXF1S_F1FL2                 *((volatile unsigned char*)(0x42E01688UL))
#define bFM4_CANFD_RXF1S_F1FL3                 *((volatile unsigned char*)(0x42E0168CUL))
#define bFM4_CANFD_RXF1S_F1FL4                 *((volatile unsigned char*)(0x42E01690UL))
#define bFM4_CANFD_RXF1S_F1FL5                 *((volatile unsigned char*)(0x42E01694UL))
#define bFM4_CANFD_RXF1S_F1FL6                 *((volatile unsigned char*)(0x42E01698UL))
#define bFM4_CANFD_RXF1S_F1GI0                 *((volatile unsigned char*)(0x42E016A0UL))
#define bFM4_CANFD_RXF1S_F1GI1                 *((volatile unsigned char*)(0x42E016A4UL))
#define bFM4_CANFD_RXF1S_F1GI2                 *((volatile unsigned char*)(0x42E016A8UL))
#define bFM4_CANFD_RXF1S_F1GI3                 *((volatile unsigned char*)(0x42E016ACUL))
#define bFM4_CANFD_RXF1S_F1GI4                 *((volatile unsigned char*)(0x42E016B0UL))
#define bFM4_CANFD_RXF1S_F1GI5                 *((volatile unsigned char*)(0x42E016B4UL))
#define bFM4_CANFD_RXF1S_F1PI0                 *((volatile unsigned char*)(0x42E016C0UL))
#define bFM4_CANFD_RXF1S_F1PI1                 *((volatile unsigned char*)(0x42E016C4UL))
#define bFM4_CANFD_RXF1S_F1PI2                 *((volatile unsigned char*)(0x42E016C8UL))
#define bFM4_CANFD_RXF1S_F1PI3                 *((volatile unsigned char*)(0x42E016CCUL))
#define bFM4_CANFD_RXF1S_F1PI4                 *((volatile unsigned char*)(0x42E016D0UL))
#define bFM4_CANFD_RXF1S_F1PI5                 *((volatile unsigned char*)(0x42E016D4UL))
#define bFM4_CANFD_RXF1S_F1F                   *((volatile unsigned char*)(0x42E016E0UL))
#define bFM4_CANFD_RXF1S_RF1L                  *((volatile unsigned char*)(0x42E016E4UL))
#define bFM4_CANFD_RXF1S_DMS0                  *((volatile unsigned char*)(0x42E016F8UL))
#define bFM4_CANFD_RXF1S_DMS1                  *((volatile unsigned char*)(0x42E016FCUL))
#define bFM4_CANFD_RXF1A_F1AI0                 *((volatile unsigned char*)(0x42E01700UL))
#define bFM4_CANFD_RXF1A_F1AI1                 *((volatile unsigned char*)(0x42E01704UL))
#define bFM4_CANFD_RXF1A_F1AI2                 *((volatile unsigned char*)(0x42E01708UL))
#define bFM4_CANFD_RXF1A_F1AI3                 *((volatile unsigned char*)(0x42E0170CUL))
#define bFM4_CANFD_RXF1A_F1AI4                 *((volatile unsigned char*)(0x42E01710UL))
#define bFM4_CANFD_RXF1A_F1AI5                 *((volatile unsigned char*)(0x42E01714UL))
#define bFM4_CANFD_RXESC_F0DS0                 *((volatile unsigned char*)(0x42E01780UL))
#define bFM4_CANFD_RXESC_F0DS1                 *((volatile unsigned char*)(0x42E01784UL))
#define bFM4_CANFD_RXESC_F0DS2                 *((volatile unsigned char*)(0x42E01788UL))
#define bFM4_CANFD_RXESC_F1DS0                 *((volatile unsigned char*)(0x42E01790UL))
#define bFM4_CANFD_RXESC_F1DS1                 *((volatile unsigned char*)(0x42E01794UL))
#define bFM4_CANFD_RXESC_F1DS2                 *((volatile unsigned char*)(0x42E01798UL))
#define bFM4_CANFD_RXESC_RBDS0                 *((volatile unsigned char*)(0x42E017A0UL))
#define bFM4_CANFD_RXESC_RBDS1                 *((volatile unsigned char*)(0x42E017A4UL))
#define bFM4_CANFD_RXESC_RBDS2                 *((volatile unsigned char*)(0x42E017A8UL))
#define bFM4_CANFD_TXBC_TBSA0                  *((volatile unsigned char*)(0x42E01808UL))
#define bFM4_CANFD_TXBC_TBSA1                  *((volatile unsigned char*)(0x42E0180CUL))
#define bFM4_CANFD_TXBC_TBSA2                  *((volatile unsigned char*)(0x42E01810UL))
#define bFM4_CANFD_TXBC_TBSA3                  *((volatile unsigned char*)(0x42E01814UL))
#define bFM4_CANFD_TXBC_TBSA4                  *((volatile unsigned char*)(0x42E01818UL))
#define bFM4_CANFD_TXBC_TBSA5                  *((volatile unsigned char*)(0x42E0181CUL))
#define bFM4_CANFD_TXBC_TBSA6                  *((volatile unsigned char*)(0x42E01820UL))
#define bFM4_CANFD_TXBC_TBSA7                  *((volatile unsigned char*)(0x42E01824UL))
#define bFM4_CANFD_TXBC_TBSA8                  *((volatile unsigned char*)(0x42E01828UL))
#define bFM4_CANFD_TXBC_TBSA9                  *((volatile unsigned char*)(0x42E0182CUL))
#define bFM4_CANFD_TXBC_TBSA10                 *((volatile unsigned char*)(0x42E01830UL))
#define bFM4_CANFD_TXBC_TBSA11                 *((volatile unsigned char*)(0x42E01834UL))
#define bFM4_CANFD_TXBC_TBSA12                 *((volatile unsigned char*)(0x42E01838UL))
#define bFM4_CANFD_TXBC_TBSA13                 *((volatile unsigned char*)(0x42E0183CUL))
#define bFM4_CANFD_TXBC_NDTB0                  *((volatile unsigned char*)(0x42E01840UL))
#define bFM4_CANFD_TXBC_NDTB1                  *((volatile unsigned char*)(0x42E01844UL))
#define bFM4_CANFD_TXBC_NDTB2                  *((volatile unsigned char*)(0x42E01848UL))
#define bFM4_CANFD_TXBC_NDTB3                  *((volatile unsigned char*)(0x42E0184CUL))
#define bFM4_CANFD_TXBC_NDTB4                  *((volatile unsigned char*)(0x42E01850UL))
#define bFM4_CANFD_TXBC_NDTB5                  *((volatile unsigned char*)(0x42E01854UL))
#define bFM4_CANFD_TXBC_TFQS0                  *((volatile unsigned char*)(0x42E01860UL))
#define bFM4_CANFD_TXBC_TFQS1                  *((volatile unsigned char*)(0x42E01864UL))
#define bFM4_CANFD_TXBC_TFQS2                  *((volatile unsigned char*)(0x42E01868UL))
#define bFM4_CANFD_TXBC_TFQS3                  *((volatile unsigned char*)(0x42E0186CUL))
#define bFM4_CANFD_TXBC_TFQS4                  *((volatile unsigned char*)(0x42E01870UL))
#define bFM4_CANFD_TXBC_TFQS5                  *((volatile unsigned char*)(0x42E01874UL))
#define bFM4_CANFD_TXBC_TFQM                   *((volatile unsigned char*)(0x42E01878UL))
#define bFM4_CANFD_TXFQS_TFFL0                 *((volatile unsigned char*)(0x42E01880UL))
#define bFM4_CANFD_TXFQS_TFFL1                 *((volatile unsigned char*)(0x42E01884UL))
#define bFM4_CANFD_TXFQS_TFFL2                 *((volatile unsigned char*)(0x42E01888UL))
#define bFM4_CANFD_TXFQS_TFFL3                 *((volatile unsigned char*)(0x42E0188CUL))
#define bFM4_CANFD_TXFQS_TFFL4                 *((volatile unsigned char*)(0x42E01890UL))
#define bFM4_CANFD_TXFQS_TFFL5                 *((volatile unsigned char*)(0x42E01894UL))
#define bFM4_CANFD_TXFQS_TFGI0                 *((volatile unsigned char*)(0x42E018A0UL))
#define bFM4_CANFD_TXFQS_TFGI1                 *((volatile unsigned char*)(0x42E018A4UL))
#define bFM4_CANFD_TXFQS_TFGI2                 *((volatile unsigned char*)(0x42E018A8UL))
#define bFM4_CANFD_TXFQS_TFGI3                 *((volatile unsigned char*)(0x42E018ACUL))
#define bFM4_CANFD_TXFQS_TFGI4                 *((volatile unsigned char*)(0x42E018B0UL))
#define bFM4_CANFD_TXFQS_TFQPI0                *((volatile unsigned char*)(0x42E018C0UL))
#define bFM4_CANFD_TXFQS_TFQPI1                *((volatile unsigned char*)(0x42E018C4UL))
#define bFM4_CANFD_TXFQS_TFQPI2                *((volatile unsigned char*)(0x42E018C8UL))
#define bFM4_CANFD_TXFQS_TFQPI3                *((volatile unsigned char*)(0x42E018CCUL))
#define bFM4_CANFD_TXFQS_TFQPI4                *((volatile unsigned char*)(0x42E018D0UL))
#define bFM4_CANFD_TXFQS_TFQF                  *((volatile unsigned char*)(0x42E018D4UL))
#define bFM4_CANFD_TXESC_TBDS0                 *((volatile unsigned char*)(0x42E01900UL))
#define bFM4_CANFD_TXESC_TBDS1                 *((volatile unsigned char*)(0x42E01904UL))
#define bFM4_CANFD_TXESC_TBDS2                 *((volatile unsigned char*)(0x42E01908UL))
#define bFM4_CANFD_TXBRP_TRP0                  *((volatile unsigned char*)(0x42E01980UL))
#define bFM4_CANFD_TXBRP_TRP1                  *((volatile unsigned char*)(0x42E01984UL))
#define bFM4_CANFD_TXBRP_TRP2                  *((volatile unsigned char*)(0x42E01988UL))
#define bFM4_CANFD_TXBRP_TRP3                  *((volatile unsigned char*)(0x42E0198CUL))
#define bFM4_CANFD_TXBRP_TRP4                  *((volatile unsigned char*)(0x42E01990UL))
#define bFM4_CANFD_TXBRP_TRP5                  *((volatile unsigned char*)(0x42E01994UL))
#define bFM4_CANFD_TXBRP_TRP6                  *((volatile unsigned char*)(0x42E01998UL))
#define bFM4_CANFD_TXBRP_TRP7                  *((volatile unsigned char*)(0x42E0199CUL))
#define bFM4_CANFD_TXBRP_TRP8                  *((volatile unsigned char*)(0x42E019A0UL))
#define bFM4_CANFD_TXBRP_TRP9                  *((volatile unsigned char*)(0x42E019A4UL))
#define bFM4_CANFD_TXBRP_TRP10                 *((volatile unsigned char*)(0x42E019A8UL))
#define bFM4_CANFD_TXBRP_TRP11                 *((volatile unsigned char*)(0x42E019ACUL))
#define bFM4_CANFD_TXBRP_TRP12                 *((volatile unsigned char*)(0x42E019B0UL))
#define bFM4_CANFD_TXBRP_TRP13                 *((volatile unsigned char*)(0x42E019B4UL))
#define bFM4_CANFD_TXBRP_TRP14                 *((volatile unsigned char*)(0x42E019B8UL))
#define bFM4_CANFD_TXBRP_TRP15                 *((volatile unsigned char*)(0x42E019BCUL))
#define bFM4_CANFD_TXBRP_TRP16                 *((volatile unsigned char*)(0x42E019C0UL))
#define bFM4_CANFD_TXBRP_TRP17                 *((volatile unsigned char*)(0x42E019C4UL))
#define bFM4_CANFD_TXBRP_TRP18                 *((volatile unsigned char*)(0x42E019C8UL))
#define bFM4_CANFD_TXBRP_TRP19                 *((volatile unsigned char*)(0x42E019CCUL))
#define bFM4_CANFD_TXBRP_TRP20                 *((volatile unsigned char*)(0x42E019D0UL))
#define bFM4_CANFD_TXBRP_TRP21                 *((volatile unsigned char*)(0x42E019D4UL))
#define bFM4_CANFD_TXBRP_TRP22                 *((volatile unsigned char*)(0x42E019D8UL))
#define bFM4_CANFD_TXBRP_TRP23                 *((volatile unsigned char*)(0x42E019DCUL))
#define bFM4_CANFD_TXBRP_TRP24                 *((volatile unsigned char*)(0x42E019E0UL))
#define bFM4_CANFD_TXBRP_TRP25                 *((volatile unsigned char*)(0x42E019E4UL))
#define bFM4_CANFD_TXBRP_TRP26                 *((volatile unsigned char*)(0x42E019E8UL))
#define bFM4_CANFD_TXBRP_TRP27                 *((volatile unsigned char*)(0x42E019ECUL))
#define bFM4_CANFD_TXBRP_TRP28                 *((volatile unsigned char*)(0x42E019F0UL))
#define bFM4_CANFD_TXBRP_TRP29                 *((volatile unsigned char*)(0x42E019F4UL))
#define bFM4_CANFD_TXBRP_TRP30                 *((volatile unsigned char*)(0x42E019F8UL))
#define bFM4_CANFD_TXBRP_TRP31                 *((volatile unsigned char*)(0x42E019FCUL))
#define bFM4_CANFD_TXBAR_AR0                   *((volatile unsigned char*)(0x42E01A00UL))
#define bFM4_CANFD_TXBAR_AR1                   *((volatile unsigned char*)(0x42E01A04UL))
#define bFM4_CANFD_TXBAR_AR2                   *((volatile unsigned char*)(0x42E01A08UL))
#define bFM4_CANFD_TXBAR_AR3                   *((volatile unsigned char*)(0x42E01A0CUL))
#define bFM4_CANFD_TXBAR_AR4                   *((volatile unsigned char*)(0x42E01A10UL))
#define bFM4_CANFD_TXBAR_AR5                   *((volatile unsigned char*)(0x42E01A14UL))
#define bFM4_CANFD_TXBAR_AR6                   *((volatile unsigned char*)(0x42E01A18UL))
#define bFM4_CANFD_TXBAR_AR7                   *((volatile unsigned char*)(0x42E01A1CUL))
#define bFM4_CANFD_TXBAR_AR8                   *((volatile unsigned char*)(0x42E01A20UL))
#define bFM4_CANFD_TXBAR_AR9                   *((volatile unsigned char*)(0x42E01A24UL))
#define bFM4_CANFD_TXBAR_AR10                  *((volatile unsigned char*)(0x42E01A28UL))
#define bFM4_CANFD_TXBAR_AR11                  *((volatile unsigned char*)(0x42E01A2CUL))
#define bFM4_CANFD_TXBAR_AR12                  *((volatile unsigned char*)(0x42E01A30UL))
#define bFM4_CANFD_TXBAR_AR13                  *((volatile unsigned char*)(0x42E01A34UL))
#define bFM4_CANFD_TXBAR_AR14                  *((volatile unsigned char*)(0x42E01A38UL))
#define bFM4_CANFD_TXBAR_AR15                  *((volatile unsigned char*)(0x42E01A3CUL))
#define bFM4_CANFD_TXBAR_AR16                  *((volatile unsigned char*)(0x42E01A40UL))
#define bFM4_CANFD_TXBAR_AR17                  *((volatile unsigned char*)(0x42E01A44UL))
#define bFM4_CANFD_TXBAR_AR18                  *((volatile unsigned char*)(0x42E01A48UL))
#define bFM4_CANFD_TXBAR_AR19                  *((volatile unsigned char*)(0x42E01A4CUL))
#define bFM4_CANFD_TXBAR_AR20                  *((volatile unsigned char*)(0x42E01A50UL))
#define bFM4_CANFD_TXBAR_AR21                  *((volatile unsigned char*)(0x42E01A54UL))
#define bFM4_CANFD_TXBAR_AR22                  *((volatile unsigned char*)(0x42E01A58UL))
#define bFM4_CANFD_TXBAR_AR23                  *((volatile unsigned char*)(0x42E01A5CUL))
#define bFM4_CANFD_TXBAR_AR24                  *((volatile unsigned char*)(0x42E01A60UL))
#define bFM4_CANFD_TXBAR_AR25                  *((volatile unsigned char*)(0x42E01A64UL))
#define bFM4_CANFD_TXBAR_AR26                  *((volatile unsigned char*)(0x42E01A68UL))
#define bFM4_CANFD_TXBAR_AR27                  *((volatile unsigned char*)(0x42E01A6CUL))
#define bFM4_CANFD_TXBAR_AR28                  *((volatile unsigned char*)(0x42E01A70UL))
#define bFM4_CANFD_TXBAR_AR29                  *((volatile unsigned char*)(0x42E01A74UL))
#define bFM4_CANFD_TXBAR_AR30                  *((volatile unsigned char*)(0x42E01A78UL))
#define bFM4_CANFD_TXBAR_AR31                  *((volatile unsigned char*)(0x42E01A7CUL))
#define bFM4_CANFD_TXBCR_CR0                   *((volatile unsigned char*)(0x42E01A80UL))
#define bFM4_CANFD_TXBCR_CR1                   *((volatile unsigned char*)(0x42E01A84UL))
#define bFM4_CANFD_TXBCR_CR2                   *((volatile unsigned char*)(0x42E01A88UL))
#define bFM4_CANFD_TXBCR_CR3                   *((volatile unsigned char*)(0x42E01A8CUL))
#define bFM4_CANFD_TXBCR_CR4                   *((volatile unsigned char*)(0x42E01A90UL))
#define bFM4_CANFD_TXBCR_CR5                   *((volatile unsigned char*)(0x42E01A94UL))
#define bFM4_CANFD_TXBCR_CR6                   *((volatile unsigned char*)(0x42E01A98UL))
#define bFM4_CANFD_TXBCR_CR7                   *((volatile unsigned char*)(0x42E01A9CUL))
#define bFM4_CANFD_TXBCR_CR8                   *((volatile unsigned char*)(0x42E01AA0UL))
#define bFM4_CANFD_TXBCR_CR9                   *((volatile unsigned char*)(0x42E01AA4UL))
#define bFM4_CANFD_TXBCR_CR10                  *((volatile unsigned char*)(0x42E01AA8UL))
#define bFM4_CANFD_TXBCR_CR11                  *((volatile unsigned char*)(0x42E01AACUL))
#define bFM4_CANFD_TXBCR_CR12                  *((volatile unsigned char*)(0x42E01AB0UL))
#define bFM4_CANFD_TXBCR_CR13                  *((volatile unsigned char*)(0x42E01AB4UL))
#define bFM4_CANFD_TXBCR_CR14                  *((volatile unsigned char*)(0x42E01AB8UL))
#define bFM4_CANFD_TXBCR_CR15                  *((volatile unsigned char*)(0x42E01ABCUL))
#define bFM4_CANFD_TXBCR_CR16                  *((volatile unsigned char*)(0x42E01AC0UL))
#define bFM4_CANFD_TXBCR_CR17                  *((volatile unsigned char*)(0x42E01AC4UL))
#define bFM4_CANFD_TXBCR_CR18                  *((volatile unsigned char*)(0x42E01AC8UL))
#define bFM4_CANFD_TXBCR_CR19                  *((volatile unsigned char*)(0x42E01ACCUL))
#define bFM4_CANFD_TXBCR_CR20                  *((volatile unsigned char*)(0x42E01AD0UL))
#define bFM4_CANFD_TXBCR_CR21                  *((volatile unsigned char*)(0x42E01AD4UL))
#define bFM4_CANFD_TXBCR_CR22                  *((volatile unsigned char*)(0x42E01AD8UL))
#define bFM4_CANFD_TXBCR_CR23                  *((volatile unsigned char*)(0x42E01ADCUL))
#define bFM4_CANFD_TXBCR_CR24                  *((volatile unsigned char*)(0x42E01AE0UL))
#define bFM4_CANFD_TXBCR_CR25                  *((volatile unsigned char*)(0x42E01AE4UL))
#define bFM4_CANFD_TXBCR_CR26                  *((volatile unsigned char*)(0x42E01AE8UL))
#define bFM4_CANFD_TXBCR_CR27                  *((volatile unsigned char*)(0x42E01AECUL))
#define bFM4_CANFD_TXBCR_CR28                  *((volatile unsigned char*)(0x42E01AF0UL))
#define bFM4_CANFD_TXBCR_CR29                  *((volatile unsigned char*)(0x42E01AF4UL))
#define bFM4_CANFD_TXBCR_CR30                  *((volatile unsigned char*)(0x42E01AF8UL))
#define bFM4_CANFD_TXBCR_CR31                  *((volatile unsigned char*)(0x42E01AFCUL))
#define bFM4_CANFD_TXBTO_TO0                   *((volatile unsigned char*)(0x42E01B00UL))
#define bFM4_CANFD_TXBTO_TO1                   *((volatile unsigned char*)(0x42E01B04UL))
#define bFM4_CANFD_TXBTO_TO2                   *((volatile unsigned char*)(0x42E01B08UL))
#define bFM4_CANFD_TXBTO_TO3                   *((volatile unsigned char*)(0x42E01B0CUL))
#define bFM4_CANFD_TXBTO_TO4                   *((volatile unsigned char*)(0x42E01B10UL))
#define bFM4_CANFD_TXBTO_TO5                   *((volatile unsigned char*)(0x42E01B14UL))
#define bFM4_CANFD_TXBTO_TO6                   *((volatile unsigned char*)(0x42E01B18UL))
#define bFM4_CANFD_TXBTO_TO7                   *((volatile unsigned char*)(0x42E01B1CUL))
#define bFM4_CANFD_TXBTO_TO8                   *((volatile unsigned char*)(0x42E01B20UL))
#define bFM4_CANFD_TXBTO_TO9                   *((volatile unsigned char*)(0x42E01B24UL))
#define bFM4_CANFD_TXBTO_TO10                  *((volatile unsigned char*)(0x42E01B28UL))
#define bFM4_CANFD_TXBTO_TO11                  *((volatile unsigned char*)(0x42E01B2CUL))
#define bFM4_CANFD_TXBTO_TO12                  *((volatile unsigned char*)(0x42E01B30UL))
#define bFM4_CANFD_TXBTO_TO13                  *((volatile unsigned char*)(0x42E01B34UL))
#define bFM4_CANFD_TXBTO_TO14                  *((volatile unsigned char*)(0x42E01B38UL))
#define bFM4_CANFD_TXBTO_TO15                  *((volatile unsigned char*)(0x42E01B3CUL))
#define bFM4_CANFD_TXBTO_TO16                  *((volatile unsigned char*)(0x42E01B40UL))
#define bFM4_CANFD_TXBTO_TO17                  *((volatile unsigned char*)(0x42E01B44UL))
