MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* High-Speed Quad SPI registers */
#define bFM4_HSSPI_MCTRL_MEN                                          *((volatile unsigned char*)(0x1256080000UL))
#define bFM4_HSSPI_MCTRL_CSEN                                         *((volatile unsigned char*)(0x1256080004UL))
#define bFM4_HSSPI_MCTRL_MES                                          *((volatile unsigned char*)(0x1256080010UL))
#define bFM4_HSSPI_MCTRL_SYNCON                                       *((volatile unsigned char*)(0x1256080014UL))
#define bFM4_HSSPI_PCC0_CPHA                                          *((volatile unsigned char*)(0x1256080080UL))
#define bFM4_HSSPI_PCC0_CPOL                                          *((volatile unsigned char*)(0x1256080084UL))
#define bFM4_HSSPI_PCC0_ACES                                          *((volatile unsigned char*)(0x1256080088UL))
#define bFM4_HSSPI_PCC0_RTM                                           *((volatile unsigned char*)(0x125608008CUL))
#define bFM4_HSSPI_PCC0_SSPOL                                         *((volatile unsigned char*)(0x1256080090UL))
#define bFM4_HSSPI_PCC0_SS2CD0                                        *((volatile unsigned char*)(0x1256080094UL))
#define bFM4_HSSPI_PCC0_SS2CD1                                        *((volatile unsigned char*)(0x1256080098UL))
#define bFM4_HSSPI_PCC0_SDIR                                          *((volatile unsigned char*)(0x125608009CUL))
#define bFM4_HSSPI_PCC0_SENDIAN                                       *((volatile unsigned char*)(0x12560800A0UL))
#define bFM4_HSSPI_PCC0_CDRS0                                         *((volatile unsigned char*)(0x12560800A4UL))
#define bFM4_HSSPI_PCC0_CDRS1                                         *((volatile unsigned char*)(0x12560800A8UL))
#define bFM4_HSSPI_PCC0_CDRS2                                         *((volatile unsigned char*)(0x12560800ACUL))
#define bFM4_HSSPI_PCC0_CDRS3                                         *((volatile unsigned char*)(0x12560800B0UL))
#define bFM4_HSSPI_PCC0_CDRS4                                         *((volatile unsigned char*)(0x12560800B4UL))
#define bFM4_HSSPI_PCC0_CDRS5                                         *((volatile unsigned char*)(0x12560800B8UL))
#define bFM4_HSSPI_PCC0_CDRS6                                         *((volatile unsigned char*)(0x12560800BCUL))
#define bFM4_HSSPI_PCC0_SAFESYNC                                      *((volatile unsigned char*)(0x12560800C0UL))
#define bFM4_HSSPI_PCC0_WRDSEL0                                       *((volatile unsigned char*)(0x12560800C4UL))
#define bFM4_HSSPI_PCC0_WRDSEL1                                       *((volatile unsigned char*)(0x12560800C8UL))
#define bFM4_HSSPI_PCC0_WRDSEL2                                       *((volatile unsigned char*)(0x12560800CCUL))
#define bFM4_HSSPI_PCC0_WRDSEL3                                       *((volatile unsigned char*)(0x12560800D0UL))
#define bFM4_HSSPI_PCC0_RDDSEL0                                       *((volatile unsigned char*)(0x12560800D4UL))
#define bFM4_HSSPI_PCC0_RDDSEL1                                       *((volatile unsigned char*)(0x12560800D8UL))
#define bFM4_HSSPI_PCC1_CPHA                                          *((volatile unsigned char*)(0x1256080100UL))
#define bFM4_HSSPI_PCC1_CPOL                                          *((volatile unsigned char*)(0x1256080104UL))
#define bFM4_HSSPI_PCC1_ACES                                          *((volatile unsigned char*)(0x1256080108UL))
#define bFM4_HSSPI_PCC1_RTM                                           *((volatile unsigned char*)(0x125608010CUL))
#define bFM4_HSSPI_PCC1_SSPOL                                         *((volatile unsigned char*)(0x1256080110UL))
#define bFM4_HSSPI_PCC1_SS2CD0                                        *((volatile unsigned char*)(0x1256080114UL))
#define bFM4_HSSPI_PCC1_SS2CD1                                        *((volatile unsigned char*)(0x1256080118UL))
#define bFM4_HSSPI_PCC1_SDIR                                          *((volatile unsigned char*)(0x125608011CUL))
#define bFM4_HSSPI_PCC1_SENDIAN                                       *((volatile unsigned char*)(0x1256080120UL))
#define bFM4_HSSPI_PCC1_CDRS0                                         *((volatile unsigned char*)(0x1256080124UL))
#define bFM4_HSSPI_PCC1_CDRS1                                         *((volatile unsigned char*)(0x1256080128UL))
#define bFM4_HSSPI_PCC1_CDRS2                                         *((volatile unsigned char*)(0x125608012CUL))
#define bFM4_HSSPI_PCC1_CDRS3                                         *((volatile unsigned char*)(0x1256080130UL))
#define bFM4_HSSPI_PCC1_CDRS4                                         *((volatile unsigned char*)(0x1256080134UL))
#define bFM4_HSSPI_PCC1_CDRS5                                         *((volatile unsigned char*)(0x1256080138UL))
#define bFM4_HSSPI_PCC1_CDRS6                                         *((volatile unsigned char*)(0x125608013CUL))
#define bFM4_HSSPI_PCC1_SAFESYNC                                      *((volatile unsigned char*)(0x1256080140UL))
#define bFM4_HSSPI_PCC1_WRDSEL0                                       *((volatile unsigned char*)(0x1256080144UL))
#define bFM4_HSSPI_PCC1_WRDSEL1                                       *((volatile unsigned char*)(0x1256080148UL))
#define bFM4_HSSPI_PCC1_WRDSEL2                                       *((volatile unsigned char*)(0x125608014CUL))
#define bFM4_HSSPI_PCC1_WRDSEL3                                       *((volatile unsigned char*)(0x1256080150UL))
#define bFM4_HSSPI_PCC1_RDDSEL0                                       *((volatile unsigned char*)(0x1256080154UL))
#define bFM4_HSSPI_PCC1_RDDSEL1                                       *((volatile unsigned char*)(0x1256080158UL))
#define bFM4_HSSPI_PCC2_CPHA                                          *((volatile unsigned char*)(0x1256080180UL))
#define bFM4_HSSPI_PCC2_CPOL                                          *((volatile unsigned char*)(0x1256080184UL))
#define bFM4_HSSPI_PCC2_ACES                                          *((volatile unsigned char*)(0x1256080188UL))
#define bFM4_HSSPI_PCC2_RTM                                           *((volatile unsigned char*)(0x125608018CUL))
#define bFM4_HSSPI_PCC2_SSPOL                                         *((volatile unsigned char*)(0x1256080190UL))
#define bFM4_HSSPI_PCC2_SS2CD0                                        *((volatile unsigned char*)(0x1256080194UL))
#define bFM4_HSSPI_PCC2_SS2CD1                                        *((volatile unsigned char*)(0x1256080198UL))
#define bFM4_HSSPI_PCC2_SDIR                                          *((volatile unsigned char*)(0x125608019CUL))
#define bFM4_HSSPI_PCC2_SENDIAN                                       *((volatile unsigned char*)(0x12560801A0UL))
#define bFM4_HSSPI_PCC2_CDRS0                                         *((volatile unsigned char*)(0x12560801A4UL))
#define bFM4_HSSPI_PCC2_CDRS1                                         *((volatile unsigned char*)(0x12560801A8UL))
#define bFM4_HSSPI_PCC2_CDRS2                                         *((volatile unsigned char*)(0x12560801ACUL))
#define bFM4_HSSPI_PCC2_CDRS3                                         *((volatile unsigned char*)(0x12560801B0UL))
#define bFM4_HSSPI_PCC2_CDRS4                                         *((volatile unsigned char*)(0x12560801B4UL))
#define bFM4_HSSPI_PCC2_CDRS5                                         *((volatile unsigned char*)(0x12560801B8UL))
#define bFM4_HSSPI_PCC2_CDRS6                                         *((volatile unsigned char*)(0x12560801BCUL))
#define bFM4_HSSPI_PCC2_SAFESYNC                                      *((volatile unsigned char*)(0x12560801C0UL))
#define bFM4_HSSPI_PCC2_WRDSEL0                                       *((volatile unsigned char*)(0x12560801C4UL))
#define bFM4_HSSPI_PCC2_WRDSEL1                                       *((volatile unsigned char*)(0x12560801C8UL))
#define bFM4_HSSPI_PCC2_WRDSEL2                                       *((volatile unsigned char*)(0x12560801CCUL))
#define bFM4_HSSPI_PCC2_WRDSEL3                                       *((volatile unsigned char*)(0x12560801D0UL))
#define bFM4_HSSPI_PCC2_RDDSEL0                                       *((volatile unsigned char*)(0x12560801D4UL))
#define bFM4_HSSPI_PCC2_RDDSEL1                                       *((volatile unsigned char*)(0x12560801D8UL))
#define bFM4_HSSPI_PCC3_CPHA                                          *((volatile unsigned char*)(0x1256080200UL))
#define bFM4_HSSPI_PCC3_CPOL                                          *((volatile unsigned char*)(0x1256080204UL))
#define bFM4_HSSPI_PCC3_ACES                                          *((volatile unsigned char*)(0x1256080208UL))
#define bFM4_HSSPI_PCC3_RTM                                           *((volatile unsigned char*)(0x125608020CUL))
#define bFM4_HSSPI_PCC3_SSPOL                                         *((volatile unsigned char*)(0x1256080210UL))
#define bFM4_HSSPI_PCC3_SS2CD0                                        *((volatile unsigned char*)(0x1256080214UL))
#define bFM4_HSSPI_PCC3_SS2CD1                                        *((volatile unsigned char*)(0x1256080218UL))
#define bFM4_HSSPI_PCC3_SDIR                                          *((volatile unsigned char*)(0x125608021CUL))
#define bFM4_HSSPI_PCC3_SENDIAN                                       *((volatile unsigned char*)(0x1256080220UL))
#define bFM4_HSSPI_PCC3_CDRS0                                         *((volatile unsigned char*)(0x1256080224UL))
#define bFM4_HSSPI_PCC3_CDRS1                                         *((volatile unsigned char*)(0x1256080228UL))
#define bFM4_HSSPI_PCC3_CDRS2                                         *((volatile unsigned char*)(0x125608022CUL))
#define bFM4_HSSPI_PCC3_CDRS3                                         *((volatile unsigned char*)(0x1256080230UL))
#define bFM4_HSSPI_PCC3_CDRS4                                         *((volatile unsigned char*)(0x1256080234UL))
#define bFM4_HSSPI_PCC3_CDRS5                                         *((volatile unsigned char*)(0x1256080238UL))
#define bFM4_HSSPI_PCC3_CDRS6                                         *((volatile unsigned char*)(0x125608023CUL))
#define bFM4_HSSPI_PCC3_SAFESYNC                                      *((volatile unsigned char*)(0x1256080240UL))
#define bFM4_HSSPI_PCC3_WRDSEL0                                       *((volatile unsigned char*)(0x1256080244UL))
#define bFM4_HSSPI_PCC3_WRDSEL1                                       *((volatile unsigned char*)(0x1256080248UL))
#define bFM4_HSSPI_PCC3_WRDSEL2                                       *((volatile unsigned char*)(0x125608024CUL))
#define bFM4_HSSPI_PCC3_WRDSEL3                                       *((volatile unsigned char*)(0x1256080250UL))
#define bFM4_HSSPI_PCC3_RDDSEL0                                       *((volatile unsigned char*)(0x1256080254UL))
#define bFM4_HSSPI_PCC3_RDDSEL1                                       *((volatile unsigned char*)(0x1256080258UL))
#define bFM4_HSSPI_TXF_TFFS                                           *((volatile unsigned char*)(0x1256080280UL))
#define bFM4_HSSPI_TXF_TFES                                           *((volatile unsigned char*)(0x1256080284UL))
#define bFM4_HSSPI_TXF_TFOS                                           *((volatile unsigned char*)(0x1256080288UL))
#define bFM4_HSSPI_TXF_TFUS                                           *((volatile unsigned char*)(0x125608028CUL))
#define bFM4_HSSPI_TXF_TFLETS                                         *((volatile unsigned char*)(0x1256080290UL))
#define bFM4_HSSPI_TXF_TFMTS                                          *((volatile unsigned char*)(0x1256080294UL))
#define bFM4_HSSPI_TXF_TSSRS                                          *((volatile unsigned char*)(0x1256080298UL))
#define bFM4_HSSPI_TXE_TFFE                                           *((volatile unsigned char*)(0x1256080300UL))
#define bFM4_HSSPI_TXE_TFEE                                           *((volatile unsigned char*)(0x1256080304UL))
#define bFM4_HSSPI_TXE_TFOE                                           *((volatile unsigned char*)(0x1256080308UL))
#define bFM4_HSSPI_TXE_TFUE                                           *((volatile unsigned char*)(0x125608030CUL))
#define bFM4_HSSPI_TXE_TFLETE                                         *((volatile unsigned char*)(0x1256080310UL))
#define bFM4_HSSPI_TXE_TFMTE                                          *((volatile unsigned char*)(0x1256080314UL))
#define bFM4_HSSPI_TXE_TSSRE                                          *((volatile unsigned char*)(0x1256080318UL))
#define bFM4_HSSPI_TXC_TFFC                                           *((volatile unsigned char*)(0x1256080380UL))
#define bFM4_HSSPI_TXC_TFEC                                           *((volatile unsigned char*)(0x1256080384UL))
#define bFM4_HSSPI_TXC_TFOC                                           *((volatile unsigned char*)(0x1256080388UL))
#define bFM4_HSSPI_TXC_TFUC                                           *((volatile unsigned char*)(0x125608038CUL))
#define bFM4_HSSPI_TXC_TFLETC                                         *((volatile unsigned char*)(0x1256080390UL))
#define bFM4_HSSPI_TXC_TFMTC                                          *((volatile unsigned char*)(0x1256080394UL))
#define bFM4_HSSPI_TXC_TSSRC                                          *((volatile unsigned char*)(0x1256080398UL))
#define bFM4_HSSPI_RXF_RFFS                                           *((volatile unsigned char*)(0x1256080400UL))
#define bFM4_HSSPI_RXF_RFES                                           *((volatile unsigned char*)(0x1256080404UL))
#define bFM4_HSSPI_RXF_RFOS                                           *((volatile unsigned char*)(0x1256080408UL))
#define bFM4_HSSPI_RXF_RFUS                                           *((volatile unsigned char*)(0x125608040CUL))
#define bFM4_HSSPI_RXF_RFLETS                                         *((volatile unsigned char*)(0x1256080410UL))
#define bFM4_HSSPI_RXF_RFMTS                                          *((volatile unsigned char*)(0x1256080414UL))
#define bFM4_HSSPI_RXF_RSSRS                                          *((volatile unsigned char*)(0x1256080418UL))
#define bFM4_HSSPI_RXE_RFFE                                           *((volatile unsigned char*)(0x1256080480UL))
#define bFM4_HSSPI_RXE_RFEE                                           *((volatile unsigned char*)(0x1256080484UL))
#define bFM4_HSSPI_RXE_RFOE                                           *((volatile unsigned char*)(0x1256080488UL))
#define bFM4_HSSPI_RXE_RFUE                                           *((volatile unsigned char*)(0x125608048CUL))
#define bFM4_HSSPI_RXE_RFLETE                                         *((volatile unsigned char*)(0x1256080490UL))
#define bFM4_HSSPI_RXE_RFMTE                                          *((volatile unsigned char*)(0x1256080494UL))
#define bFM4_HSSPI_RXE_RSSRE                                          *((volatile unsigned char*)(0x1256080498UL))
#define bFM4_HSSPI_RXC_RFFC                                           *((volatile unsigned char*)(0x1256080500UL))
#define bFM4_HSSPI_RXC_RFEC                                           *((volatile unsigned char*)(0x1256080504UL))
#define bFM4_HSSPI_RXC_RFOC                                           *((volatile unsigned char*)(0x1256080508UL))
#define bFM4_HSSPI_RXC_RFUC                                           *((volatile unsigned char*)(0x125608050CUL))
#define bFM4_HSSPI_RXC_RFLETC                                         *((volatile unsigned char*)(0x1256080510UL))
#define bFM4_HSSPI_RXC_RFMTC                                          *((volatile unsigned char*)(0x1256080514UL))
#define bFM4_HSSPI_RXC_RSSRC                                          *((volatile unsigned char*)(0x1256080518UL))
#define bFM4_HSSPI_FAULTF_UMAFS                                       *((volatile unsigned char*)(0x1256080580UL))
#define bFM4_HSSPI_FAULTF_WAFS                                        *((volatile unsigned char*)(0x1256080584UL))
#define bFM4_HSSPI_FAULTF_PVFS                                        *((volatile unsigned char*)(0x1256080588UL))
#define bFM4_HSSPI_FAULTF_DWCBSFS                                     *((volatile unsigned char*)(0x125608058CUL))
#define bFM4_HSSPI_FAULTF_DRCBSFS                                     *((volatile unsigned char*)(0x1256080590UL))
#define bFM4_HSSPI_FAULTC_UMAFC                                       *((volatile unsigned char*)(0x1256080600UL))
#define bFM4_HSSPI_FAULTC_WAFC                                        *((volatile unsigned char*)(0x1256080604UL))
#define bFM4_HSSPI_FAULTC_PVFC                                        *((volatile unsigned char*)(0x1256080608UL))
#define bFM4_HSSPI_FAULTC_DWCBSFC                                     *((volatile unsigned char*)(0x125608060CUL))
#define bFM4_HSSPI_FAULTC_DRCBSFC                                     *((volatile unsigned char*)(0x1256080610UL))
#define bFM4_HSSPI_DMCFG_SSDC                                         *((volatile unsigned char*)(0x1256080684UL))
#define bFM4_HSSPI_DMDMAEN_RXDMAEN                                    *((volatile unsigned char*)(0x12560806A0UL))
#define bFM4_HSSPI_DMDMAEN_TXDMAEN                                    *((volatile unsigned char*)(0x12560806A4UL))
#define bFM4_HSSPI_DMSTART_START                                      *((volatile unsigned char*)(0x1256080700UL))
#define bFM4_HSSPI_DMSTOP_STOP                                        *((volatile unsigned char*)(0x1256080720UL))
#define bFM4_HSSPI_DMPSEL_PSEL0                                       *((volatile unsigned char*)(0x1256080740UL))
#define bFM4_HSSPI_DMPSEL_PSEL1                                       *((volatile unsigned char*)(0x1256080744UL))
#define bFM4_HSSPI_DMTRP_TRP0                                         *((volatile unsigned char*)(0x1256080760UL))
#define bFM4_HSSPI_DMTRP_TRP1                                         *((volatile unsigned char*)(0x1256080764UL))
#define bFM4_HSSPI_DMTRP_TRP2                                         *((volatile unsigned char*)(0x1256080768UL))
#define bFM4_HSSPI_DMTRP_TRP3                                         *((volatile unsigned char*)(0x125608076CUL))
#define bFM4_HSSPI_DMBCC_BCC0                                         *((volatile unsigned char*)(0x1256080780UL))
#define bFM4_HSSPI_DMBCC_BCC1                                         *((volatile unsigned char*)(0x1256080784UL))
#define bFM4_HSSPI_DMBCC_BCC2                                         *((volatile unsigned char*)(0x1256080788UL))
#define bFM4_HSSPI_DMBCC_BCC3                                         *((volatile unsigned char*)(0x125608078CUL))
#define bFM4_HSSPI_DMBCC_BCC4                                         *((volatile unsigned char*)(0x1256080790UL))
#define bFM4_HSSPI_DMBCC_BCC5                                         *((volatile unsigned char*)(0x1256080794UL))
#define bFM4_HSSPI_DMBCC_BCC6                                         *((volatile unsigned char*)(0x1256080798UL))
#define bFM4_HSSPI_DMBCC_BCC7                                         *((volatile unsigned char*)(0x125608079CUL))
#define bFM4_HSSPI_DMBCC_BCC8                                         *((volatile unsigned char*)(0x12560807A0UL))
#define bFM4_HSSPI_DMBCC_BCC9                                         *((volatile unsigned char*)(0x12560807A4UL))
#define bFM4_HSSPI_DMBCC_BCC10                                        *((volatile unsigned char*)(0x12560807A8UL))
#define bFM4_HSSPI_DMBCC_BCC11                                        *((volatile unsigned char*)(0x12560807ACUL))
#define bFM4_HSSPI_DMBCC_BCC12                                        *((volatile unsigned char*)(0x12560807B0UL))
#define bFM4_HSSPI_DMBCC_BCC13                                        *((volatile unsigned char*)(0x12560807B4UL))
#define bFM4_HSSPI_DMBCC_BCC14                                        *((volatile unsigned char*)(0x12560807B8UL))
#define bFM4_HSSPI_DMBCC_BCC15                                        *((volatile unsigned char*)(0x12560807BCUL))
#define bFM4_HSSPI_DMBCS_BCS0                                         *((volatile unsigned char*)(0x12560807C0UL))
#define bFM4_HSSPI_DMBCS_BCS1                                         *((volatile unsigned char*)(0x12560807C4UL))
#define bFM4_HSSPI_DMBCS_BCS2                                         *((volatile unsigned char*)(0x12560807C8UL))
#define bFM4_HSSPI_DMBCS_BCS3                                         *((volatile unsigned char*)(0x12560807CCUL))
#define bFM4_HSSPI_DMBCS_BCS4                                         *((volatile unsigned char*)(0x12560807D0UL))
#define bFM4_HSSPI_DMBCS_BCS5                                         *((volatile unsigned char*)(0x12560807D4UL))
#define bFM4_HSSPI_DMBCS_BCS6                                         *((volatile unsigned char*)(0x12560807D8UL))
#define bFM4_HSSPI_DMBCS_BCS7                                         *((volatile unsigned char*)(0x12560807DCUL))
#define bFM4_HSSPI_DMBCS_BCS8                                         *((volatile unsigned char*)(0x12560807E0UL))
#define bFM4_HSSPI_DMBCS_BCS9                                         *((volatile unsigned char*)(0x12560807E4UL))
#define bFM4_HSSPI_DMBCS_BCS10                                        *((volatile unsigned char*)(0x12560807E8UL))
#define bFM4_HSSPI_DMBCS_BCS11                                        *((volatile unsigned char*)(0x12560807ECUL))
#define bFM4_HSSPI_DMBCS_BCS12                                        *((volatile unsigned char*)(0x12560807F0UL))
#define bFM4_HSSPI_DMBCS_BCS13                                        *((volatile unsigned char*)(0x12560807F4UL))
#define bFM4_HSSPI_DMBCS_BCS14                                        *((volatile unsigned char*)(0x12560807F8UL))
#define bFM4_HSSPI_DMBCS_BCS15                                        *((volatile unsigned char*)(0x12560807FCUL))
#define bFM4_HSSPI_DMSTATUS_RXACTIVE                                  *((volatile unsigned char*)(0x1256080800UL))
#define bFM4_HSSPI_DMSTATUS_TXACTIVE                                  *((volatile unsigned char*)(0x1256080804UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL0                                 *((volatile unsigned char*)(0x1256080820UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL1                                 *((volatile unsigned char*)(0x1256080824UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL2                                 *((volatile unsigned char*)(0x1256080828UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL3                                 *((volatile unsigned char*)(0x125608082CUL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL4                                 *((volatile unsigned char*)(0x1256080830UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL0                                 *((volatile unsigned char*)(0x1256080840UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL1                                 *((volatile unsigned char*)(0x1256080844UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL2                                 *((volatile unsigned char*)(0x1256080848UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL3                                 *((volatile unsigned char*)(0x125608084CUL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL4                                 *((volatile unsigned char*)(0x1256080850UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH0                                     *((volatile unsigned char*)(0x1256080980UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH1                                     *((volatile unsigned char*)(0x1256080984UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH2                                     *((volatile unsigned char*)(0x1256080988UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH3                                     *((volatile unsigned char*)(0x125608098CUL))
#define bFM4_HSSPI_FIFOCFG_TXFTH0                                     *((volatile unsigned char*)(0x1256080990UL))
