MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_FIFOCFG_TXFTH1                                     *((volatile unsigned char*)(0x1256080994UL))
#define bFM4_HSSPI_FIFOCFG_TXFTH2                                     *((volatile unsigned char*)(0x1256080998UL))
#define bFM4_HSSPI_FIFOCFG_TXFTH3                                     *((volatile unsigned char*)(0x125608099CUL))
#define bFM4_HSSPI_FIFOCFG_FWIDTH0                                    *((volatile unsigned char*)(0x12560809A0UL))
#define bFM4_HSSPI_FIFOCFG_FWIDTH1                                    *((volatile unsigned char*)(0x12560809A4UL))
#define bFM4_HSSPI_FIFOCFG_TXCTRL                                     *((volatile unsigned char*)(0x12560809A8UL))
#define bFM4_HSSPI_FIFOCFG_RXFLSH                                     *((volatile unsigned char*)(0x12560809ACUL))
#define bFM4_HSSPI_FIFOCFG_TXFLSH                                     *((volatile unsigned char*)(0x12560809B0UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA0                                    *((volatile unsigned char*)(0x1256080A00UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA1                                    *((volatile unsigned char*)(0x1256080A04UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA2                                    *((volatile unsigned char*)(0x1256080A08UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA3                                    *((volatile unsigned char*)(0x1256080A0CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA4                                    *((volatile unsigned char*)(0x1256080A10UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA5                                    *((volatile unsigned char*)(0x1256080A14UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA6                                    *((volatile unsigned char*)(0x1256080A18UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA7                                    *((volatile unsigned char*)(0x1256080A1CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA8                                    *((volatile unsigned char*)(0x1256080A20UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA9                                    *((volatile unsigned char*)(0x1256080A24UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA10                                   *((volatile unsigned char*)(0x1256080A28UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA11                                   *((volatile unsigned char*)(0x1256080A2CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA12                                   *((volatile unsigned char*)(0x1256080A30UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA13                                   *((volatile unsigned char*)(0x1256080A34UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA14                                   *((volatile unsigned char*)(0x1256080A38UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA15                                   *((volatile unsigned char*)(0x1256080A3CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA16                                   *((volatile unsigned char*)(0x1256080A40UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA17                                   *((volatile unsigned char*)(0x1256080A44UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA18                                   *((volatile unsigned char*)(0x1256080A48UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA19                                   *((volatile unsigned char*)(0x1256080A4CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA20                                   *((volatile unsigned char*)(0x1256080A50UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA21                                   *((volatile unsigned char*)(0x1256080A54UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA22                                   *((volatile unsigned char*)(0x1256080A58UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA23                                   *((volatile unsigned char*)(0x1256080A5CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA24                                   *((volatile unsigned char*)(0x1256080A60UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA25                                   *((volatile unsigned char*)(0x1256080A64UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA26                                   *((volatile unsigned char*)(0x1256080A68UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA27                                   *((volatile unsigned char*)(0x1256080A6CUL))
#define bFM4_HSSPI_TXFIFO0_TXDATA28                                   *((volatile unsigned char*)(0x1256080A70UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA29                                   *((volatile unsigned char*)(0x1256080A74UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA30                                   *((volatile unsigned char*)(0x1256080A78UL))
#define bFM4_HSSPI_TXFIFO0_TXDATA31                                   *((volatile unsigned char*)(0x1256080A7CUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA0                                    *((volatile unsigned char*)(0x1256080A80UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA1                                    *((volatile unsigned char*)(0x1256080A84UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA2                                    *((volatile unsigned char*)(0x1256080A88UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA3                                    *((volatile unsigned char*)(0x1256080A8CUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA4                                    *((volatile unsigned char*)(0x1256080A90UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA5                                    *((volatile unsigned char*)(0x1256080A94UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA6                                    *((volatile unsigned char*)(0x1256080A98UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA7                                    *((volatile unsigned char*)(0x1256080A9CUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA8                                    *((volatile unsigned char*)(0x1256080AA0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA9                                    *((volatile unsigned char*)(0x1256080AA4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA10                                   *((volatile unsigned char*)(0x1256080AA8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA11                                   *((volatile unsigned char*)(0x1256080AACUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA12                                   *((volatile unsigned char*)(0x1256080AB0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA13                                   *((volatile unsigned char*)(0x1256080AB4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA14                                   *((volatile unsigned char*)(0x1256080AB8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA15                                   *((volatile unsigned char*)(0x1256080ABCUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA16                                   *((volatile unsigned char*)(0x1256080AC0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA17                                   *((volatile unsigned char*)(0x1256080AC4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA18                                   *((volatile unsigned char*)(0x1256080AC8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA19                                   *((volatile unsigned char*)(0x1256080ACCUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA20                                   *((volatile unsigned char*)(0x1256080AD0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA21                                   *((volatile unsigned char*)(0x1256080AD4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA22                                   *((volatile unsigned char*)(0x1256080AD8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA23                                   *((volatile unsigned char*)(0x1256080ADCUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA24                                   *((volatile unsigned char*)(0x1256080AE0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA25                                   *((volatile unsigned char*)(0x1256080AE4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA26                                   *((volatile unsigned char*)(0x1256080AE8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA27                                   *((volatile unsigned char*)(0x1256080AECUL))
#define bFM4_HSSPI_TXFIFO1_TXDATA28                                   *((volatile unsigned char*)(0x1256080AF0UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA29                                   *((volatile unsigned char*)(0x1256080AF4UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA30                                   *((volatile unsigned char*)(0x1256080AF8UL))
#define bFM4_HSSPI_TXFIFO1_TXDATA31                                   *((volatile unsigned char*)(0x1256080AFCUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA0                                    *((volatile unsigned char*)(0x1256080B00UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA1                                    *((volatile unsigned char*)(0x1256080B04UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA2                                    *((volatile unsigned char*)(0x1256080B08UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA3                                    *((volatile unsigned char*)(0x1256080B0CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA4                                    *((volatile unsigned char*)(0x1256080B10UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA5                                    *((volatile unsigned char*)(0x1256080B14UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA6                                    *((volatile unsigned char*)(0x1256080B18UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA7                                    *((volatile unsigned char*)(0x1256080B1CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA8                                    *((volatile unsigned char*)(0x1256080B20UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA9                                    *((volatile unsigned char*)(0x1256080B24UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA10                                   *((volatile unsigned char*)(0x1256080B28UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA11                                   *((volatile unsigned char*)(0x1256080B2CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA12                                   *((volatile unsigned char*)(0x1256080B30UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA13                                   *((volatile unsigned char*)(0x1256080B34UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA14                                   *((volatile unsigned char*)(0x1256080B38UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA15                                   *((volatile unsigned char*)(0x1256080B3CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA16                                   *((volatile unsigned char*)(0x1256080B40UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA17                                   *((volatile unsigned char*)(0x1256080B44UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA18                                   *((volatile unsigned char*)(0x1256080B48UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA19                                   *((volatile unsigned char*)(0x1256080B4CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA20                                   *((volatile unsigned char*)(0x1256080B50UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA21                                   *((volatile unsigned char*)(0x1256080B54UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA22                                   *((volatile unsigned char*)(0x1256080B58UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA23                                   *((volatile unsigned char*)(0x1256080B5CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA24                                   *((volatile unsigned char*)(0x1256080B60UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA25                                   *((volatile unsigned char*)(0x1256080B64UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA26                                   *((volatile unsigned char*)(0x1256080B68UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA27                                   *((volatile unsigned char*)(0x1256080B6CUL))
#define bFM4_HSSPI_TXFIFO2_TXDATA28                                   *((volatile unsigned char*)(0x1256080B70UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA29                                   *((volatile unsigned char*)(0x1256080B74UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA30                                   *((volatile unsigned char*)(0x1256080B78UL))
#define bFM4_HSSPI_TXFIFO2_TXDATA31                                   *((volatile unsigned char*)(0x1256080B7CUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA0                                    *((volatile unsigned char*)(0x1256080B80UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA1                                    *((volatile unsigned char*)(0x1256080B84UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA2                                    *((volatile unsigned char*)(0x1256080B88UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA3                                    *((volatile unsigned char*)(0x1256080B8CUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA4                                    *((volatile unsigned char*)(0x1256080B90UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA5                                    *((volatile unsigned char*)(0x1256080B94UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA6                                    *((volatile unsigned char*)(0x1256080B98UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA7                                    *((volatile unsigned char*)(0x1256080B9CUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA8                                    *((volatile unsigned char*)(0x1256080BA0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA9                                    *((volatile unsigned char*)(0x1256080BA4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA10                                   *((volatile unsigned char*)(0x1256080BA8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA11                                   *((volatile unsigned char*)(0x1256080BACUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA12                                   *((volatile unsigned char*)(0x1256080BB0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA13                                   *((volatile unsigned char*)(0x1256080BB4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA14                                   *((volatile unsigned char*)(0x1256080BB8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA15                                   *((volatile unsigned char*)(0x1256080BBCUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA16                                   *((volatile unsigned char*)(0x1256080BC0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA17                                   *((volatile unsigned char*)(0x1256080BC4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA18                                   *((volatile unsigned char*)(0x1256080BC8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA19                                   *((volatile unsigned char*)(0x1256080BCCUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA20                                   *((volatile unsigned char*)(0x1256080BD0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA21                                   *((volatile unsigned char*)(0x1256080BD4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA22                                   *((volatile unsigned char*)(0x1256080BD8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA23                                   *((volatile unsigned char*)(0x1256080BDCUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA24                                   *((volatile unsigned char*)(0x1256080BE0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA25                                   *((volatile unsigned char*)(0x1256080BE4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA26                                   *((volatile unsigned char*)(0x1256080BE8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA27                                   *((volatile unsigned char*)(0x1256080BECUL))
#define bFM4_HSSPI_TXFIFO3_TXDATA28                                   *((volatile unsigned char*)(0x1256080BF0UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA29                                   *((volatile unsigned char*)(0x1256080BF4UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA30                                   *((volatile unsigned char*)(0x1256080BF8UL))
#define bFM4_HSSPI_TXFIFO3_TXDATA31                                   *((volatile unsigned char*)(0x1256080BFCUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA0                                    *((volatile unsigned char*)(0x1256080C00UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA1                                    *((volatile unsigned char*)(0x1256080C04UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA2                                    *((volatile unsigned char*)(0x1256080C08UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA3                                    *((volatile unsigned char*)(0x1256080C0CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA4                                    *((volatile unsigned char*)(0x1256080C10UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA5                                    *((volatile unsigned char*)(0x1256080C14UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA6                                    *((volatile unsigned char*)(0x1256080C18UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA7                                    *((volatile unsigned char*)(0x1256080C1CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA8                                    *((volatile unsigned char*)(0x1256080C20UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA9                                    *((volatile unsigned char*)(0x1256080C24UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA10                                   *((volatile unsigned char*)(0x1256080C28UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA11                                   *((volatile unsigned char*)(0x1256080C2CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA12                                   *((volatile unsigned char*)(0x1256080C30UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA13                                   *((volatile unsigned char*)(0x1256080C34UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA14                                   *((volatile unsigned char*)(0x1256080C38UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA15                                   *((volatile unsigned char*)(0x1256080C3CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA16                                   *((volatile unsigned char*)(0x1256080C40UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA17                                   *((volatile unsigned char*)(0x1256080C44UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA18                                   *((volatile unsigned char*)(0x1256080C48UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA19                                   *((volatile unsigned char*)(0x1256080C4CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA20                                   *((volatile unsigned char*)(0x1256080C50UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA21                                   *((volatile unsigned char*)(0x1256080C54UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA22                                   *((volatile unsigned char*)(0x1256080C58UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA23                                   *((volatile unsigned char*)(0x1256080C5CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA24                                   *((volatile unsigned char*)(0x1256080C60UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA25                                   *((volatile unsigned char*)(0x1256080C64UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA26                                   *((volatile unsigned char*)(0x1256080C68UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA27                                   *((volatile unsigned char*)(0x1256080C6CUL))
#define bFM4_HSSPI_TXFIFO4_TXDATA28                                   *((volatile unsigned char*)(0x1256080C70UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA29                                   *((volatile unsigned char*)(0x1256080C74UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA30                                   *((volatile unsigned char*)(0x1256080C78UL))
#define bFM4_HSSPI_TXFIFO4_TXDATA31                                   *((volatile unsigned char*)(0x1256080C7CUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA0                                    *((volatile unsigned char*)(0x1256080C80UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA1                                    *((volatile unsigned char*)(0x1256080C84UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA2                                    *((volatile unsigned char*)(0x1256080C88UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA3                                    *((volatile unsigned char*)(0x1256080C8CUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA4                                    *((volatile unsigned char*)(0x1256080C90UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA5                                    *((volatile unsigned char*)(0x1256080C94UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA6                                    *((volatile unsigned char*)(0x1256080C98UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA7                                    *((volatile unsigned char*)(0x1256080C9CUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA8                                    *((volatile unsigned char*)(0x1256080CA0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA9                                    *((volatile unsigned char*)(0x1256080CA4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA10                                   *((volatile unsigned char*)(0x1256080CA8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA11                                   *((volatile unsigned char*)(0x1256080CACUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA12                                   *((volatile unsigned char*)(0x1256080CB0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA13                                   *((volatile unsigned char*)(0x1256080CB4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA14                                   *((volatile unsigned char*)(0x1256080CB8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA15                                   *((volatile unsigned char*)(0x1256080CBCUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA16                                   *((volatile unsigned char*)(0x1256080CC0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA17                                   *((volatile unsigned char*)(0x1256080CC4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA18                                   *((volatile unsigned char*)(0x1256080CC8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA19                                   *((volatile unsigned char*)(0x1256080CCCUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA20                                   *((volatile unsigned char*)(0x1256080CD0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA21                                   *((volatile unsigned char*)(0x1256080CD4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA22                                   *((volatile unsigned char*)(0x1256080CD8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA23                                   *((volatile unsigned char*)(0x1256080CDCUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA24                                   *((volatile unsigned char*)(0x1256080CE0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA25                                   *((volatile unsigned char*)(0x1256080CE4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA26                                   *((volatile unsigned char*)(0x1256080CE8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA27                                   *((volatile unsigned char*)(0x1256080CECUL))
#define bFM4_HSSPI_TXFIFO5_TXDATA28                                   *((volatile unsigned char*)(0x1256080CF0UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA29                                   *((volatile unsigned char*)(0x1256080CF4UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA30                                   *((volatile unsigned char*)(0x1256080CF8UL))
#define bFM4_HSSPI_TXFIFO5_TXDATA31                                   *((volatile unsigned char*)(0x1256080CFCUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA0                                    *((volatile unsigned char*)(0x1256080D00UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA1                                    *((volatile unsigned char*)(0x1256080D04UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA2                                    *((volatile unsigned char*)(0x1256080D08UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA3                                    *((volatile unsigned char*)(0x1256080D0CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA4                                    *((volatile unsigned char*)(0x1256080D10UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA5                                    *((volatile unsigned char*)(0x1256080D14UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA6                                    *((volatile unsigned char*)(0x1256080D18UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA7                                    *((volatile unsigned char*)(0x1256080D1CUL))
