MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_TXFIFO6_TXDATA8                                    *((volatile unsigned char*)(0x1256080D20UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA9                                    *((volatile unsigned char*)(0x1256080D24UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA10                                   *((volatile unsigned char*)(0x1256080D28UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA11                                   *((volatile unsigned char*)(0x1256080D2CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA12                                   *((volatile unsigned char*)(0x1256080D30UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA13                                   *((volatile unsigned char*)(0x1256080D34UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA14                                   *((volatile unsigned char*)(0x1256080D38UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA15                                   *((volatile unsigned char*)(0x1256080D3CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA16                                   *((volatile unsigned char*)(0x1256080D40UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA17                                   *((volatile unsigned char*)(0x1256080D44UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA18                                   *((volatile unsigned char*)(0x1256080D48UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA19                                   *((volatile unsigned char*)(0x1256080D4CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA20                                   *((volatile unsigned char*)(0x1256080D50UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA21                                   *((volatile unsigned char*)(0x1256080D54UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA22                                   *((volatile unsigned char*)(0x1256080D58UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA23                                   *((volatile unsigned char*)(0x1256080D5CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA24                                   *((volatile unsigned char*)(0x1256080D60UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA25                                   *((volatile unsigned char*)(0x1256080D64UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA26                                   *((volatile unsigned char*)(0x1256080D68UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA27                                   *((volatile unsigned char*)(0x1256080D6CUL))
#define bFM4_HSSPI_TXFIFO6_TXDATA28                                   *((volatile unsigned char*)(0x1256080D70UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA29                                   *((volatile unsigned char*)(0x1256080D74UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA30                                   *((volatile unsigned char*)(0x1256080D78UL))
#define bFM4_HSSPI_TXFIFO6_TXDATA31                                   *((volatile unsigned char*)(0x1256080D7CUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA0                                    *((volatile unsigned char*)(0x1256080D80UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA1                                    *((volatile unsigned char*)(0x1256080D84UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA2                                    *((volatile unsigned char*)(0x1256080D88UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA3                                    *((volatile unsigned char*)(0x1256080D8CUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA4                                    *((volatile unsigned char*)(0x1256080D90UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA5                                    *((volatile unsigned char*)(0x1256080D94UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA6                                    *((volatile unsigned char*)(0x1256080D98UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA7                                    *((volatile unsigned char*)(0x1256080D9CUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA8                                    *((volatile unsigned char*)(0x1256080DA0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA9                                    *((volatile unsigned char*)(0x1256080DA4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA10                                   *((volatile unsigned char*)(0x1256080DA8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA11                                   *((volatile unsigned char*)(0x1256080DACUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA12                                   *((volatile unsigned char*)(0x1256080DB0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA13                                   *((volatile unsigned char*)(0x1256080DB4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA14                                   *((volatile unsigned char*)(0x1256080DB8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA15                                   *((volatile unsigned char*)(0x1256080DBCUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA16                                   *((volatile unsigned char*)(0x1256080DC0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA17                                   *((volatile unsigned char*)(0x1256080DC4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA18                                   *((volatile unsigned char*)(0x1256080DC8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA19                                   *((volatile unsigned char*)(0x1256080DCCUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA20                                   *((volatile unsigned char*)(0x1256080DD0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA21                                   *((volatile unsigned char*)(0x1256080DD4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA22                                   *((volatile unsigned char*)(0x1256080DD8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA23                                   *((volatile unsigned char*)(0x1256080DDCUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA24                                   *((volatile unsigned char*)(0x1256080DE0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA25                                   *((volatile unsigned char*)(0x1256080DE4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA26                                   *((volatile unsigned char*)(0x1256080DE8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA27                                   *((volatile unsigned char*)(0x1256080DECUL))
#define bFM4_HSSPI_TXFIFO7_TXDATA28                                   *((volatile unsigned char*)(0x1256080DF0UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA29                                   *((volatile unsigned char*)(0x1256080DF4UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA30                                   *((volatile unsigned char*)(0x1256080DF8UL))
#define bFM4_HSSPI_TXFIFO7_TXDATA31                                   *((volatile unsigned char*)(0x1256080DFCUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA0                                    *((volatile unsigned char*)(0x1256080E00UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA1                                    *((volatile unsigned char*)(0x1256080E04UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA2                                    *((volatile unsigned char*)(0x1256080E08UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA3                                    *((volatile unsigned char*)(0x1256080E0CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA4                                    *((volatile unsigned char*)(0x1256080E10UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA5                                    *((volatile unsigned char*)(0x1256080E14UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA6                                    *((volatile unsigned char*)(0x1256080E18UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA7                                    *((volatile unsigned char*)(0x1256080E1CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA8                                    *((volatile unsigned char*)(0x1256080E20UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA9                                    *((volatile unsigned char*)(0x1256080E24UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA10                                   *((volatile unsigned char*)(0x1256080E28UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA11                                   *((volatile unsigned char*)(0x1256080E2CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA12                                   *((volatile unsigned char*)(0x1256080E30UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA13                                   *((volatile unsigned char*)(0x1256080E34UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA14                                   *((volatile unsigned char*)(0x1256080E38UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA15                                   *((volatile unsigned char*)(0x1256080E3CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA16                                   *((volatile unsigned char*)(0x1256080E40UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA17                                   *((volatile unsigned char*)(0x1256080E44UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA18                                   *((volatile unsigned char*)(0x1256080E48UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA19                                   *((volatile unsigned char*)(0x1256080E4CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA20                                   *((volatile unsigned char*)(0x1256080E50UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA21                                   *((volatile unsigned char*)(0x1256080E54UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA22                                   *((volatile unsigned char*)(0x1256080E58UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA23                                   *((volatile unsigned char*)(0x1256080E5CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA24                                   *((volatile unsigned char*)(0x1256080E60UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA25                                   *((volatile unsigned char*)(0x1256080E64UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA26                                   *((volatile unsigned char*)(0x1256080E68UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA27                                   *((volatile unsigned char*)(0x1256080E6CUL))
#define bFM4_HSSPI_TXFIFO8_TXDATA28                                   *((volatile unsigned char*)(0x1256080E70UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA29                                   *((volatile unsigned char*)(0x1256080E74UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA30                                   *((volatile unsigned char*)(0x1256080E78UL))
#define bFM4_HSSPI_TXFIFO8_TXDATA31                                   *((volatile unsigned char*)(0x1256080E7CUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA0                                    *((volatile unsigned char*)(0x1256080E80UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA1                                    *((volatile unsigned char*)(0x1256080E84UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA2                                    *((volatile unsigned char*)(0x1256080E88UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA3                                    *((volatile unsigned char*)(0x1256080E8CUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA4                                    *((volatile unsigned char*)(0x1256080E90UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA5                                    *((volatile unsigned char*)(0x1256080E94UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA6                                    *((volatile unsigned char*)(0x1256080E98UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA7                                    *((volatile unsigned char*)(0x1256080E9CUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA8                                    *((volatile unsigned char*)(0x1256080EA0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA9                                    *((volatile unsigned char*)(0x1256080EA4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA10                                   *((volatile unsigned char*)(0x1256080EA8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA11                                   *((volatile unsigned char*)(0x1256080EACUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA12                                   *((volatile unsigned char*)(0x1256080EB0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA13                                   *((volatile unsigned char*)(0x1256080EB4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA14                                   *((volatile unsigned char*)(0x1256080EB8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA15                                   *((volatile unsigned char*)(0x1256080EBCUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA16                                   *((volatile unsigned char*)(0x1256080EC0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA17                                   *((volatile unsigned char*)(0x1256080EC4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA18                                   *((volatile unsigned char*)(0x1256080EC8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA19                                   *((volatile unsigned char*)(0x1256080ECCUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA20                                   *((volatile unsigned char*)(0x1256080ED0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA21                                   *((volatile unsigned char*)(0x1256080ED4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA22                                   *((volatile unsigned char*)(0x1256080ED8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA23                                   *((volatile unsigned char*)(0x1256080EDCUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA24                                   *((volatile unsigned char*)(0x1256080EE0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA25                                   *((volatile unsigned char*)(0x1256080EE4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA26                                   *((volatile unsigned char*)(0x1256080EE8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA27                                   *((volatile unsigned char*)(0x1256080EECUL))
#define bFM4_HSSPI_TXFIFO9_TXDATA28                                   *((volatile unsigned char*)(0x1256080EF0UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA29                                   *((volatile unsigned char*)(0x1256080EF4UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA30                                   *((volatile unsigned char*)(0x1256080EF8UL))
#define bFM4_HSSPI_TXFIFO9_TXDATA31                                   *((volatile unsigned char*)(0x1256080EFCUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA0                                   *((volatile unsigned char*)(0x1256080F00UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA1                                   *((volatile unsigned char*)(0x1256080F04UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA2                                   *((volatile unsigned char*)(0x1256080F08UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA3                                   *((volatile unsigned char*)(0x1256080F0CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA4                                   *((volatile unsigned char*)(0x1256080F10UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA5                                   *((volatile unsigned char*)(0x1256080F14UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA6                                   *((volatile unsigned char*)(0x1256080F18UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA7                                   *((volatile unsigned char*)(0x1256080F1CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA8                                   *((volatile unsigned char*)(0x1256080F20UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA9                                   *((volatile unsigned char*)(0x1256080F24UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA10                                  *((volatile unsigned char*)(0x1256080F28UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA11                                  *((volatile unsigned char*)(0x1256080F2CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA12                                  *((volatile unsigned char*)(0x1256080F30UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA13                                  *((volatile unsigned char*)(0x1256080F34UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA14                                  *((volatile unsigned char*)(0x1256080F38UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA15                                  *((volatile unsigned char*)(0x1256080F3CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA16                                  *((volatile unsigned char*)(0x1256080F40UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA17                                  *((volatile unsigned char*)(0x1256080F44UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA18                                  *((volatile unsigned char*)(0x1256080F48UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA19                                  *((volatile unsigned char*)(0x1256080F4CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA20                                  *((volatile unsigned char*)(0x1256080F50UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA21                                  *((volatile unsigned char*)(0x1256080F54UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA22                                  *((volatile unsigned char*)(0x1256080F58UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA23                                  *((volatile unsigned char*)(0x1256080F5CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA24                                  *((volatile unsigned char*)(0x1256080F60UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA25                                  *((volatile unsigned char*)(0x1256080F64UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA26                                  *((volatile unsigned char*)(0x1256080F68UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA27                                  *((volatile unsigned char*)(0x1256080F6CUL))
#define bFM4_HSSPI_TXFIFO10_TXDATA28                                  *((volatile unsigned char*)(0x1256080F70UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA29                                  *((volatile unsigned char*)(0x1256080F74UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA30                                  *((volatile unsigned char*)(0x1256080F78UL))
#define bFM4_HSSPI_TXFIFO10_TXDATA31                                  *((volatile unsigned char*)(0x1256080F7CUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA0                                   *((volatile unsigned char*)(0x1256080F80UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA1                                   *((volatile unsigned char*)(0x1256080F84UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA2                                   *((volatile unsigned char*)(0x1256080F88UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA3                                   *((volatile unsigned char*)(0x1256080F8CUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA4                                   *((volatile unsigned char*)(0x1256080F90UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA5                                   *((volatile unsigned char*)(0x1256080F94UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA6                                   *((volatile unsigned char*)(0x1256080F98UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA7                                   *((volatile unsigned char*)(0x1256080F9CUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA8                                   *((volatile unsigned char*)(0x1256080FA0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA9                                   *((volatile unsigned char*)(0x1256080FA4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA10                                  *((volatile unsigned char*)(0x1256080FA8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA11                                  *((volatile unsigned char*)(0x1256080FACUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA12                                  *((volatile unsigned char*)(0x1256080FB0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA13                                  *((volatile unsigned char*)(0x1256080FB4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA14                                  *((volatile unsigned char*)(0x1256080FB8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA15                                  *((volatile unsigned char*)(0x1256080FBCUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA16                                  *((volatile unsigned char*)(0x1256080FC0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA17                                  *((volatile unsigned char*)(0x1256080FC4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA18                                  *((volatile unsigned char*)(0x1256080FC8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA19                                  *((volatile unsigned char*)(0x1256080FCCUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA20                                  *((volatile unsigned char*)(0x1256080FD0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA21                                  *((volatile unsigned char*)(0x1256080FD4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA22                                  *((volatile unsigned char*)(0x1256080FD8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA23                                  *((volatile unsigned char*)(0x1256080FDCUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA24                                  *((volatile unsigned char*)(0x1256080FE0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA25                                  *((volatile unsigned char*)(0x1256080FE4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA26                                  *((volatile unsigned char*)(0x1256080FE8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA27                                  *((volatile unsigned char*)(0x1256080FECUL))
#define bFM4_HSSPI_TXFIFO11_TXDATA28                                  *((volatile unsigned char*)(0x1256080FF0UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA29                                  *((volatile unsigned char*)(0x1256080FF4UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA30                                  *((volatile unsigned char*)(0x1256080FF8UL))
#define bFM4_HSSPI_TXFIFO11_TXDATA31                                  *((volatile unsigned char*)(0x1256080FFCUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA0                                   *((volatile unsigned char*)(0x1256081000UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA1                                   *((volatile unsigned char*)(0x1256081004UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA2                                   *((volatile unsigned char*)(0x1256081008UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA3                                   *((volatile unsigned char*)(0x125608100CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA4                                   *((volatile unsigned char*)(0x1256081010UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA5                                   *((volatile unsigned char*)(0x1256081014UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA6                                   *((volatile unsigned char*)(0x1256081018UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA7                                   *((volatile unsigned char*)(0x125608101CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA8                                   *((volatile unsigned char*)(0x1256081020UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA9                                   *((volatile unsigned char*)(0x1256081024UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA10                                  *((volatile unsigned char*)(0x1256081028UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA11                                  *((volatile unsigned char*)(0x125608102CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA12                                  *((volatile unsigned char*)(0x1256081030UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA13                                  *((volatile unsigned char*)(0x1256081034UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA14                                  *((volatile unsigned char*)(0x1256081038UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA15                                  *((volatile unsigned char*)(0x125608103CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA16                                  *((volatile unsigned char*)(0x1256081040UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA17                                  *((volatile unsigned char*)(0x1256081044UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA18                                  *((volatile unsigned char*)(0x1256081048UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA19                                  *((volatile unsigned char*)(0x125608104CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA20                                  *((volatile unsigned char*)(0x1256081050UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA21                                  *((volatile unsigned char*)(0x1256081054UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA22                                  *((volatile unsigned char*)(0x1256081058UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA23                                  *((volatile unsigned char*)(0x125608105CUL))
