MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_TXFIFO12_TXDATA24                                  *((volatile unsigned char*)(0x1256081060UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA25                                  *((volatile unsigned char*)(0x1256081064UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA26                                  *((volatile unsigned char*)(0x1256081068UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA27                                  *((volatile unsigned char*)(0x125608106CUL))
#define bFM4_HSSPI_TXFIFO12_TXDATA28                                  *((volatile unsigned char*)(0x1256081070UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA29                                  *((volatile unsigned char*)(0x1256081074UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA30                                  *((volatile unsigned char*)(0x1256081078UL))
#define bFM4_HSSPI_TXFIFO12_TXDATA31                                  *((volatile unsigned char*)(0x125608107CUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA0                                   *((volatile unsigned char*)(0x1256081080UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA1                                   *((volatile unsigned char*)(0x1256081084UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA2                                   *((volatile unsigned char*)(0x1256081088UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA3                                   *((volatile unsigned char*)(0x125608108CUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA4                                   *((volatile unsigned char*)(0x1256081090UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA5                                   *((volatile unsigned char*)(0x1256081094UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA6                                   *((volatile unsigned char*)(0x1256081098UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA7                                   *((volatile unsigned char*)(0x125608109CUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA8                                   *((volatile unsigned char*)(0x12560810A0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA9                                   *((volatile unsigned char*)(0x12560810A4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA10                                  *((volatile unsigned char*)(0x12560810A8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA11                                  *((volatile unsigned char*)(0x12560810ACUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA12                                  *((volatile unsigned char*)(0x12560810B0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA13                                  *((volatile unsigned char*)(0x12560810B4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA14                                  *((volatile unsigned char*)(0x12560810B8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA15                                  *((volatile unsigned char*)(0x12560810BCUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA16                                  *((volatile unsigned char*)(0x12560810C0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA17                                  *((volatile unsigned char*)(0x12560810C4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA18                                  *((volatile unsigned char*)(0x12560810C8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA19                                  *((volatile unsigned char*)(0x12560810CCUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA20                                  *((volatile unsigned char*)(0x12560810D0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA21                                  *((volatile unsigned char*)(0x12560810D4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA22                                  *((volatile unsigned char*)(0x12560810D8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA23                                  *((volatile unsigned char*)(0x12560810DCUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA24                                  *((volatile unsigned char*)(0x12560810E0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA25                                  *((volatile unsigned char*)(0x12560810E4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA26                                  *((volatile unsigned char*)(0x12560810E8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA27                                  *((volatile unsigned char*)(0x12560810ECUL))
#define bFM4_HSSPI_TXFIFO13_TXDATA28                                  *((volatile unsigned char*)(0x12560810F0UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA29                                  *((volatile unsigned char*)(0x12560810F4UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA30                                  *((volatile unsigned char*)(0x12560810F8UL))
#define bFM4_HSSPI_TXFIFO13_TXDATA31                                  *((volatile unsigned char*)(0x12560810FCUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA0                                   *((volatile unsigned char*)(0x1256081100UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA1                                   *((volatile unsigned char*)(0x1256081104UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA2                                   *((volatile unsigned char*)(0x1256081108UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA3                                   *((volatile unsigned char*)(0x125608110CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA4                                   *((volatile unsigned char*)(0x1256081110UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA5                                   *((volatile unsigned char*)(0x1256081114UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA6                                   *((volatile unsigned char*)(0x1256081118UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA7                                   *((volatile unsigned char*)(0x125608111CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA8                                   *((volatile unsigned char*)(0x1256081120UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA9                                   *((volatile unsigned char*)(0x1256081124UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA10                                  *((volatile unsigned char*)(0x1256081128UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA11                                  *((volatile unsigned char*)(0x125608112CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA12                                  *((volatile unsigned char*)(0x1256081130UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA13                                  *((volatile unsigned char*)(0x1256081134UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA14                                  *((volatile unsigned char*)(0x1256081138UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA15                                  *((volatile unsigned char*)(0x125608113CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA16                                  *((volatile unsigned char*)(0x1256081140UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA17                                  *((volatile unsigned char*)(0x1256081144UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA18                                  *((volatile unsigned char*)(0x1256081148UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA19                                  *((volatile unsigned char*)(0x125608114CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA20                                  *((volatile unsigned char*)(0x1256081150UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA21                                  *((volatile unsigned char*)(0x1256081154UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA22                                  *((volatile unsigned char*)(0x1256081158UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA23                                  *((volatile unsigned char*)(0x125608115CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA24                                  *((volatile unsigned char*)(0x1256081160UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA25                                  *((volatile unsigned char*)(0x1256081164UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA26                                  *((volatile unsigned char*)(0x1256081168UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA27                                  *((volatile unsigned char*)(0x125608116CUL))
#define bFM4_HSSPI_TXFIFO14_TXDATA28                                  *((volatile unsigned char*)(0x1256081170UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA29                                  *((volatile unsigned char*)(0x1256081174UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA30                                  *((volatile unsigned char*)(0x1256081178UL))
#define bFM4_HSSPI_TXFIFO14_TXDATA31                                  *((volatile unsigned char*)(0x125608117CUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA0                                   *((volatile unsigned char*)(0x1256081180UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA1                                   *((volatile unsigned char*)(0x1256081184UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA2                                   *((volatile unsigned char*)(0x1256081188UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA3                                   *((volatile unsigned char*)(0x125608118CUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA4                                   *((volatile unsigned char*)(0x1256081190UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA5                                   *((volatile unsigned char*)(0x1256081194UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA6                                   *((volatile unsigned char*)(0x1256081198UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA7                                   *((volatile unsigned char*)(0x125608119CUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA8                                   *((volatile unsigned char*)(0x12560811A0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA9                                   *((volatile unsigned char*)(0x12560811A4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA10                                  *((volatile unsigned char*)(0x12560811A8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA11                                  *((volatile unsigned char*)(0x12560811ACUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA12                                  *((volatile unsigned char*)(0x12560811B0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA13                                  *((volatile unsigned char*)(0x12560811B4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA14                                  *((volatile unsigned char*)(0x12560811B8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA15                                  *((volatile unsigned char*)(0x12560811BCUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA16                                  *((volatile unsigned char*)(0x12560811C0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA17                                  *((volatile unsigned char*)(0x12560811C4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA18                                  *((volatile unsigned char*)(0x12560811C8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA19                                  *((volatile unsigned char*)(0x12560811CCUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA20                                  *((volatile unsigned char*)(0x12560811D0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA21                                  *((volatile unsigned char*)(0x12560811D4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA22                                  *((volatile unsigned char*)(0x12560811D8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA23                                  *((volatile unsigned char*)(0x12560811DCUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA24                                  *((volatile unsigned char*)(0x12560811E0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA25                                  *((volatile unsigned char*)(0x12560811E4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA26                                  *((volatile unsigned char*)(0x12560811E8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA27                                  *((volatile unsigned char*)(0x12560811ECUL))
#define bFM4_HSSPI_TXFIFO15_TXDATA28                                  *((volatile unsigned char*)(0x12560811F0UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA29                                  *((volatile unsigned char*)(0x12560811F4UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA30                                  *((volatile unsigned char*)(0x12560811F8UL))
#define bFM4_HSSPI_TXFIFO15_TXDATA31                                  *((volatile unsigned char*)(0x12560811FCUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA0                                    *((volatile unsigned char*)(0x1256081200UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA1                                    *((volatile unsigned char*)(0x1256081204UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA2                                    *((volatile unsigned char*)(0x1256081208UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA3                                    *((volatile unsigned char*)(0x125608120CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA4                                    *((volatile unsigned char*)(0x1256081210UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA5                                    *((volatile unsigned char*)(0x1256081214UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA6                                    *((volatile unsigned char*)(0x1256081218UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA7                                    *((volatile unsigned char*)(0x125608121CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA8                                    *((volatile unsigned char*)(0x1256081220UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA9                                    *((volatile unsigned char*)(0x1256081224UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA10                                   *((volatile unsigned char*)(0x1256081228UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA11                                   *((volatile unsigned char*)(0x125608122CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA12                                   *((volatile unsigned char*)(0x1256081230UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA13                                   *((volatile unsigned char*)(0x1256081234UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA14                                   *((volatile unsigned char*)(0x1256081238UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA15                                   *((volatile unsigned char*)(0x125608123CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA16                                   *((volatile unsigned char*)(0x1256081240UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA17                                   *((volatile unsigned char*)(0x1256081244UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA18                                   *((volatile unsigned char*)(0x1256081248UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA19                                   *((volatile unsigned char*)(0x125608124CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA20                                   *((volatile unsigned char*)(0x1256081250UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA21                                   *((volatile unsigned char*)(0x1256081254UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA22                                   *((volatile unsigned char*)(0x1256081258UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA23                                   *((volatile unsigned char*)(0x125608125CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA24                                   *((volatile unsigned char*)(0x1256081260UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA25                                   *((volatile unsigned char*)(0x1256081264UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA26                                   *((volatile unsigned char*)(0x1256081268UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA27                                   *((volatile unsigned char*)(0x125608126CUL))
#define bFM4_HSSPI_RXFIFO0_RXDATA28                                   *((volatile unsigned char*)(0x1256081270UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA29                                   *((volatile unsigned char*)(0x1256081274UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA30                                   *((volatile unsigned char*)(0x1256081278UL))
#define bFM4_HSSPI_RXFIFO0_RXDATA31                                   *((volatile unsigned char*)(0x125608127CUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA0                                    *((volatile unsigned char*)(0x1256081280UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA1                                    *((volatile unsigned char*)(0x1256081284UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA2                                    *((volatile unsigned char*)(0x1256081288UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA3                                    *((volatile unsigned char*)(0x125608128CUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA4                                    *((volatile unsigned char*)(0x1256081290UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA5                                    *((volatile unsigned char*)(0x1256081294UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA6                                    *((volatile unsigned char*)(0x1256081298UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA7                                    *((volatile unsigned char*)(0x125608129CUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA8                                    *((volatile unsigned char*)(0x12560812A0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA9                                    *((volatile unsigned char*)(0x12560812A4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA10                                   *((volatile unsigned char*)(0x12560812A8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA11                                   *((volatile unsigned char*)(0x12560812ACUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA12                                   *((volatile unsigned char*)(0x12560812B0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA13                                   *((volatile unsigned char*)(0x12560812B4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA14                                   *((volatile unsigned char*)(0x12560812B8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA15                                   *((volatile unsigned char*)(0x12560812BCUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA16                                   *((volatile unsigned char*)(0x12560812C0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA17                                   *((volatile unsigned char*)(0x12560812C4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA18                                   *((volatile unsigned char*)(0x12560812C8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA19                                   *((volatile unsigned char*)(0x12560812CCUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA20                                   *((volatile unsigned char*)(0x12560812D0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA21                                   *((volatile unsigned char*)(0x12560812D4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA22                                   *((volatile unsigned char*)(0x12560812D8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA23                                   *((volatile unsigned char*)(0x12560812DCUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA24                                   *((volatile unsigned char*)(0x12560812E0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA25                                   *((volatile unsigned char*)(0x12560812E4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA26                                   *((volatile unsigned char*)(0x12560812E8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA27                                   *((volatile unsigned char*)(0x12560812ECUL))
#define bFM4_HSSPI_RXFIFO1_RXDATA28                                   *((volatile unsigned char*)(0x12560812F0UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA29                                   *((volatile unsigned char*)(0x12560812F4UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA30                                   *((volatile unsigned char*)(0x12560812F8UL))
#define bFM4_HSSPI_RXFIFO1_RXDATA31                                   *((volatile unsigned char*)(0x12560812FCUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA0                                    *((volatile unsigned char*)(0x1256081300UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA1                                    *((volatile unsigned char*)(0x1256081304UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA2                                    *((volatile unsigned char*)(0x1256081308UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA3                                    *((volatile unsigned char*)(0x125608130CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA4                                    *((volatile unsigned char*)(0x1256081310UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA5                                    *((volatile unsigned char*)(0x1256081314UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA6                                    *((volatile unsigned char*)(0x1256081318UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA7                                    *((volatile unsigned char*)(0x125608131CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA8                                    *((volatile unsigned char*)(0x1256081320UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA9                                    *((volatile unsigned char*)(0x1256081324UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA10                                   *((volatile unsigned char*)(0x1256081328UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA11                                   *((volatile unsigned char*)(0x125608132CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA12                                   *((volatile unsigned char*)(0x1256081330UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA13                                   *((volatile unsigned char*)(0x1256081334UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA14                                   *((volatile unsigned char*)(0x1256081338UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA15                                   *((volatile unsigned char*)(0x125608133CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA16                                   *((volatile unsigned char*)(0x1256081340UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA17                                   *((volatile unsigned char*)(0x1256081344UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA18                                   *((volatile unsigned char*)(0x1256081348UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA19                                   *((volatile unsigned char*)(0x125608134CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA20                                   *((volatile unsigned char*)(0x1256081350UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA21                                   *((volatile unsigned char*)(0x1256081354UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA22                                   *((volatile unsigned char*)(0x1256081358UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA23                                   *((volatile unsigned char*)(0x125608135CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA24                                   *((volatile unsigned char*)(0x1256081360UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA25                                   *((volatile unsigned char*)(0x1256081364UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA26                                   *((volatile unsigned char*)(0x1256081368UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA27                                   *((volatile unsigned char*)(0x125608136CUL))
#define bFM4_HSSPI_RXFIFO2_RXDATA28                                   *((volatile unsigned char*)(0x1256081370UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA29                                   *((volatile unsigned char*)(0x1256081374UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA30                                   *((volatile unsigned char*)(0x1256081378UL))
#define bFM4_HSSPI_RXFIFO2_RXDATA31                                   *((volatile unsigned char*)(0x125608137CUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA0                                    *((volatile unsigned char*)(0x1256081380UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA1                                    *((volatile unsigned char*)(0x1256081384UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA2                                    *((volatile unsigned char*)(0x1256081388UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA3                                    *((volatile unsigned char*)(0x125608138CUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA4                                    *((volatile unsigned char*)(0x1256081390UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA5                                    *((volatile unsigned char*)(0x1256081394UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA6                                    *((volatile unsigned char*)(0x1256081398UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA7                                    *((volatile unsigned char*)(0x125608139CUL))
