MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_RXFIFO3_RXDATA8                                    *((volatile unsigned char*)(0x12560813A0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA9                                    *((volatile unsigned char*)(0x12560813A4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA10                                   *((volatile unsigned char*)(0x12560813A8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA11                                   *((volatile unsigned char*)(0x12560813ACUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA12                                   *((volatile unsigned char*)(0x12560813B0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA13                                   *((volatile unsigned char*)(0x12560813B4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA14                                   *((volatile unsigned char*)(0x12560813B8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA15                                   *((volatile unsigned char*)(0x12560813BCUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA16                                   *((volatile unsigned char*)(0x12560813C0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA17                                   *((volatile unsigned char*)(0x12560813C4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA18                                   *((volatile unsigned char*)(0x12560813C8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA19                                   *((volatile unsigned char*)(0x12560813CCUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA20                                   *((volatile unsigned char*)(0x12560813D0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA21                                   *((volatile unsigned char*)(0x12560813D4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA22                                   *((volatile unsigned char*)(0x12560813D8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA23                                   *((volatile unsigned char*)(0x12560813DCUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA24                                   *((volatile unsigned char*)(0x12560813E0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA25                                   *((volatile unsigned char*)(0x12560813E4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA26                                   *((volatile unsigned char*)(0x12560813E8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA27                                   *((volatile unsigned char*)(0x12560813ECUL))
#define bFM4_HSSPI_RXFIFO3_RXDATA28                                   *((volatile unsigned char*)(0x12560813F0UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA29                                   *((volatile unsigned char*)(0x12560813F4UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA30                                   *((volatile unsigned char*)(0x12560813F8UL))
#define bFM4_HSSPI_RXFIFO3_RXDATA31                                   *((volatile unsigned char*)(0x12560813FCUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA0                                    *((volatile unsigned char*)(0x1256081400UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA1                                    *((volatile unsigned char*)(0x1256081404UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA2                                    *((volatile unsigned char*)(0x1256081408UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA3                                    *((volatile unsigned char*)(0x125608140CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA4                                    *((volatile unsigned char*)(0x1256081410UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA5                                    *((volatile unsigned char*)(0x1256081414UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA6                                    *((volatile unsigned char*)(0x1256081418UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA7                                    *((volatile unsigned char*)(0x125608141CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA8                                    *((volatile unsigned char*)(0x1256081420UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA9                                    *((volatile unsigned char*)(0x1256081424UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA10                                   *((volatile unsigned char*)(0x1256081428UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA11                                   *((volatile unsigned char*)(0x125608142CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA12                                   *((volatile unsigned char*)(0x1256081430UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA13                                   *((volatile unsigned char*)(0x1256081434UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA14                                   *((volatile unsigned char*)(0x1256081438UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA15                                   *((volatile unsigned char*)(0x125608143CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA16                                   *((volatile unsigned char*)(0x1256081440UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA17                                   *((volatile unsigned char*)(0x1256081444UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA18                                   *((volatile unsigned char*)(0x1256081448UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA19                                   *((volatile unsigned char*)(0x125608144CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA20                                   *((volatile unsigned char*)(0x1256081450UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA21                                   *((volatile unsigned char*)(0x1256081454UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA22                                   *((volatile unsigned char*)(0x1256081458UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA23                                   *((volatile unsigned char*)(0x125608145CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA24                                   *((volatile unsigned char*)(0x1256081460UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA25                                   *((volatile unsigned char*)(0x1256081464UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA26                                   *((volatile unsigned char*)(0x1256081468UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA27                                   *((volatile unsigned char*)(0x125608146CUL))
#define bFM4_HSSPI_RXFIFO4_RXDATA28                                   *((volatile unsigned char*)(0x1256081470UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA29                                   *((volatile unsigned char*)(0x1256081474UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA30                                   *((volatile unsigned char*)(0x1256081478UL))
#define bFM4_HSSPI_RXFIFO4_RXDATA31                                   *((volatile unsigned char*)(0x125608147CUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA0                                    *((volatile unsigned char*)(0x1256081480UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA1                                    *((volatile unsigned char*)(0x1256081484UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA2                                    *((volatile unsigned char*)(0x1256081488UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA3                                    *((volatile unsigned char*)(0x125608148CUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA4                                    *((volatile unsigned char*)(0x1256081490UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA5                                    *((volatile unsigned char*)(0x1256081494UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA6                                    *((volatile unsigned char*)(0x1256081498UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA7                                    *((volatile unsigned char*)(0x125608149CUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA8                                    *((volatile unsigned char*)(0x12560814A0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA9                                    *((volatile unsigned char*)(0x12560814A4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA10                                   *((volatile unsigned char*)(0x12560814A8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA11                                   *((volatile unsigned char*)(0x12560814ACUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA12                                   *((volatile unsigned char*)(0x12560814B0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA13                                   *((volatile unsigned char*)(0x12560814B4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA14                                   *((volatile unsigned char*)(0x12560814B8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA15                                   *((volatile unsigned char*)(0x12560814BCUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA16                                   *((volatile unsigned char*)(0x12560814C0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA17                                   *((volatile unsigned char*)(0x12560814C4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA18                                   *((volatile unsigned char*)(0x12560814C8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA19                                   *((volatile unsigned char*)(0x12560814CCUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA20                                   *((volatile unsigned char*)(0x12560814D0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA21                                   *((volatile unsigned char*)(0x12560814D4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA22                                   *((volatile unsigned char*)(0x12560814D8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA23                                   *((volatile unsigned char*)(0x12560814DCUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA24                                   *((volatile unsigned char*)(0x12560814E0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA25                                   *((volatile unsigned char*)(0x12560814E4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA26                                   *((volatile unsigned char*)(0x12560814E8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA27                                   *((volatile unsigned char*)(0x12560814ECUL))
#define bFM4_HSSPI_RXFIFO5_RXDATA28                                   *((volatile unsigned char*)(0x12560814F0UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA29                                   *((volatile unsigned char*)(0x12560814F4UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA30                                   *((volatile unsigned char*)(0x12560814F8UL))
#define bFM4_HSSPI_RXFIFO5_RXDATA31                                   *((volatile unsigned char*)(0x12560814FCUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA0                                    *((volatile unsigned char*)(0x1256081500UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA1                                    *((volatile unsigned char*)(0x1256081504UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA2                                    *((volatile unsigned char*)(0x1256081508UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA3                                    *((volatile unsigned char*)(0x125608150CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA4                                    *((volatile unsigned char*)(0x1256081510UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA5                                    *((volatile unsigned char*)(0x1256081514UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA6                                    *((volatile unsigned char*)(0x1256081518UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA7                                    *((volatile unsigned char*)(0x125608151CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA8                                    *((volatile unsigned char*)(0x1256081520UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA9                                    *((volatile unsigned char*)(0x1256081524UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA10                                   *((volatile unsigned char*)(0x1256081528UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA11                                   *((volatile unsigned char*)(0x125608152CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA12                                   *((volatile unsigned char*)(0x1256081530UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA13                                   *((volatile unsigned char*)(0x1256081534UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA14                                   *((volatile unsigned char*)(0x1256081538UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA15                                   *((volatile unsigned char*)(0x125608153CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA16                                   *((volatile unsigned char*)(0x1256081540UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA17                                   *((volatile unsigned char*)(0x1256081544UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA18                                   *((volatile unsigned char*)(0x1256081548UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA19                                   *((volatile unsigned char*)(0x125608154CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA20                                   *((volatile unsigned char*)(0x1256081550UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA21                                   *((volatile unsigned char*)(0x1256081554UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA22                                   *((volatile unsigned char*)(0x1256081558UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA23                                   *((volatile unsigned char*)(0x125608155CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA24                                   *((volatile unsigned char*)(0x1256081560UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA25                                   *((volatile unsigned char*)(0x1256081564UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA26                                   *((volatile unsigned char*)(0x1256081568UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA27                                   *((volatile unsigned char*)(0x125608156CUL))
#define bFM4_HSSPI_RXFIFO6_RXDATA28                                   *((volatile unsigned char*)(0x1256081570UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA29                                   *((volatile unsigned char*)(0x1256081574UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA30                                   *((volatile unsigned char*)(0x1256081578UL))
#define bFM4_HSSPI_RXFIFO6_RXDATA31                                   *((volatile unsigned char*)(0x125608157CUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA0                                    *((volatile unsigned char*)(0x1256081580UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA1                                    *((volatile unsigned char*)(0x1256081584UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA2                                    *((volatile unsigned char*)(0x1256081588UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA3                                    *((volatile unsigned char*)(0x125608158CUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA4                                    *((volatile unsigned char*)(0x1256081590UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA5                                    *((volatile unsigned char*)(0x1256081594UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA6                                    *((volatile unsigned char*)(0x1256081598UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA7                                    *((volatile unsigned char*)(0x125608159CUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA8                                    *((volatile unsigned char*)(0x12560815A0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA9                                    *((volatile unsigned char*)(0x12560815A4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA10                                   *((volatile unsigned char*)(0x12560815A8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA11                                   *((volatile unsigned char*)(0x12560815ACUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA12                                   *((volatile unsigned char*)(0x12560815B0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA13                                   *((volatile unsigned char*)(0x12560815B4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA14                                   *((volatile unsigned char*)(0x12560815B8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA15                                   *((volatile unsigned char*)(0x12560815BCUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA16                                   *((volatile unsigned char*)(0x12560815C0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA17                                   *((volatile unsigned char*)(0x12560815C4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA18                                   *((volatile unsigned char*)(0x12560815C8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA19                                   *((volatile unsigned char*)(0x12560815CCUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA20                                   *((volatile unsigned char*)(0x12560815D0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA21                                   *((volatile unsigned char*)(0x12560815D4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA22                                   *((volatile unsigned char*)(0x12560815D8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA23                                   *((volatile unsigned char*)(0x12560815DCUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA24                                   *((volatile unsigned char*)(0x12560815E0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA25                                   *((volatile unsigned char*)(0x12560815E4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA26                                   *((volatile unsigned char*)(0x12560815E8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA27                                   *((volatile unsigned char*)(0x12560815ECUL))
#define bFM4_HSSPI_RXFIFO7_RXDATA28                                   *((volatile unsigned char*)(0x12560815F0UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA29                                   *((volatile unsigned char*)(0x12560815F4UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA30                                   *((volatile unsigned char*)(0x12560815F8UL))
#define bFM4_HSSPI_RXFIFO7_RXDATA31                                   *((volatile unsigned char*)(0x12560815FCUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA0                                    *((volatile unsigned char*)(0x1256081600UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA1                                    *((volatile unsigned char*)(0x1256081604UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA2                                    *((volatile unsigned char*)(0x1256081608UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA3                                    *((volatile unsigned char*)(0x125608160CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA4                                    *((volatile unsigned char*)(0x1256081610UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA5                                    *((volatile unsigned char*)(0x1256081614UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA6                                    *((volatile unsigned char*)(0x1256081618UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA7                                    *((volatile unsigned char*)(0x125608161CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA8                                    *((volatile unsigned char*)(0x1256081620UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA9                                    *((volatile unsigned char*)(0x1256081624UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA10                                   *((volatile unsigned char*)(0x1256081628UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA11                                   *((volatile unsigned char*)(0x125608162CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA12                                   *((volatile unsigned char*)(0x1256081630UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA13                                   *((volatile unsigned char*)(0x1256081634UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA14                                   *((volatile unsigned char*)(0x1256081638UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA15                                   *((volatile unsigned char*)(0x125608163CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA16                                   *((volatile unsigned char*)(0x1256081640UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA17                                   *((volatile unsigned char*)(0x1256081644UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA18                                   *((volatile unsigned char*)(0x1256081648UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA19                                   *((volatile unsigned char*)(0x125608164CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA20                                   *((volatile unsigned char*)(0x1256081650UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA21                                   *((volatile unsigned char*)(0x1256081654UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA22                                   *((volatile unsigned char*)(0x1256081658UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA23                                   *((volatile unsigned char*)(0x125608165CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA24                                   *((volatile unsigned char*)(0x1256081660UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA25                                   *((volatile unsigned char*)(0x1256081664UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA26                                   *((volatile unsigned char*)(0x1256081668UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA27                                   *((volatile unsigned char*)(0x125608166CUL))
#define bFM4_HSSPI_RXFIFO8_RXDATA28                                   *((volatile unsigned char*)(0x1256081670UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA29                                   *((volatile unsigned char*)(0x1256081674UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA30                                   *((volatile unsigned char*)(0x1256081678UL))
#define bFM4_HSSPI_RXFIFO8_RXDATA31                                   *((volatile unsigned char*)(0x125608167CUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA0                                    *((volatile unsigned char*)(0x1256081680UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA1                                    *((volatile unsigned char*)(0x1256081684UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA2                                    *((volatile unsigned char*)(0x1256081688UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA3                                    *((volatile unsigned char*)(0x125608168CUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA4                                    *((volatile unsigned char*)(0x1256081690UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA5                                    *((volatile unsigned char*)(0x1256081694UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA6                                    *((volatile unsigned char*)(0x1256081698UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA7                                    *((volatile unsigned char*)(0x125608169CUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA8                                    *((volatile unsigned char*)(0x12560816A0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA9                                    *((volatile unsigned char*)(0x12560816A4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA10                                   *((volatile unsigned char*)(0x12560816A8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA11                                   *((volatile unsigned char*)(0x12560816ACUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA12                                   *((volatile unsigned char*)(0x12560816B0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA13                                   *((volatile unsigned char*)(0x12560816B4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA14                                   *((volatile unsigned char*)(0x12560816B8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA15                                   *((volatile unsigned char*)(0x12560816BCUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA16                                   *((volatile unsigned char*)(0x12560816C0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA17                                   *((volatile unsigned char*)(0x12560816C4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA18                                   *((volatile unsigned char*)(0x12560816C8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA19                                   *((volatile unsigned char*)(0x12560816CCUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA20                                   *((volatile unsigned char*)(0x12560816D0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA21                                   *((volatile unsigned char*)(0x12560816D4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA22                                   *((volatile unsigned char*)(0x12560816D8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA23                                   *((volatile unsigned char*)(0x12560816DCUL))
