MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_RXFIFO9_RXDATA24                                   *((volatile unsigned char*)(0x12560816E0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA25                                   *((volatile unsigned char*)(0x12560816E4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA26                                   *((volatile unsigned char*)(0x12560816E8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA27                                   *((volatile unsigned char*)(0x12560816ECUL))
#define bFM4_HSSPI_RXFIFO9_RXDATA28                                   *((volatile unsigned char*)(0x12560816F0UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA29                                   *((volatile unsigned char*)(0x12560816F4UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA30                                   *((volatile unsigned char*)(0x12560816F8UL))
#define bFM4_HSSPI_RXFIFO9_RXDATA31                                   *((volatile unsigned char*)(0x12560816FCUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA0                                   *((volatile unsigned char*)(0x1256081700UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA1                                   *((volatile unsigned char*)(0x1256081704UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA2                                   *((volatile unsigned char*)(0x1256081708UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA3                                   *((volatile unsigned char*)(0x125608170CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA4                                   *((volatile unsigned char*)(0x1256081710UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA5                                   *((volatile unsigned char*)(0x1256081714UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA6                                   *((volatile unsigned char*)(0x1256081718UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA7                                   *((volatile unsigned char*)(0x125608171CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA8                                   *((volatile unsigned char*)(0x1256081720UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA9                                   *((volatile unsigned char*)(0x1256081724UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA10                                  *((volatile unsigned char*)(0x1256081728UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA11                                  *((volatile unsigned char*)(0x125608172CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA12                                  *((volatile unsigned char*)(0x1256081730UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA13                                  *((volatile unsigned char*)(0x1256081734UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA14                                  *((volatile unsigned char*)(0x1256081738UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA15                                  *((volatile unsigned char*)(0x125608173CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA16                                  *((volatile unsigned char*)(0x1256081740UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA17                                  *((volatile unsigned char*)(0x1256081744UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA18                                  *((volatile unsigned char*)(0x1256081748UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA19                                  *((volatile unsigned char*)(0x125608174CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA20                                  *((volatile unsigned char*)(0x1256081750UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA21                                  *((volatile unsigned char*)(0x1256081754UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA22                                  *((volatile unsigned char*)(0x1256081758UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA23                                  *((volatile unsigned char*)(0x125608175CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA24                                  *((volatile unsigned char*)(0x1256081760UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA25                                  *((volatile unsigned char*)(0x1256081764UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA26                                  *((volatile unsigned char*)(0x1256081768UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA27                                  *((volatile unsigned char*)(0x125608176CUL))
#define bFM4_HSSPI_RXFIFO10_RXDATA28                                  *((volatile unsigned char*)(0x1256081770UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA29                                  *((volatile unsigned char*)(0x1256081774UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA30                                  *((volatile unsigned char*)(0x1256081778UL))
#define bFM4_HSSPI_RXFIFO10_RXDATA31                                  *((volatile unsigned char*)(0x125608177CUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA0                                   *((volatile unsigned char*)(0x1256081780UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA1                                   *((volatile unsigned char*)(0x1256081784UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA2                                   *((volatile unsigned char*)(0x1256081788UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA3                                   *((volatile unsigned char*)(0x125608178CUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA4                                   *((volatile unsigned char*)(0x1256081790UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA5                                   *((volatile unsigned char*)(0x1256081794UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA6                                   *((volatile unsigned char*)(0x1256081798UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA7                                   *((volatile unsigned char*)(0x125608179CUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA8                                   *((volatile unsigned char*)(0x12560817A0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA9                                   *((volatile unsigned char*)(0x12560817A4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA10                                  *((volatile unsigned char*)(0x12560817A8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA11                                  *((volatile unsigned char*)(0x12560817ACUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA12                                  *((volatile unsigned char*)(0x12560817B0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA13                                  *((volatile unsigned char*)(0x12560817B4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA14                                  *((volatile unsigned char*)(0x12560817B8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA15                                  *((volatile unsigned char*)(0x12560817BCUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA16                                  *((volatile unsigned char*)(0x12560817C0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA17                                  *((volatile unsigned char*)(0x12560817C4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA18                                  *((volatile unsigned char*)(0x12560817C8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA19                                  *((volatile unsigned char*)(0x12560817CCUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA20                                  *((volatile unsigned char*)(0x12560817D0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA21                                  *((volatile unsigned char*)(0x12560817D4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA22                                  *((volatile unsigned char*)(0x12560817D8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA23                                  *((volatile unsigned char*)(0x12560817DCUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA24                                  *((volatile unsigned char*)(0x12560817E0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA25                                  *((volatile unsigned char*)(0x12560817E4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA26                                  *((volatile unsigned char*)(0x12560817E8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA27                                  *((volatile unsigned char*)(0x12560817ECUL))
#define bFM4_HSSPI_RXFIFO11_RXDATA28                                  *((volatile unsigned char*)(0x12560817F0UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA29                                  *((volatile unsigned char*)(0x12560817F4UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA30                                  *((volatile unsigned char*)(0x12560817F8UL))
#define bFM4_HSSPI_RXFIFO11_RXDATA31                                  *((volatile unsigned char*)(0x12560817FCUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA0                                   *((volatile unsigned char*)(0x1256081800UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA1                                   *((volatile unsigned char*)(0x1256081804UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA2                                   *((volatile unsigned char*)(0x1256081808UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA3                                   *((volatile unsigned char*)(0x125608180CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA4                                   *((volatile unsigned char*)(0x1256081810UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA5                                   *((volatile unsigned char*)(0x1256081814UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA6                                   *((volatile unsigned char*)(0x1256081818UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA7                                   *((volatile unsigned char*)(0x125608181CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA8                                   *((volatile unsigned char*)(0x1256081820UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA9                                   *((volatile unsigned char*)(0x1256081824UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA10                                  *((volatile unsigned char*)(0x1256081828UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA11                                  *((volatile unsigned char*)(0x125608182CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA12                                  *((volatile unsigned char*)(0x1256081830UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA13                                  *((volatile unsigned char*)(0x1256081834UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA14                                  *((volatile unsigned char*)(0x1256081838UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA15                                  *((volatile unsigned char*)(0x125608183CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA16                                  *((volatile unsigned char*)(0x1256081840UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA17                                  *((volatile unsigned char*)(0x1256081844UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA18                                  *((volatile unsigned char*)(0x1256081848UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA19                                  *((volatile unsigned char*)(0x125608184CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA20                                  *((volatile unsigned char*)(0x1256081850UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA21                                  *((volatile unsigned char*)(0x1256081854UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA22                                  *((volatile unsigned char*)(0x1256081858UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA23                                  *((volatile unsigned char*)(0x125608185CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA24                                  *((volatile unsigned char*)(0x1256081860UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA25                                  *((volatile unsigned char*)(0x1256081864UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA26                                  *((volatile unsigned char*)(0x1256081868UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA27                                  *((volatile unsigned char*)(0x125608186CUL))
#define bFM4_HSSPI_RXFIFO12_RXDATA28                                  *((volatile unsigned char*)(0x1256081870UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA29                                  *((volatile unsigned char*)(0x1256081874UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA30                                  *((volatile unsigned char*)(0x1256081878UL))
#define bFM4_HSSPI_RXFIFO12_RXDATA31                                  *((volatile unsigned char*)(0x125608187CUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA0                                   *((volatile unsigned char*)(0x1256081880UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA1                                   *((volatile unsigned char*)(0x1256081884UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA2                                   *((volatile unsigned char*)(0x1256081888UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA3                                   *((volatile unsigned char*)(0x125608188CUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA4                                   *((volatile unsigned char*)(0x1256081890UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA5                                   *((volatile unsigned char*)(0x1256081894UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA6                                   *((volatile unsigned char*)(0x1256081898UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA7                                   *((volatile unsigned char*)(0x125608189CUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA8                                   *((volatile unsigned char*)(0x12560818A0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA9                                   *((volatile unsigned char*)(0x12560818A4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA10                                  *((volatile unsigned char*)(0x12560818A8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA11                                  *((volatile unsigned char*)(0x12560818ACUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA12                                  *((volatile unsigned char*)(0x12560818B0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA13                                  *((volatile unsigned char*)(0x12560818B4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA14                                  *((volatile unsigned char*)(0x12560818B8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA15                                  *((volatile unsigned char*)(0x12560818BCUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA16                                  *((volatile unsigned char*)(0x12560818C0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA17                                  *((volatile unsigned char*)(0x12560818C4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA18                                  *((volatile unsigned char*)(0x12560818C8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA19                                  *((volatile unsigned char*)(0x12560818CCUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA20                                  *((volatile unsigned char*)(0x12560818D0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA21                                  *((volatile unsigned char*)(0x12560818D4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA22                                  *((volatile unsigned char*)(0x12560818D8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA23                                  *((volatile unsigned char*)(0x12560818DCUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA24                                  *((volatile unsigned char*)(0x12560818E0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA25                                  *((volatile unsigned char*)(0x12560818E4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA26                                  *((volatile unsigned char*)(0x12560818E8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA27                                  *((volatile unsigned char*)(0x12560818ECUL))
#define bFM4_HSSPI_RXFIFO13_RXDATA28                                  *((volatile unsigned char*)(0x12560818F0UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA29                                  *((volatile unsigned char*)(0x12560818F4UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA30                                  *((volatile unsigned char*)(0x12560818F8UL))
#define bFM4_HSSPI_RXFIFO13_RXDATA31                                  *((volatile unsigned char*)(0x12560818FCUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA0                                   *((volatile unsigned char*)(0x1256081900UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA1                                   *((volatile unsigned char*)(0x1256081904UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA2                                   *((volatile unsigned char*)(0x1256081908UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA3                                   *((volatile unsigned char*)(0x125608190CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA4                                   *((volatile unsigned char*)(0x1256081910UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA5                                   *((volatile unsigned char*)(0x1256081914UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA6                                   *((volatile unsigned char*)(0x1256081918UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA7                                   *((volatile unsigned char*)(0x125608191CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA8                                   *((volatile unsigned char*)(0x1256081920UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA9                                   *((volatile unsigned char*)(0x1256081924UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA10                                  *((volatile unsigned char*)(0x1256081928UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA11                                  *((volatile unsigned char*)(0x125608192CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA12                                  *((volatile unsigned char*)(0x1256081930UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA13                                  *((volatile unsigned char*)(0x1256081934UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA14                                  *((volatile unsigned char*)(0x1256081938UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA15                                  *((volatile unsigned char*)(0x125608193CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA16                                  *((volatile unsigned char*)(0x1256081940UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA17                                  *((volatile unsigned char*)(0x1256081944UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA18                                  *((volatile unsigned char*)(0x1256081948UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA19                                  *((volatile unsigned char*)(0x125608194CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA20                                  *((volatile unsigned char*)(0x1256081950UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA21                                  *((volatile unsigned char*)(0x1256081954UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA22                                  *((volatile unsigned char*)(0x1256081958UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA23                                  *((volatile unsigned char*)(0x125608195CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA24                                  *((volatile unsigned char*)(0x1256081960UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA25                                  *((volatile unsigned char*)(0x1256081964UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA26                                  *((volatile unsigned char*)(0x1256081968UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA27                                  *((volatile unsigned char*)(0x125608196CUL))
#define bFM4_HSSPI_RXFIFO14_RXDATA28                                  *((volatile unsigned char*)(0x1256081970UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA29                                  *((volatile unsigned char*)(0x1256081974UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA30                                  *((volatile unsigned char*)(0x1256081978UL))
#define bFM4_HSSPI_RXFIFO14_RXDATA31                                  *((volatile unsigned char*)(0x125608197CUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA0                                   *((volatile unsigned char*)(0x1256081980UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA1                                   *((volatile unsigned char*)(0x1256081984UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA2                                   *((volatile unsigned char*)(0x1256081988UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA3                                   *((volatile unsigned char*)(0x125608198CUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA4                                   *((volatile unsigned char*)(0x1256081990UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA5                                   *((volatile unsigned char*)(0x1256081994UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA6                                   *((volatile unsigned char*)(0x1256081998UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA7                                   *((volatile unsigned char*)(0x125608199CUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA8                                   *((volatile unsigned char*)(0x12560819A0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA9                                   *((volatile unsigned char*)(0x12560819A4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA10                                  *((volatile unsigned char*)(0x12560819A8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA11                                  *((volatile unsigned char*)(0x12560819ACUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA12                                  *((volatile unsigned char*)(0x12560819B0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA13                                  *((volatile unsigned char*)(0x12560819B4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA14                                  *((volatile unsigned char*)(0x12560819B8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA15                                  *((volatile unsigned char*)(0x12560819BCUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA16                                  *((volatile unsigned char*)(0x12560819C0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA17                                  *((volatile unsigned char*)(0x12560819C4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA18                                  *((volatile unsigned char*)(0x12560819C8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA19                                  *((volatile unsigned char*)(0x12560819CCUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA20                                  *((volatile unsigned char*)(0x12560819D0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA21                                  *((volatile unsigned char*)(0x12560819D4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA22                                  *((volatile unsigned char*)(0x12560819D8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA23                                  *((volatile unsigned char*)(0x12560819DCUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA24                                  *((volatile unsigned char*)(0x12560819E0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA25                                  *((volatile unsigned char*)(0x12560819E4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA26                                  *((volatile unsigned char*)(0x12560819E8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA27                                  *((volatile unsigned char*)(0x12560819ECUL))
#define bFM4_HSSPI_RXFIFO15_RXDATA28                                  *((volatile unsigned char*)(0x12560819F0UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA29                                  *((volatile unsigned char*)(0x12560819F4UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA30                                  *((volatile unsigned char*)(0x12560819F8UL))
#define bFM4_HSSPI_RXFIFO15_RXDATA31                                  *((volatile unsigned char*)(0x12560819FCUL))
#define bFM4_HSSPI_CSCFG_SRAM                                         *((volatile unsigned char*)(0x1256081A00UL))
#define bFM4_HSSPI_CSCFG_MBM0                                         *((volatile unsigned char*)(0x1256081A04UL))
#define bFM4_HSSPI_CSCFG_MBM1                                         *((volatile unsigned char*)(0x1256081A08UL))
#define bFM4_HSSPI_CSCFG_SSEL0EN                                      *((volatile unsigned char*)(0x1256081A20UL))
#define bFM4_HSSPI_CSCFG_SSEL1EN                                      *((volatile unsigned char*)(0x1256081A24UL))
#define bFM4_HSSPI_CSCFG_SSEL2EN                                      *((volatile unsigned char*)(0x1256081A28UL))
#define bFM4_HSSPI_CSCFG_SSEL3EN                                      *((volatile unsigned char*)(0x1256081A2CUL))
#define bFM4_HSSPI_CSCFG_MSEL0                                        *((volatile unsigned char*)(0x1256081A40UL))
