MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_CSCFG_MSEL1                                        *((volatile unsigned char*)(0x1256081A44UL))
#define bFM4_HSSPI_CSCFG_MSEL2                                        *((volatile unsigned char*)(0x1256081A48UL))
#define bFM4_HSSPI_CSCFG_MSEL3                                        *((volatile unsigned char*)(0x1256081A4CUL))
#define bFM4_HSSPI_CSITIME_ITIME0                                     *((volatile unsigned char*)(0x1256081A80UL))
#define bFM4_HSSPI_CSITIME_ITIME1                                     *((volatile unsigned char*)(0x1256081A84UL))
#define bFM4_HSSPI_CSITIME_ITIME2                                     *((volatile unsigned char*)(0x1256081A88UL))
#define bFM4_HSSPI_CSITIME_ITIME3                                     *((volatile unsigned char*)(0x1256081A8CUL))
#define bFM4_HSSPI_CSITIME_ITIME4                                     *((volatile unsigned char*)(0x1256081A90UL))
#define bFM4_HSSPI_CSITIME_ITIME5                                     *((volatile unsigned char*)(0x1256081A94UL))
#define bFM4_HSSPI_CSITIME_ITIME6                                     *((volatile unsigned char*)(0x1256081A98UL))
#define bFM4_HSSPI_CSITIME_ITIME7                                     *((volatile unsigned char*)(0x1256081A9CUL))
#define bFM4_HSSPI_CSITIME_ITIME8                                     *((volatile unsigned char*)(0x1256081AA0UL))
#define bFM4_HSSPI_CSITIME_ITIME9                                     *((volatile unsigned char*)(0x1256081AA4UL))
#define bFM4_HSSPI_CSITIME_ITIME10                                    *((volatile unsigned char*)(0x1256081AA8UL))
#define bFM4_HSSPI_CSITIME_ITIME11                                    *((volatile unsigned char*)(0x1256081AACUL))
#define bFM4_HSSPI_CSITIME_ITIME12                                    *((volatile unsigned char*)(0x1256081AB0UL))
#define bFM4_HSSPI_CSITIME_ITIME13                                    *((volatile unsigned char*)(0x1256081AB4UL))
#define bFM4_HSSPI_CSITIME_ITIME14                                    *((volatile unsigned char*)(0x1256081AB8UL))
#define bFM4_HSSPI_CSITIME_ITIME15                                    *((volatile unsigned char*)(0x1256081ABCUL))
#define bFM4_HSSPI_CSAEXT_AEXT0                                       *((volatile unsigned char*)(0x1256081B34UL))
#define bFM4_HSSPI_CSAEXT_AEXT1                                       *((volatile unsigned char*)(0x1256081B38UL))
#define bFM4_HSSPI_CSAEXT_AEXT2                                       *((volatile unsigned char*)(0x1256081B3CUL))
#define bFM4_HSSPI_CSAEXT_AEXT3                                       *((volatile unsigned char*)(0x1256081B40UL))
#define bFM4_HSSPI_CSAEXT_AEXT4                                       *((volatile unsigned char*)(0x1256081B44UL))
#define bFM4_HSSPI_CSAEXT_AEXT5                                       *((volatile unsigned char*)(0x1256081B48UL))
#define bFM4_HSSPI_CSAEXT_AEXT6                                       *((volatile unsigned char*)(0x1256081B4CUL))
#define bFM4_HSSPI_CSAEXT_AEXT7                                       *((volatile unsigned char*)(0x1256081B50UL))
#define bFM4_HSSPI_CSAEXT_AEXT8                                       *((volatile unsigned char*)(0x1256081B54UL))
#define bFM4_HSSPI_CSAEXT_AEXT9                                       *((volatile unsigned char*)(0x1256081B58UL))
#define bFM4_HSSPI_CSAEXT_AEXT10                                      *((volatile unsigned char*)(0x1256081B5CUL))
#define bFM4_HSSPI_CSAEXT_AEXT11                                      *((volatile unsigned char*)(0x1256081B60UL))
#define bFM4_HSSPI_CSAEXT_AEXT12                                      *((volatile unsigned char*)(0x1256081B64UL))
#define bFM4_HSSPI_CSAEXT_AEXT13                                      *((volatile unsigned char*)(0x1256081B68UL))
#define bFM4_HSSPI_CSAEXT_AEXT14                                      *((volatile unsigned char*)(0x1256081B6CUL))
#define bFM4_HSSPI_CSAEXT_AEXT15                                      *((volatile unsigned char*)(0x1256081B70UL))
#define bFM4_HSSPI_CSAEXT_AEXT16                                      *((volatile unsigned char*)(0x1256081B74UL))
#define bFM4_HSSPI_CSAEXT_AEXT17                                      *((volatile unsigned char*)(0x1256081B78UL))
#define bFM4_HSSPI_CSAEXT_AEXT18                                      *((volatile unsigned char*)(0x1256081B7CUL))
#define bFM4_HSSPI_RDCSDC0_DEC                                        *((volatile unsigned char*)(0x1256081B80UL))
#define bFM4_HSSPI_RDCSDC0_TRP0                                       *((volatile unsigned char*)(0x1256081B84UL))
#define bFM4_HSSPI_RDCSDC0_TRP1                                       *((volatile unsigned char*)(0x1256081B88UL))
#define bFM4_HSSPI_RDCSDC0_CONT                                       *((volatile unsigned char*)(0x1256081B8CUL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081BA0UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081BA4UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081BA8UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081BACUL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081BB0UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081BB4UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081BB8UL))
#define bFM4_HSSPI_RDCSDC0_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081BBCUL))
#define bFM4_HSSPI_RDCSDC1_DEC                                        *((volatile unsigned char*)(0x1256081BC0UL))
#define bFM4_HSSPI_RDCSDC1_TRP0                                       *((volatile unsigned char*)(0x1256081BC4UL))
#define bFM4_HSSPI_RDCSDC1_TRP1                                       *((volatile unsigned char*)(0x1256081BC8UL))
#define bFM4_HSSPI_RDCSDC1_CONT                                       *((volatile unsigned char*)(0x1256081BCCUL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081BE0UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081BE4UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081BE8UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081BECUL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081BF0UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081BF4UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081BF8UL))
#define bFM4_HSSPI_RDCSDC1_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081BFCUL))
#define bFM4_HSSPI_RDCSDC2_DEC                                        *((volatile unsigned char*)(0x1256081C00UL))
#define bFM4_HSSPI_RDCSDC2_TRP0                                       *((volatile unsigned char*)(0x1256081C04UL))
#define bFM4_HSSPI_RDCSDC2_TRP1                                       *((volatile unsigned char*)(0x1256081C08UL))
#define bFM4_HSSPI_RDCSDC2_CONT                                       *((volatile unsigned char*)(0x1256081C0CUL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081C20UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081C24UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081C28UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081C2CUL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081C30UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081C34UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081C38UL))
#define bFM4_HSSPI_RDCSDC2_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081C3CUL))
#define bFM4_HSSPI_RDCSDC3_DEC                                        *((volatile unsigned char*)(0x1256081C40UL))
#define bFM4_HSSPI_RDCSDC3_TRP0                                       *((volatile unsigned char*)(0x1256081C44UL))
#define bFM4_HSSPI_RDCSDC3_TRP1                                       *((volatile unsigned char*)(0x1256081C48UL))
#define bFM4_HSSPI_RDCSDC3_CONT                                       *((volatile unsigned char*)(0x1256081C4CUL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081C60UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081C64UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081C68UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081C6CUL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081C70UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081C74UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081C78UL))
#define bFM4_HSSPI_RDCSDC3_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081C7CUL))
#define bFM4_HSSPI_RDCSDC4_DEC                                        *((volatile unsigned char*)(0x1256081C80UL))
#define bFM4_HSSPI_RDCSDC4_TRP0                                       *((volatile unsigned char*)(0x1256081C84UL))
#define bFM4_HSSPI_RDCSDC4_TRP1                                       *((volatile unsigned char*)(0x1256081C88UL))
#define bFM4_HSSPI_RDCSDC4_CONT                                       *((volatile unsigned char*)(0x1256081C8CUL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081CA0UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081CA4UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081CA8UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081CACUL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081CB0UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081CB4UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081CB8UL))
#define bFM4_HSSPI_RDCSDC4_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081CBCUL))
#define bFM4_HSSPI_RDCSDC5_DEC                                        *((volatile unsigned char*)(0x1256081CC0UL))
#define bFM4_HSSPI_RDCSDC5_TRP0                                       *((volatile unsigned char*)(0x1256081CC4UL))
#define bFM4_HSSPI_RDCSDC5_TRP1                                       *((volatile unsigned char*)(0x1256081CC8UL))
#define bFM4_HSSPI_RDCSDC5_CONT                                       *((volatile unsigned char*)(0x1256081CCCUL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081CE0UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081CE4UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081CE8UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081CECUL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081CF0UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081CF4UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081CF8UL))
#define bFM4_HSSPI_RDCSDC5_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081CFCUL))
#define bFM4_HSSPI_RDCSDC6_DEC                                        *((volatile unsigned char*)(0x1256081D00UL))
#define bFM4_HSSPI_RDCSDC6_TRP0                                       *((volatile unsigned char*)(0x1256081D04UL))
#define bFM4_HSSPI_RDCSDC6_TRP1                                       *((volatile unsigned char*)(0x1256081D08UL))
#define bFM4_HSSPI_RDCSDC6_CONT                                       *((volatile unsigned char*)(0x1256081D0CUL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081D20UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081D24UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081D28UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081D2CUL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081D30UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081D34UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081D38UL))
#define bFM4_HSSPI_RDCSDC6_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081D3CUL))
#define bFM4_HSSPI_RDCSDC7_DEC                                        *((volatile unsigned char*)(0x1256081D40UL))
#define bFM4_HSSPI_RDCSDC7_TRP0                                       *((volatile unsigned char*)(0x1256081D44UL))
#define bFM4_HSSPI_RDCSDC7_TRP1                                       *((volatile unsigned char*)(0x1256081D48UL))
#define bFM4_HSSPI_RDCSDC7_CONT                                       *((volatile unsigned char*)(0x1256081D4CUL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA0                                  *((volatile unsigned char*)(0x1256081D60UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA1                                  *((volatile unsigned char*)(0x1256081D64UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA2                                  *((volatile unsigned char*)(0x1256081D68UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA3                                  *((volatile unsigned char*)(0x1256081D6CUL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA4                                  *((volatile unsigned char*)(0x1256081D70UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA5                                  *((volatile unsigned char*)(0x1256081D74UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA6                                  *((volatile unsigned char*)(0x1256081D78UL))
#define bFM4_HSSPI_RDCSDC7_RDCSDATA7                                  *((volatile unsigned char*)(0x1256081D7CUL))
#define bFM4_HSSPI_WRCSDC0_DEC                                        *((volatile unsigned char*)(0x1256081D80UL))
#define bFM4_HSSPI_WRCSDC0_TRP0                                       *((volatile unsigned char*)(0x1256081D84UL))
#define bFM4_HSSPI_WRCSDC0_TRP1                                       *((volatile unsigned char*)(0x1256081D88UL))
#define bFM4_HSSPI_WRCSDC0_CONT                                       *((volatile unsigned char*)(0x1256081D8CUL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081DA0UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081DA4UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081DA8UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081DACUL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081DB0UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081DB4UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081DB8UL))
#define bFM4_HSSPI_WRCSDC0_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081DBCUL))
#define bFM4_HSSPI_WRCSDC1_DEC                                        *((volatile unsigned char*)(0x1256081DC0UL))
#define bFM4_HSSPI_WRCSDC1_TRP0                                       *((volatile unsigned char*)(0x1256081DC4UL))
#define bFM4_HSSPI_WRCSDC1_TRP1                                       *((volatile unsigned char*)(0x1256081DC8UL))
#define bFM4_HSSPI_WRCSDC1_CONT                                       *((volatile unsigned char*)(0x1256081DCCUL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081DE0UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081DE4UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081DE8UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081DECUL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081DF0UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081DF4UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081DF8UL))
#define bFM4_HSSPI_WRCSDC1_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081DFCUL))
#define bFM4_HSSPI_WRCSDC2_DEC                                        *((volatile unsigned char*)(0x1256081E00UL))
#define bFM4_HSSPI_WRCSDC2_TRP0                                       *((volatile unsigned char*)(0x1256081E04UL))
#define bFM4_HSSPI_WRCSDC2_TRP1                                       *((volatile unsigned char*)(0x1256081E08UL))
#define bFM4_HSSPI_WRCSDC2_CONT                                       *((volatile unsigned char*)(0x1256081E0CUL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081E20UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081E24UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081E28UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081E2CUL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081E30UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081E34UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081E38UL))
#define bFM4_HSSPI_WRCSDC2_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081E3CUL))
#define bFM4_HSSPI_WRCSDC3_DEC                                        *((volatile unsigned char*)(0x1256081E40UL))
#define bFM4_HSSPI_WRCSDC3_TRP0                                       *((volatile unsigned char*)(0x1256081E44UL))
#define bFM4_HSSPI_WRCSDC3_TRP1                                       *((volatile unsigned char*)(0x1256081E48UL))
#define bFM4_HSSPI_WRCSDC3_CONT                                       *((volatile unsigned char*)(0x1256081E4CUL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081E60UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081E64UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081E68UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081E6CUL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081E70UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081E74UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081E78UL))
#define bFM4_HSSPI_WRCSDC3_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081E7CUL))
#define bFM4_HSSPI_WRCSDC4_DEC                                        *((volatile unsigned char*)(0x1256081E80UL))
#define bFM4_HSSPI_WRCSDC4_TRP0                                       *((volatile unsigned char*)(0x1256081E84UL))
#define bFM4_HSSPI_WRCSDC4_TRP1                                       *((volatile unsigned char*)(0x1256081E88UL))
#define bFM4_HSSPI_WRCSDC4_CONT                                       *((volatile unsigned char*)(0x1256081E8CUL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081EA0UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081EA4UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081EA8UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081EACUL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081EB0UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081EB4UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081EB8UL))
#define bFM4_HSSPI_WRCSDC4_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081EBCUL))
#define bFM4_HSSPI_WRCSDC5_DEC                                        *((volatile unsigned char*)(0x1256081EC0UL))
#define bFM4_HSSPI_WRCSDC5_TRP0                                       *((volatile unsigned char*)(0x1256081EC4UL))
#define bFM4_HSSPI_WRCSDC5_TRP1                                       *((volatile unsigned char*)(0x1256081EC8UL))
#define bFM4_HSSPI_WRCSDC5_CONT                                       *((volatile unsigned char*)(0x1256081ECCUL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081EE0UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081EE4UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081EE8UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081EECUL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081EF0UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081EF4UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081EF8UL))
#define bFM4_HSSPI_WRCSDC5_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081EFCUL))
#define bFM4_HSSPI_WRCSDC6_DEC                                        *((volatile unsigned char*)(0x1256081F00UL))
#define bFM4_HSSPI_WRCSDC6_TRP0                                       *((volatile unsigned char*)(0x1256081F04UL))
