MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_HSSPI_WRCSDC6_TRP1                                       *((volatile unsigned char*)(0x1256081F08UL))
#define bFM4_HSSPI_WRCSDC6_CONT                                       *((volatile unsigned char*)(0x1256081F0CUL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081F20UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081F24UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081F28UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081F2CUL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081F30UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081F34UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081F38UL))
#define bFM4_HSSPI_WRCSDC6_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081F3CUL))
#define bFM4_HSSPI_WRCSDC7_DEC                                        *((volatile unsigned char*)(0x1256081F40UL))
#define bFM4_HSSPI_WRCSDC7_TRP0                                       *((volatile unsigned char*)(0x1256081F44UL))
#define bFM4_HSSPI_WRCSDC7_TRP1                                       *((volatile unsigned char*)(0x1256081F48UL))
#define bFM4_HSSPI_WRCSDC7_CONT                                       *((volatile unsigned char*)(0x1256081F4CUL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA0                                  *((volatile unsigned char*)(0x1256081F60UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA1                                  *((volatile unsigned char*)(0x1256081F64UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA2                                  *((volatile unsigned char*)(0x1256081F68UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA3                                  *((volatile unsigned char*)(0x1256081F6CUL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA4                                  *((volatile unsigned char*)(0x1256081F70UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA5                                  *((volatile unsigned char*)(0x1256081F74UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA6                                  *((volatile unsigned char*)(0x1256081F78UL))
#define bFM4_HSSPI_WRCSDC7_WRCSDATA7                                  *((volatile unsigned char*)(0x1256081F7CUL))
#define bFM4_HSSPI_MID_MID0                                           *((volatile unsigned char*)(0x1256081F80UL))
#define bFM4_HSSPI_MID_MID1                                           *((volatile unsigned char*)(0x1256081F84UL))
#define bFM4_HSSPI_MID_MID2                                           *((volatile unsigned char*)(0x1256081F88UL))
#define bFM4_HSSPI_MID_MID3                                           *((volatile unsigned char*)(0x1256081F8CUL))
#define bFM4_HSSPI_MID_MID4                                           *((volatile unsigned char*)(0x1256081F90UL))
#define bFM4_HSSPI_MID_MID5                                           *((volatile unsigned char*)(0x1256081F94UL))
#define bFM4_HSSPI_MID_MID6                                           *((volatile unsigned char*)(0x1256081F98UL))
#define bFM4_HSSPI_MID_MID7                                           *((volatile unsigned char*)(0x1256081F9CUL))
#define bFM4_HSSPI_MID_MID8                                           *((volatile unsigned char*)(0x1256081FA0UL))
#define bFM4_HSSPI_MID_MID9                                           *((volatile unsigned char*)(0x1256081FA4UL))
#define bFM4_HSSPI_MID_MID10                                          *((volatile unsigned char*)(0x1256081FA8UL))
#define bFM4_HSSPI_MID_MID11                                          *((volatile unsigned char*)(0x1256081FACUL))
#define bFM4_HSSPI_MID_MID12                                          *((volatile unsigned char*)(0x1256081FB0UL))
#define bFM4_HSSPI_MID_MID13                                          *((volatile unsigned char*)(0x1256081FB4UL))
#define bFM4_HSSPI_MID_MID14                                          *((volatile unsigned char*)(0x1256081FB8UL))
#define bFM4_HSSPI_MID_MID15                                          *((volatile unsigned char*)(0x1256081FBCUL))
#define bFM4_HSSPI_MID_MID16                                          *((volatile unsigned char*)(0x1256081FC0UL))
#define bFM4_HSSPI_MID_MID17                                          *((volatile unsigned char*)(0x1256081FC4UL))
#define bFM4_HSSPI_MID_MID18                                          *((volatile unsigned char*)(0x1256081FC8UL))
#define bFM4_HSSPI_MID_MID19                                          *((volatile unsigned char*)(0x1256081FCCUL))
#define bFM4_HSSPI_MID_MID20                                          *((volatile unsigned char*)(0x1256081FD0UL))
#define bFM4_HSSPI_MID_MID21                                          *((volatile unsigned char*)(0x1256081FD4UL))
#define bFM4_HSSPI_MID_MID22                                          *((volatile unsigned char*)(0x1256081FD8UL))
#define bFM4_HSSPI_MID_MID23                                          *((volatile unsigned char*)(0x1256081FDCUL))
#define bFM4_HSSPI_MID_MID24                                          *((volatile unsigned char*)(0x1256081FE0UL))
#define bFM4_HSSPI_MID_MID25                                          *((volatile unsigned char*)(0x1256081FE4UL))
#define bFM4_HSSPI_MID_MID26                                          *((volatile unsigned char*)(0x1256081FE8UL))
#define bFM4_HSSPI_MID_MID27                                          *((volatile unsigned char*)(0x1256081FECUL))
#define bFM4_HSSPI_MID_MID28                                          *((volatile unsigned char*)(0x1256081FF0UL))
#define bFM4_HSSPI_MID_MID29                                          *((volatile unsigned char*)(0x1256081FF4UL))
#define bFM4_HSSPI_MID_MID30                                          *((volatile unsigned char*)(0x1256081FF8UL))
#define bFM4_HSSPI_MID_MID31                                          *((volatile unsigned char*)(0x1256081FFCUL))
#define bFM4_HSSPI_QDCLKR_QHDIV0                                      *((volatile unsigned char*)(0x1256088000UL))
#define bFM4_HSSPI_QDCLKR_QHDIV1                                      *((volatile unsigned char*)(0x1256088004UL))
#define bFM4_HSSPI_QDCLKR_QHDIV2                                      *((volatile unsigned char*)(0x1256088008UL))
#define bFM4_HSSPI_QDCLKR_QHDIV3                                      *((volatile unsigned char*)(0x125608800CUL))
#define bFM4_HSSPI_DBCNT_RXDBEN                                       *((volatile unsigned char*)(0x1256088080UL))
#define bFM4_HSSPI_DBCNT_TXDBEN                                       *((volatile unsigned char*)(0x1256088084UL))

/* HyperBus registers */
#define bFM4_HYPERBUS_CSR_RACT                                        *((volatile unsigned char*)(0x12560A0000UL))
#define bFM4_HYPERBUS_CSR_RDECERR                                     *((volatile unsigned char*)(0x12560A0020UL))
#define bFM4_HYPERBUS_CSR_RTRSERR                                     *((volatile unsigned char*)(0x12560A0024UL))
#define bFM4_HYPERBUS_CSR_RRSTOERR                                    *((volatile unsigned char*)(0x12560A0028UL))
#define bFM4_HYPERBUS_CSR_RDSSLALL                                    *((volatile unsigned char*)(0x12560A002CUL))
#define bFM4_HYPERBUS_CSR_WACT                                        *((volatile unsigned char*)(0x12560A0040UL))
#define bFM4_HYPERBUS_CSR_WDECERR                                     *((volatile unsigned char*)(0x12560A0060UL))
#define bFM4_HYPERBUS_CSR_WTRSERR                                     *((volatile unsigned char*)(0x12560A0064UL))
#define bFM4_HYPERBUS_CSR_WRSTOERR                                    *((volatile unsigned char*)(0x12560A0068UL))
#define bFM4_HYPERBUS_IEN_RPCINTE                                     *((volatile unsigned char*)(0x12560A0080UL))
#define bFM4_HYPERBUS_IEN_INTP                                        *((volatile unsigned char*)(0x12560A00FCUL))
#define bFM4_HYPERBUS_ISR_RPCINTS                                     *((volatile unsigned char*)(0x12560A0100UL))
#define bFM4_HYPERBUS_MBR0_MBR0                                       *((volatile unsigned char*)(0x12560A0200UL))
#define bFM4_HYPERBUS_MBR0_MBR1                                       *((volatile unsigned char*)(0x12560A0204UL))
#define bFM4_HYPERBUS_MBR0_MBR2                                       *((volatile unsigned char*)(0x12560A0208UL))
#define bFM4_HYPERBUS_MBR0_MBR3                                       *((volatile unsigned char*)(0x12560A020CUL))
#define bFM4_HYPERBUS_MBR0_MBR4                                       *((volatile unsigned char*)(0x12560A0210UL))
#define bFM4_HYPERBUS_MBR0_MBR5                                       *((volatile unsigned char*)(0x12560A0214UL))
#define bFM4_HYPERBUS_MBR0_MBR6                                       *((volatile unsigned char*)(0x12560A0218UL))
#define bFM4_HYPERBUS_MBR0_MBR7                                       *((volatile unsigned char*)(0x12560A021CUL))
#define bFM4_HYPERBUS_MBR0_MBR8                                       *((volatile unsigned char*)(0x12560A0220UL))
#define bFM4_HYPERBUS_MBR0_MBR9                                       *((volatile unsigned char*)(0x12560A0224UL))
#define bFM4_HYPERBUS_MBR0_MBR10                                      *((volatile unsigned char*)(0x12560A0228UL))
#define bFM4_HYPERBUS_MBR0_MBR11                                      *((volatile unsigned char*)(0x12560A022CUL))
#define bFM4_HYPERBUS_MBR0_MBR12                                      *((volatile unsigned char*)(0x12560A0230UL))
#define bFM4_HYPERBUS_MBR0_MBR13                                      *((volatile unsigned char*)(0x12560A0234UL))
#define bFM4_HYPERBUS_MBR0_MBR14                                      *((volatile unsigned char*)(0x12560A0238UL))
#define bFM4_HYPERBUS_MBR0_MBR15                                      *((volatile unsigned char*)(0x12560A023CUL))
#define bFM4_HYPERBUS_MBR0_MBR16                                      *((volatile unsigned char*)(0x12560A0240UL))
#define bFM4_HYPERBUS_MBR0_MBR17                                      *((volatile unsigned char*)(0x12560A0244UL))
#define bFM4_HYPERBUS_MBR0_MBR18                                      *((volatile unsigned char*)(0x12560A0248UL))
#define bFM4_HYPERBUS_MBR0_MBR19                                      *((volatile unsigned char*)(0x12560A024CUL))
#define bFM4_HYPERBUS_MBR0_MBR20                                      *((volatile unsigned char*)(0x12560A0250UL))
#define bFM4_HYPERBUS_MBR0_MBR21                                      *((volatile unsigned char*)(0x12560A0254UL))
#define bFM4_HYPERBUS_MBR0_MBR22                                      *((volatile unsigned char*)(0x12560A0258UL))
#define bFM4_HYPERBUS_MBR0_MBR23                                      *((volatile unsigned char*)(0x12560A025CUL))
#define bFM4_HYPERBUS_MBR0_MBR24                                      *((volatile unsigned char*)(0x12560A0260UL))
#define bFM4_HYPERBUS_MBR0_MBR25                                      *((volatile unsigned char*)(0x12560A0264UL))
#define bFM4_HYPERBUS_MBR0_MBR26                                      *((volatile unsigned char*)(0x12560A0268UL))
#define bFM4_HYPERBUS_MBR0_MBR27                                      *((volatile unsigned char*)(0x12560A026CUL))
#define bFM4_HYPERBUS_MBR0_MBR28                                      *((volatile unsigned char*)(0x12560A0270UL))
#define bFM4_HYPERBUS_MBR0_MBR29                                      *((volatile unsigned char*)(0x12560A0274UL))
#define bFM4_HYPERBUS_MBR0_MBR30                                      *((volatile unsigned char*)(0x12560A0278UL))
#define bFM4_HYPERBUS_MBR0_MBR31                                      *((volatile unsigned char*)(0x12560A027CUL))
#define bFM4_HYPERBUS_MBR1_MBR0                                       *((volatile unsigned char*)(0x12560A0280UL))
#define bFM4_HYPERBUS_MBR1_MBR1                                       *((volatile unsigned char*)(0x12560A0284UL))
#define bFM4_HYPERBUS_MBR1_MBR2                                       *((volatile unsigned char*)(0x12560A0288UL))
#define bFM4_HYPERBUS_MBR1_MBR3                                       *((volatile unsigned char*)(0x12560A028CUL))
#define bFM4_HYPERBUS_MBR1_MBR4                                       *((volatile unsigned char*)(0x12560A0290UL))
#define bFM4_HYPERBUS_MBR1_MBR5                                       *((volatile unsigned char*)(0x12560A0294UL))
#define bFM4_HYPERBUS_MBR1_MBR6                                       *((volatile unsigned char*)(0x12560A0298UL))
#define bFM4_HYPERBUS_MBR1_MBR7                                       *((volatile unsigned char*)(0x12560A029CUL))
#define bFM4_HYPERBUS_MBR1_MBR8                                       *((volatile unsigned char*)(0x12560A02A0UL))
#define bFM4_HYPERBUS_MBR1_MBR9                                       *((volatile unsigned char*)(0x12560A02A4UL))
#define bFM4_HYPERBUS_MBR1_MBR10                                      *((volatile unsigned char*)(0x12560A02A8UL))
#define bFM4_HYPERBUS_MBR1_MBR11                                      *((volatile unsigned char*)(0x12560A02ACUL))
#define bFM4_HYPERBUS_MBR1_MBR12                                      *((volatile unsigned char*)(0x12560A02B0UL))
#define bFM4_HYPERBUS_MBR1_MBR13                                      *((volatile unsigned char*)(0x12560A02B4UL))
#define bFM4_HYPERBUS_MBR1_MBR14                                      *((volatile unsigned char*)(0x12560A02B8UL))
#define bFM4_HYPERBUS_MBR1_MBR15                                      *((volatile unsigned char*)(0x12560A02BCUL))
#define bFM4_HYPERBUS_MBR1_MBR16                                      *((volatile unsigned char*)(0x12560A02C0UL))
#define bFM4_HYPERBUS_MBR1_MBR17                                      *((volatile unsigned char*)(0x12560A02C4UL))
#define bFM4_HYPERBUS_MBR1_MBR18                                      *((volatile unsigned char*)(0x12560A02C8UL))
#define bFM4_HYPERBUS_MBR1_MBR19                                      *((volatile unsigned char*)(0x12560A02CCUL))
#define bFM4_HYPERBUS_MBR1_MBR20                                      *((volatile unsigned char*)(0x12560A02D0UL))
#define bFM4_HYPERBUS_MBR1_MBR21                                      *((volatile unsigned char*)(0x12560A02D4UL))
#define bFM4_HYPERBUS_MBR1_MBR22                                      *((volatile unsigned char*)(0x12560A02D8UL))
#define bFM4_HYPERBUS_MBR1_MBR23                                      *((volatile unsigned char*)(0x12560A02DCUL))
#define bFM4_HYPERBUS_MBR1_MBR24                                      *((volatile unsigned char*)(0x12560A02E0UL))
#define bFM4_HYPERBUS_MBR1_MBR25                                      *((volatile unsigned char*)(0x12560A02E4UL))
#define bFM4_HYPERBUS_MBR1_MBR26                                      *((volatile unsigned char*)(0x12560A02E8UL))
#define bFM4_HYPERBUS_MBR1_MBR27                                      *((volatile unsigned char*)(0x12560A02ECUL))
#define bFM4_HYPERBUS_MBR1_MBR28                                      *((volatile unsigned char*)(0x12560A02F0UL))
#define bFM4_HYPERBUS_MBR1_MBR29                                      *((volatile unsigned char*)(0x12560A02F4UL))
#define bFM4_HYPERBUS_MBR1_MBR30                                      *((volatile unsigned char*)(0x12560A02F8UL))
#define bFM4_HYPERBUS_MBR1_MBR31                                      *((volatile unsigned char*)(0x12560A02FCUL))
#define bFM4_HYPERBUS_MCR0_WRAPSIZE0                                  *((volatile unsigned char*)(0x12560A0300UL))
#define bFM4_HYPERBUS_MCR0_WRAPSIZE1                                  *((volatile unsigned char*)(0x12560A0304UL))
#define bFM4_HYPERBUS_MCR0_DEVTYPE                                    *((volatile unsigned char*)(0x12560A0310UL))
#define bFM4_HYPERBUS_MCR0_CRT                                        *((volatile unsigned char*)(0x12560A0314UL))
#define bFM4_HYPERBUS_MCR0_ACS                                        *((volatile unsigned char*)(0x12560A0340UL))
#define bFM4_HYPERBUS_MCR0_CRMO                                       *((volatile unsigned char*)(0x12560A0344UL))
#define bFM4_HYPERBUS_MCR1_WRAPSIZE0                                  *((volatile unsigned char*)(0x12560A0380UL))
#define bFM4_HYPERBUS_MCR1_WRAPSIZE1                                  *((volatile unsigned char*)(0x12560A0384UL))
#define bFM4_HYPERBUS_MCR1_DEVTYPE                                    *((volatile unsigned char*)(0x12560A0390UL))
#define bFM4_HYPERBUS_MCR1_CRT                                        *((volatile unsigned char*)(0x12560A0394UL))
#define bFM4_HYPERBUS_MCR1_ACS                                        *((volatile unsigned char*)(0x12560A03C0UL))
#define bFM4_HYPERBUS_MCR1_CRMO                                       *((volatile unsigned char*)(0x12560A03C4UL))
#define bFM4_HYPERBUS_MTR0_LTCY0                                      *((volatile unsigned char*)(0x12560A0400UL))
#define bFM4_HYPERBUS_MTR0_LTCY1                                      *((volatile unsigned char*)(0x12560A0404UL))
#define bFM4_HYPERBUS_MTR0_LTCY2                                      *((volatile unsigned char*)(0x12560A0408UL))
#define bFM4_HYPERBUS_MTR0_LTCY3                                      *((volatile unsigned char*)(0x12560A040CUL))
#define bFM4_HYPERBUS_MTR0_WCSH0                                      *((volatile unsigned char*)(0x12560A0420UL))
#define bFM4_HYPERBUS_MTR0_WCSH1                                      *((volatile unsigned char*)(0x12560A0424UL))
#define bFM4_HYPERBUS_MTR0_WCSH2                                      *((volatile unsigned char*)(0x12560A0428UL))
#define bFM4_HYPERBUS_MTR0_WCSH3                                      *((volatile unsigned char*)(0x12560A042CUL))
#define bFM4_HYPERBUS_MTR0_RCSH0                                      *((volatile unsigned char*)(0x12560A0430UL))
#define bFM4_HYPERBUS_MTR0_RCSH1                                      *((volatile unsigned char*)(0x12560A0434UL))
#define bFM4_HYPERBUS_MTR0_RCSH2                                      *((volatile unsigned char*)(0x12560A0438UL))
#define bFM4_HYPERBUS_MTR0_RCSH3                                      *((volatile unsigned char*)(0x12560A043CUL))
#define bFM4_HYPERBUS_MTR0_WCSS0                                      *((volatile unsigned char*)(0x12560A0440UL))
#define bFM4_HYPERBUS_MTR0_WCSS1                                      *((volatile unsigned char*)(0x12560A0444UL))
#define bFM4_HYPERBUS_MTR0_WCSS2                                      *((volatile unsigned char*)(0x12560A0448UL))
#define bFM4_HYPERBUS_MTR0_WCSS3                                      *((volatile unsigned char*)(0x12560A044CUL))
#define bFM4_HYPERBUS_MTR0_RCSS0                                      *((volatile unsigned char*)(0x12560A0450UL))
#define bFM4_HYPERBUS_MTR0_RCSS1                                      *((volatile unsigned char*)(0x12560A0454UL))
#define bFM4_HYPERBUS_MTR0_RCSS2                                      *((volatile unsigned char*)(0x12560A0458UL))
#define bFM4_HYPERBUS_MTR0_RCSS3                                      *((volatile unsigned char*)(0x12560A045CUL))
#define bFM4_HYPERBUS_MTR0_WCSHI0                                     *((volatile unsigned char*)(0x12560A0460UL))
#define bFM4_HYPERBUS_MTR0_WCSHI1                                     *((volatile unsigned char*)(0x12560A0464UL))
#define bFM4_HYPERBUS_MTR0_WCSHI2                                     *((volatile unsigned char*)(0x12560A0468UL))
#define bFM4_HYPERBUS_MTR0_WCSHI3                                     *((volatile unsigned char*)(0x12560A046CUL))
#define bFM4_HYPERBUS_MTR0_RCSHI0                                     *((volatile unsigned char*)(0x12560A0470UL))
#define bFM4_HYPERBUS_MTR0_RCSHI1                                     *((volatile unsigned char*)(0x12560A0474UL))
#define bFM4_HYPERBUS_MTR0_RCSHI2                                     *((volatile unsigned char*)(0x12560A0478UL))
#define bFM4_HYPERBUS_MTR0_RCSHI3                                     *((volatile unsigned char*)(0x12560A047CUL))
#define bFM4_HYPERBUS_MTR1_LTCY0                                      *((volatile unsigned char*)(0x12560A0480UL))
#define bFM4_HYPERBUS_MTR1_LTCY1                                      *((volatile unsigned char*)(0x12560A0484UL))
#define bFM4_HYPERBUS_MTR1_LTCY2                                      *((volatile unsigned char*)(0x12560A0488UL))
#define bFM4_HYPERBUS_MTR1_LTCY3                                      *((volatile unsigned char*)(0x12560A048CUL))
#define bFM4_HYPERBUS_MTR1_WCSH0                                      *((volatile unsigned char*)(0x12560A04A0UL))
#define bFM4_HYPERBUS_MTR1_WCSH1                                      *((volatile unsigned char*)(0x12560A04A4UL))
#define bFM4_HYPERBUS_MTR1_WCSH2                                      *((volatile unsigned char*)(0x12560A04A8UL))
#define bFM4_HYPERBUS_MTR1_WCSH3                                      *((volatile unsigned char*)(0x12560A04ACUL))
#define bFM4_HYPERBUS_MTR1_RCSH0                                      *((volatile unsigned char*)(0x12560A04B0UL))
#define bFM4_HYPERBUS_MTR1_RCSH1                                      *((volatile unsigned char*)(0x12560A04B4UL))
#define bFM4_HYPERBUS_MTR1_RCSH2                                      *((volatile unsigned char*)(0x12560A04B8UL))
#define bFM4_HYPERBUS_MTR1_RCSH3                                      *((volatile unsigned char*)(0x12560A04BCUL))
#define bFM4_HYPERBUS_MTR1_WCSS0                                      *((volatile unsigned char*)(0x12560A04C0UL))
#define bFM4_HYPERBUS_MTR1_WCSS1                                      *((volatile unsigned char*)(0x12560A04C4UL))
#define bFM4_HYPERBUS_MTR1_WCSS2                                      *((volatile unsigned char*)(0x12560A04C8UL))
#define bFM4_HYPERBUS_MTR1_WCSS3                                      *((volatile unsigned char*)(0x12560A04CCUL))
#define bFM4_HYPERBUS_MTR1_RCSS0                                      *((volatile unsigned char*)(0x12560A04D0UL))
#define bFM4_HYPERBUS_MTR1_RCSS1                                      *((volatile unsigned char*)(0x12560A04D4UL))
#define bFM4_HYPERBUS_MTR1_RCSS2                                      *((volatile unsigned char*)(0x12560A04D8UL))
#define bFM4_HYPERBUS_MTR1_RCSS3                                      *((volatile unsigned char*)(0x12560A04DCUL))
#define bFM4_HYPERBUS_MTR1_WCSHI0                                     *((volatile unsigned char*)(0x12560A04E0UL))
#define bFM4_HYPERBUS_MTR1_WCSHI1                                     *((volatile unsigned char*)(0x12560A04E4UL))
#define bFM4_HYPERBUS_MTR1_WCSHI2                                     *((volatile unsigned char*)(0x12560A04E8UL))
#define bFM4_HYPERBUS_MTR1_WCSHI3                                     *((volatile unsigned char*)(0x12560A04ECUL))
#define bFM4_HYPERBUS_MTR1_RCSHI0                                     *((volatile unsigned char*)(0x12560A04F0UL))
#define bFM4_HYPERBUS_MTR1_RCSHI1                                     *((volatile unsigned char*)(0x12560A04F4UL))
#define bFM4_HYPERBUS_MTR1_RCSHI2                                     *((volatile unsigned char*)(0x12560A04F8UL))
#define bFM4_HYPERBUS_MTR1_RCSHI3                                     *((volatile unsigned char*)(0x12560A04FCUL))
#define bFM4_HYPERBUS_GPOR_GPO0                                       *((volatile unsigned char*)(0x12560A0500UL))
#define bFM4_HYPERBUS_GPOR_GPO1                                       *((volatile unsigned char*)(0x12560A0504UL))
#define bFM4_HYPERBUS_WPR_WP                                          *((volatile unsigned char*)(0x12560A0580UL))
#define bFM4_HYPERBUS_TEST_RVD                                        *((volatile unsigned char*)(0x12560A0600UL))

