MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* GDC SubSystem Control registers */
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK0                            *((volatile unsigned char*)(0x1256000000UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK1                            *((volatile unsigned char*)(0x1256000004UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK2                            *((volatile unsigned char*)(0x1256000008UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK3                            *((volatile unsigned char*)(0x125600000CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK4                            *((volatile unsigned char*)(0x1256000010UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK5                            *((volatile unsigned char*)(0x1256000014UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK6                            *((volatile unsigned char*)(0x1256000018UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK7                            *((volatile unsigned char*)(0x125600001CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK8                            *((volatile unsigned char*)(0x1256000020UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK9                            *((volatile unsigned char*)(0x1256000024UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK10                           *((volatile unsigned char*)(0x1256000028UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK11                           *((volatile unsigned char*)(0x125600002CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK12                           *((volatile unsigned char*)(0x1256000030UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK13                           *((volatile unsigned char*)(0x1256000034UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK14                           *((volatile unsigned char*)(0x1256000038UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK15                           *((volatile unsigned char*)(0x125600003CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK16                           *((volatile unsigned char*)(0x1256000040UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK17                           *((volatile unsigned char*)(0x1256000044UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK18                           *((volatile unsigned char*)(0x1256000048UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK19                           *((volatile unsigned char*)(0x125600004CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK20                           *((volatile unsigned char*)(0x1256000050UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK21                           *((volatile unsigned char*)(0x1256000054UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK22                           *((volatile unsigned char*)(0x1256000058UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK23                           *((volatile unsigned char*)(0x125600005CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK24                           *((volatile unsigned char*)(0x1256000060UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK25                           *((volatile unsigned char*)(0x1256000064UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK26                           *((volatile unsigned char*)(0x1256000068UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK27                           *((volatile unsigned char*)(0x125600006CUL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK28                           *((volatile unsigned char*)(0x1256000070UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK29                           *((volatile unsigned char*)(0x1256000074UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK30                           *((volatile unsigned char*)(0x1256000078UL))
#define bFM4_GDCSUB_LockUnlock_LOCKUNLOCK31                           *((volatile unsigned char*)(0x125600007CUL))
#define bFM4_GDCSUB_LockStatus_LOCKSTATUS                             *((volatile unsigned char*)(0x1256000080UL))
#define bFM4_GDCSUB_LockStatus_PRIVILEGESTATUS                        *((volatile unsigned char*)(0x1256000090UL))
#define bFM4_GDCSUB_LockStatus_FREEZSTATUS                            *((volatile unsigned char*)(0x12560000A0UL))
#define bFM4_GDCSUB_ConfigClockControl_CONFIGCLOCKSELECT0             *((volatile unsigned char*)(0x1256000180UL))
#define bFM4_GDCSUB_ConfigClockControl_CONFIGCLOCKSELECT1             *((volatile unsigned char*)(0x1256000184UL))
#define bFM4_GDCSUB_ConfigClockControl_CONFIGCLOCKSELECT2             *((volatile unsigned char*)(0x1256000188UL))
#define bFM4_GDCSUB_VRamInterruptEnable_VRAMINTERRUPTENABLESEC0       *((volatile unsigned char*)(0x1256000200UL))
#define bFM4_GDCSUB_VRamInterruptEnable_VRAMINTERRUPTENABLESEC1       *((volatile unsigned char*)(0x1256000204UL))
#define bFM4_GDCSUB_VRamInterruptClear_VRAMINTERRUPTCLEARSEC0         *((volatile unsigned char*)(0x1256000300UL))
#define bFM4_GDCSUB_VRamInterruptClear_VRAMINTERRUPTCLEARSEC1         *((volatile unsigned char*)(0x1256000304UL))
#define bFM4_GDCSUB_VRamInterruptStatus_VRAMINTERRUPTSTATUSSEC0       *((volatile unsigned char*)(0x1256000380UL))
#define bFM4_GDCSUB_VRamInterruptStatus_VRAMINTERRUPTSTATUSSEC1       *((volatile unsigned char*)(0x1256000384UL))
#define bFM4_GDCSUB_ExtFlashDevSelect_EXTFLASHDEVSELECT               *((volatile unsigned char*)(0x1256000400UL))
#define bFM4_GDCSUB_VRamRemapDisable_VRAMREMAPDISABLE                 *((volatile unsigned char*)(0x1256000480UL))
#define bFM4_GDCSUB_PanicSwitch_PANICSWITCH                           *((volatile unsigned char*)(0x1256000500UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT0                  *((volatile unsigned char*)(0x12560005A0UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT1                  *((volatile unsigned char*)(0x12560005A4UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT2                  *((volatile unsigned char*)(0x12560005A8UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT3                  *((volatile unsigned char*)(0x12560005ACUL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT4                  *((volatile unsigned char*)(0x12560005B0UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT5                  *((volatile unsigned char*)(0x12560005B4UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT6                  *((volatile unsigned char*)(0x12560005B8UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT7                  *((volatile unsigned char*)(0x12560005BCUL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT8                  *((volatile unsigned char*)(0x12560005C0UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT9                  *((volatile unsigned char*)(0x12560005C4UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT10                 *((volatile unsigned char*)(0x12560005C8UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT11                 *((volatile unsigned char*)(0x12560005CCUL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT12                 *((volatile unsigned char*)(0x12560005D0UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT13                 *((volatile unsigned char*)(0x12560005D4UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT14                 *((volatile unsigned char*)(0x12560005D8UL))
#define bFM4_GDCSUB_GDC_ClockDivider_GDCCLOCKSELECT15                 *((volatile unsigned char*)(0x12560005DCUL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE0                      *((volatile unsigned char*)(0x1256000600UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE1                      *((volatile unsigned char*)(0x1256000604UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE2                      *((volatile unsigned char*)(0x1256000608UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE3                      *((volatile unsigned char*)(0x125600060CUL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE4                      *((volatile unsigned char*)(0x1256000610UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE5                      *((volatile unsigned char*)(0x1256000614UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE6                      *((volatile unsigned char*)(0x1256000618UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE7                      *((volatile unsigned char*)(0x125600061CUL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE8                      *((volatile unsigned char*)(0x1256000620UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE9                      *((volatile unsigned char*)(0x1256000624UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE10                     *((volatile unsigned char*)(0x1256000628UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE11                     *((volatile unsigned char*)(0x125600062CUL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE12                     *((volatile unsigned char*)(0x1256000630UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE13                     *((volatile unsigned char*)(0x1256000634UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE14                     *((volatile unsigned char*)(0x1256000638UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE15                     *((volatile unsigned char*)(0x125600063CUL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE16                     *((volatile unsigned char*)(0x1256000640UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE17                     *((volatile unsigned char*)(0x1256000644UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKGE18                     *((volatile unsigned char*)(0x1256000648UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKQSPI                     *((volatile unsigned char*)(0x1256000660UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKSDRAM                    *((volatile unsigned char*)(0x1256000664UL))
#define bFM4_GDCSUB_WkupTriggerMask_WTRIGMASKRPC                      *((volatile unsigned char*)(0x1256000668UL))
#define bFM4_GDCSUB_ClockDomainStatus_DSPCLOCKDOMAINREADY             *((volatile unsigned char*)(0x1256000680UL))
#define bFM4_GDCSUB_ClockDomainStatus_SDRAMCLOCKDOMAINREADY           *((volatile unsigned char*)(0x1256000684UL))
#define bFM4_GDCSUB_ClockDomainStatus_RPCCLOCKDOMAINREADY             *((volatile unsigned char*)(0x1256000688UL))
#define bFM4_GDCSUB_ClockDomainStatus_HSSPICLOCKDOMAINREADY           *((volatile unsigned char*)(0x125600068CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK0                    *((volatile unsigned char*)(0x1256000800UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK1                    *((volatile unsigned char*)(0x1256000804UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK2                    *((volatile unsigned char*)(0x1256000808UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK3                    *((volatile unsigned char*)(0x125600080CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK4                    *((volatile unsigned char*)(0x1256000810UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK5                    *((volatile unsigned char*)(0x1256000814UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK6                    *((volatile unsigned char*)(0x1256000818UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK7                    *((volatile unsigned char*)(0x125600081CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK8                    *((volatile unsigned char*)(0x1256000820UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK9                    *((volatile unsigned char*)(0x1256000824UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK10                   *((volatile unsigned char*)(0x1256000828UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK11                   *((volatile unsigned char*)(0x125600082CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK12                   *((volatile unsigned char*)(0x1256000830UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK13                   *((volatile unsigned char*)(0x1256000834UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK14                   *((volatile unsigned char*)(0x1256000838UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK15                   *((volatile unsigned char*)(0x125600083CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK16                   *((volatile unsigned char*)(0x1256000840UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK17                   *((volatile unsigned char*)(0x1256000844UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK18                   *((volatile unsigned char*)(0x1256000848UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK19                   *((volatile unsigned char*)(0x125600084CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK20                   *((volatile unsigned char*)(0x1256000850UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK21                   *((volatile unsigned char*)(0x1256000854UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK22                   *((volatile unsigned char*)(0x1256000858UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK23                   *((volatile unsigned char*)(0x125600085CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK24                   *((volatile unsigned char*)(0x1256000860UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK25                   *((volatile unsigned char*)(0x1256000864UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK26                   *((volatile unsigned char*)(0x1256000868UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK27                   *((volatile unsigned char*)(0x125600086CUL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK28                   *((volatile unsigned char*)(0x1256000870UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK29                   *((volatile unsigned char*)(0x1256000874UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK30                   *((volatile unsigned char*)(0x1256000878UL))
#define bFM4_GDCSUB_dsp_LockUnlock_DSP_LOCKUNLOCK31                   *((volatile unsigned char*)(0x125600087CUL))
#define bFM4_GDCSUB_dsp_LockStatus_DSP_LOCKSTATUS                     *((volatile unsigned char*)(0x1256000880UL))
#define bFM4_GDCSUB_dsp_LockStatus_DSP_PRIVILEGESTATUS                *((volatile unsigned char*)(0x1256000890UL))
#define bFM4_GDCSUB_dsp_LockStatus_DSP_FREEZESTATUS                   *((volatile unsigned char*)(0x12560008A0UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER0              *((volatile unsigned char*)(0x1256000920UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER1              *((volatile unsigned char*)(0x1256000924UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER2              *((volatile unsigned char*)(0x1256000928UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER3              *((volatile unsigned char*)(0x125600092CUL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER4              *((volatile unsigned char*)(0x1256000930UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER5              *((volatile unsigned char*)(0x1256000934UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER6              *((volatile unsigned char*)(0x1256000938UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER7              *((volatile unsigned char*)(0x125600093CUL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER8              *((volatile unsigned char*)(0x1256000940UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER9              *((volatile unsigned char*)(0x1256000944UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER10             *((volatile unsigned char*)(0x1256000948UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER11             *((volatile unsigned char*)(0x125600094CUL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER12             *((volatile unsigned char*)(0x1256000950UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER13             *((volatile unsigned char*)(0x1256000954UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER14             *((volatile unsigned char*)(0x1256000958UL))
#define bFM4_GDCSUB_dsp0_ClockDivider_DSP0_CLOCKDIVIDER15             *((volatile unsigned char*)(0x125600095CUL))
#define bFM4_GDCSUB_dsp0_DomainControl_DSP0_CLOCKENABLE               *((volatile unsigned char*)(0x1256000980UL))
#define bFM4_GDCSUB_dsp0_DomainControl_DSP0_SOFTWARERESET             *((volatile unsigned char*)(0x12560009C0UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKINVERT                  *((volatile unsigned char*)(0x1256000A00UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET0                 *((volatile unsigned char*)(0x1256000A40UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET1                 *((volatile unsigned char*)(0x1256000A44UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET2                 *((volatile unsigned char*)(0x1256000A48UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET3                 *((volatile unsigned char*)(0x1256000A4CUL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET4                 *((volatile unsigned char*)(0x1256000A50UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET5                 *((volatile unsigned char*)(0x1256000A54UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET6                 *((volatile unsigned char*)(0x1256000A58UL))
#define bFM4_GDCSUB_dsp0_ClockShift_DSP0_CLOCKOFFSET7                 *((volatile unsigned char*)(0x1256000A5CUL))
#define bFM4_GDCSUB_dsp0_PowerEnControl_POWER_ENABLE                  *((volatile unsigned char*)(0x1256000B00UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK0                *((volatile unsigned char*)(0x1256000B80UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK1                *((volatile unsigned char*)(0x1256000B84UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK2                *((volatile unsigned char*)(0x1256000B88UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK3                *((volatile unsigned char*)(0x1256000B8CUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK4                *((volatile unsigned char*)(0x1256000B90UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK5                *((volatile unsigned char*)(0x1256000B94UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK6                *((volatile unsigned char*)(0x1256000B98UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK7                *((volatile unsigned char*)(0x1256000B9CUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK8                *((volatile unsigned char*)(0x1256000BA0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK9                *((volatile unsigned char*)(0x1256000BA4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK10               *((volatile unsigned char*)(0x1256000BA8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK11               *((volatile unsigned char*)(0x1256000BACUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK12               *((volatile unsigned char*)(0x1256000BB0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK13               *((volatile unsigned char*)(0x1256000BB4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK14               *((volatile unsigned char*)(0x1256000BB8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK15               *((volatile unsigned char*)(0x1256000BBCUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK16               *((volatile unsigned char*)(0x1256000BC0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK17               *((volatile unsigned char*)(0x1256000BC4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK18               *((volatile unsigned char*)(0x1256000BC8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK19               *((volatile unsigned char*)(0x1256000BCCUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK20               *((volatile unsigned char*)(0x1256000BD0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK21               *((volatile unsigned char*)(0x1256000BD4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK22               *((volatile unsigned char*)(0x1256000BD8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK23               *((volatile unsigned char*)(0x1256000BDCUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK24               *((volatile unsigned char*)(0x1256000BE0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK25               *((volatile unsigned char*)(0x1256000BE4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK26               *((volatile unsigned char*)(0x1256000BE8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK27               *((volatile unsigned char*)(0x1256000BECUL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK28               *((volatile unsigned char*)(0x1256000BF0UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK29               *((volatile unsigned char*)(0x1256000BF4UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK30               *((volatile unsigned char*)(0x1256000BF8UL))
#define bFM4_GDCSUB_dsp0_ClockGateModeLock_LOCKUNLOCK31               *((volatile unsigned char*)(0x1256000BFCUL))
#define bFM4_GDCSUB_dsp0_ClockGateControl_CLOCKGATE_ENABLE            *((volatile unsigned char*)(0x1256000C00UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER0          *((volatile unsigned char*)(0x1256000F20UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER1          *((volatile unsigned char*)(0x1256000F24UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER2          *((volatile unsigned char*)(0x1256000F28UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER3          *((volatile unsigned char*)(0x1256000F2CUL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER4          *((volatile unsigned char*)(0x1256000F30UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER5          *((volatile unsigned char*)(0x1256000F34UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER6          *((volatile unsigned char*)(0x1256000F38UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER7          *((volatile unsigned char*)(0x1256000F3CUL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER8          *((volatile unsigned char*)(0x1256000F40UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER9          *((volatile unsigned char*)(0x1256000F44UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER10         *((volatile unsigned char*)(0x1256000F48UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER11         *((volatile unsigned char*)(0x1256000F4CUL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER12         *((volatile unsigned char*)(0x1256000F50UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER13         *((volatile unsigned char*)(0x1256000F54UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER14         *((volatile unsigned char*)(0x1256000F58UL))
#define bFM4_GDCSUB_SDRAMC_ClockDivider_SDRAMC_CLOCKDIVIDER15         *((volatile unsigned char*)(0x1256000F5CUL))
#define bFM4_GDCSUB_SDRAMC_DomainControl_SDRAMC_CLOCKENABLE           *((volatile unsigned char*)(0x1256000F80UL))
#define bFM4_GDCSUB_SDRAMC_DomainControl_SDRAMC_SOFTWARERESET         *((volatile unsigned char*)(0x1256000FC0UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER0          *((volatile unsigned char*)(0x1256001020UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER1          *((volatile unsigned char*)(0x1256001024UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER2          *((volatile unsigned char*)(0x1256001028UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER3          *((volatile unsigned char*)(0x125600102CUL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER4          *((volatile unsigned char*)(0x1256001030UL))
