MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER5          *((volatile unsigned char*)(0x1256001034UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER6          *((volatile unsigned char*)(0x1256001038UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER7          *((volatile unsigned char*)(0x125600103CUL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER8          *((volatile unsigned char*)(0x1256001040UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER9          *((volatile unsigned char*)(0x1256001044UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER10         *((volatile unsigned char*)(0x1256001048UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER11         *((volatile unsigned char*)(0x125600104CUL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER12         *((volatile unsigned char*)(0x1256001050UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER13         *((volatile unsigned char*)(0x1256001054UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER14         *((volatile unsigned char*)(0x1256001058UL))
#define bFM4_GDCSUB_HSSPIC_ClockDivider_HSSPIC_CLOCKDIVIDER15         *((volatile unsigned char*)(0x125600105CUL))
#define bFM4_GDCSUB_HSSPIC_DomainControl_HSSPIC_CLOCKENABLE           *((volatile unsigned char*)(0x1256001080UL))
#define bFM4_GDCSUB_HSSPIC_DomainControl_HSSPIC_SOFTWARERESET         *((volatile unsigned char*)(0x12560010C0UL))
#define bFM4_GDCSUB_RPCC_ClockDivider_RPCC_CLOCKDIVIDER0              *((volatile unsigned char*)(0x1256001100UL))
#define bFM4_GDCSUB_RPCC_ClockDivider_RPCC_CLOCKDIVIDER1              *((volatile unsigned char*)(0x1256001104UL))
#define bFM4_GDCSUB_RPCC_ClockDivider_RPCC_CLOCKDIVIDER2              *((volatile unsigned char*)(0x1256001108UL))
#define bFM4_GDCSUB_RPCC_DomainControl_RPCC_CLOCKENABLE               *((volatile unsigned char*)(0x1256001180UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK0                  *((volatile unsigned char*)(0x1256002000UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK1                  *((volatile unsigned char*)(0x1256002004UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK2                  *((volatile unsigned char*)(0x1256002008UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK3                  *((volatile unsigned char*)(0x125600200CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK4                  *((volatile unsigned char*)(0x1256002010UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK5                  *((volatile unsigned char*)(0x1256002014UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK6                  *((volatile unsigned char*)(0x1256002018UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK7                  *((volatile unsigned char*)(0x125600201CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK8                  *((volatile unsigned char*)(0x1256002020UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK9                  *((volatile unsigned char*)(0x1256002024UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK10                 *((volatile unsigned char*)(0x1256002028UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK11                 *((volatile unsigned char*)(0x125600202CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK12                 *((volatile unsigned char*)(0x1256002030UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK13                 *((volatile unsigned char*)(0x1256002034UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK14                 *((volatile unsigned char*)(0x1256002038UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK15                 *((volatile unsigned char*)(0x125600203CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK16                 *((volatile unsigned char*)(0x1256002040UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK17                 *((volatile unsigned char*)(0x1256002044UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK18                 *((volatile unsigned char*)(0x1256002048UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK19                 *((volatile unsigned char*)(0x125600204CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK20                 *((volatile unsigned char*)(0x1256002050UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK21                 *((volatile unsigned char*)(0x1256002054UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK22                 *((volatile unsigned char*)(0x1256002058UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK23                 *((volatile unsigned char*)(0x125600205CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK24                 *((volatile unsigned char*)(0x1256002060UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK25                 *((volatile unsigned char*)(0x1256002064UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK26                 *((volatile unsigned char*)(0x1256002068UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK27                 *((volatile unsigned char*)(0x125600206CUL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK28                 *((volatile unsigned char*)(0x1256002070UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK29                 *((volatile unsigned char*)(0x1256002074UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK30                 *((volatile unsigned char*)(0x1256002078UL))
#define bFM4_GDCSUB_vram_LockUnlock_VRAM_LOCKUNLOCK31                 *((volatile unsigned char*)(0x125600207CUL))
#define bFM4_GDCSUB_vram_LockStatus_VRAM_LOCKSTATUS                   *((volatile unsigned char*)(0x1256002080UL))
#define bFM4_GDCSUB_vram_LockStatus_VRAM_PRIVILEGESTATUS              *((volatile unsigned char*)(0x1256002090UL))
#define bFM4_GDCSUB_vram_LockStatus_VRAM_FREEZESTATUS                 *((volatile unsigned char*)(0x12560020A0UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT0                *((volatile unsigned char*)(0x1256002100UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT1                *((volatile unsigned char*)(0x1256002104UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT2                *((volatile unsigned char*)(0x1256002108UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT3                *((volatile unsigned char*)(0x125600210CUL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT4                *((volatile unsigned char*)(0x1256002110UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT5                *((volatile unsigned char*)(0x1256002114UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT6                *((volatile unsigned char*)(0x1256002118UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT7                *((volatile unsigned char*)(0x125600211CUL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT8                *((volatile unsigned char*)(0x1256002120UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT9                *((volatile unsigned char*)(0x1256002124UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT10               *((volatile unsigned char*)(0x1256002128UL))
#define bFM4_GDCSUB_vram_sram_select_VRAM_SRAM_SELECT11               *((volatile unsigned char*)(0x125600212CUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S00              *((volatile unsigned char*)(0x1256002780UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S01              *((volatile unsigned char*)(0x1256002784UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S02              *((volatile unsigned char*)(0x1256002788UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S03              *((volatile unsigned char*)(0x125600278CUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S04              *((volatile unsigned char*)(0x1256002790UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S05              *((volatile unsigned char*)(0x1256002794UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S06              *((volatile unsigned char*)(0x1256002798UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S07              *((volatile unsigned char*)(0x125600279CUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S08              *((volatile unsigned char*)(0x12560027A0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S09              *((volatile unsigned char*)(0x12560027A4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S010             *((volatile unsigned char*)(0x12560027A8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S011             *((volatile unsigned char*)(0x12560027ACUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S012             *((volatile unsigned char*)(0x12560027B0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S013             *((volatile unsigned char*)(0x12560027B4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S014             *((volatile unsigned char*)(0x12560027B8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S015             *((volatile unsigned char*)(0x12560027BCUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S016             *((volatile unsigned char*)(0x12560027C0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S017             *((volatile unsigned char*)(0x12560027C4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S018             *((volatile unsigned char*)(0x12560027C8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S019             *((volatile unsigned char*)(0x12560027CCUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S020             *((volatile unsigned char*)(0x12560027D0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S021             *((volatile unsigned char*)(0x12560027D4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S022             *((volatile unsigned char*)(0x12560027D8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S023             *((volatile unsigned char*)(0x12560027DCUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S024             *((volatile unsigned char*)(0x12560027E0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S025             *((volatile unsigned char*)(0x12560027E4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S026             *((volatile unsigned char*)(0x12560027E8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S027             *((volatile unsigned char*)(0x12560027ECUL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S028             *((volatile unsigned char*)(0x12560027F0UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S029             *((volatile unsigned char*)(0x12560027F4UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S030             *((volatile unsigned char*)(0x12560027F8UL))
#define bFM4_GDCSUB_vram_aberraddr_s0_VRAM_ABERRADDR_S031             *((volatile unsigned char*)(0x12560027FCUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S10              *((volatile unsigned char*)(0x1256002800UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S11              *((volatile unsigned char*)(0x1256002804UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S12              *((volatile unsigned char*)(0x1256002808UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S13              *((volatile unsigned char*)(0x125600280CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S14              *((volatile unsigned char*)(0x1256002810UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S15              *((volatile unsigned char*)(0x1256002814UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S16              *((volatile unsigned char*)(0x1256002818UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S17              *((volatile unsigned char*)(0x125600281CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S18              *((volatile unsigned char*)(0x1256002820UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S19              *((volatile unsigned char*)(0x1256002824UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S110             *((volatile unsigned char*)(0x1256002828UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S111             *((volatile unsigned char*)(0x125600282CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S112             *((volatile unsigned char*)(0x1256002830UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S113             *((volatile unsigned char*)(0x1256002834UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S114             *((volatile unsigned char*)(0x1256002838UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S115             *((volatile unsigned char*)(0x125600283CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S116             *((volatile unsigned char*)(0x1256002840UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S117             *((volatile unsigned char*)(0x1256002844UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S118             *((volatile unsigned char*)(0x1256002848UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S119             *((volatile unsigned char*)(0x125600284CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S120             *((volatile unsigned char*)(0x1256002850UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S121             *((volatile unsigned char*)(0x1256002854UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S122             *((volatile unsigned char*)(0x1256002858UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S123             *((volatile unsigned char*)(0x125600285CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S124             *((volatile unsigned char*)(0x1256002860UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S125             *((volatile unsigned char*)(0x1256002864UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S126             *((volatile unsigned char*)(0x1256002868UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S127             *((volatile unsigned char*)(0x125600286CUL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S128             *((volatile unsigned char*)(0x1256002870UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S129             *((volatile unsigned char*)(0x1256002874UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S130             *((volatile unsigned char*)(0x1256002878UL))
#define bFM4_GDCSUB_vram_aberraddr_s1_VRAM_ABERRADDR_S131             *((volatile unsigned char*)(0x125600287CUL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S0_WRITE0     *((volatile unsigned char*)(0x1256002900UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S0_WRITE1     *((volatile unsigned char*)(0x1256002904UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S0_READ0      *((volatile unsigned char*)(0x1256002908UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S0_READ1      *((volatile unsigned char*)(0x125600290CUL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S1_READ0      *((volatile unsigned char*)(0x1256002910UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S1_READ1      *((volatile unsigned char*)(0x1256002914UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S2_READ0      *((volatile unsigned char*)(0x1256002918UL))
#define bFM4_GDCSUB_vram_arbiter_priority_VRAM_PRIORITY_S2_READ1      *((volatile unsigned char*)(0x125600291CUL))

