MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2D35J0AGV2000A/mcu.h
/* GDC SDRAM Controller registers */
#define bFM4_SDRAMC_SDMODE_SDON                                       *((volatile unsigned char*)(0x1256062000UL))
#define bFM4_SDRAMC_SDMODE_PDON                                       *((volatile unsigned char*)(0x1256062004UL))
#define bFM4_SDRAMC_SDMODE_ROFF                                       *((volatile unsigned char*)(0x1256062008UL))
#define bFM4_SDRAMC_SDMODE_CASEL0                                     *((volatile unsigned char*)(0x1256062010UL))
#define bFM4_SDRAMC_SDMODE_CASEL1                                     *((volatile unsigned char*)(0x1256062014UL))
#define bFM4_SDRAMC_SDMODE_RASEL0                                     *((volatile unsigned char*)(0x1256062020UL))
#define bFM4_SDRAMC_SDMODE_RASEL1                                     *((volatile unsigned char*)(0x1256062024UL))
#define bFM4_SDRAMC_SDMODE_RASEL2                                     *((volatile unsigned char*)(0x1256062028UL))
#define bFM4_SDRAMC_SDMODE_RASEL3                                     *((volatile unsigned char*)(0x125606202CUL))
#define bFM4_SDRAMC_SDMODE_BASEL0                                     *((volatile unsigned char*)(0x1256062030UL))
#define bFM4_SDRAMC_SDMODE_BASEL1                                     *((volatile unsigned char*)(0x1256062034UL))
#define bFM4_SDRAMC_SDMODE_BASEL2                                     *((volatile unsigned char*)(0x1256062038UL))
#define bFM4_SDRAMC_SDMODE_BASEL3                                     *((volatile unsigned char*)(0x125606203CUL))
#define bFM4_SDRAMC_SDMODE_MSDCLKOFF                                  *((volatile unsigned char*)(0x1256062040UL))
#define bFM4_SDRAMC_REFTIM_REFC0                                      *((volatile unsigned char*)(0x1256062080UL))
#define bFM4_SDRAMC_REFTIM_REFC1                                      *((volatile unsigned char*)(0x1256062084UL))
#define bFM4_SDRAMC_REFTIM_REFC2                                      *((volatile unsigned char*)(0x1256062088UL))
#define bFM4_SDRAMC_REFTIM_REFC3                                      *((volatile unsigned char*)(0x125606208CUL))
#define bFM4_SDRAMC_REFTIM_REFC4                                      *((volatile unsigned char*)(0x1256062090UL))
#define bFM4_SDRAMC_REFTIM_REFC5                                      *((volatile unsigned char*)(0x1256062094UL))
#define bFM4_SDRAMC_REFTIM_REFC6                                      *((volatile unsigned char*)(0x1256062098UL))
#define bFM4_SDRAMC_REFTIM_REFC7                                      *((volatile unsigned char*)(0x125606209CUL))
#define bFM4_SDRAMC_REFTIM_REFC8                                      *((volatile unsigned char*)(0x12560620A0UL))
#define bFM4_SDRAMC_REFTIM_REFC9                                      *((volatile unsigned char*)(0x12560620A4UL))
#define bFM4_SDRAMC_REFTIM_REFC10                                     *((volatile unsigned char*)(0x12560620A8UL))
#define bFM4_SDRAMC_REFTIM_REFC11                                     *((volatile unsigned char*)(0x12560620ACUL))
#define bFM4_SDRAMC_REFTIM_REFC12                                     *((volatile unsigned char*)(0x12560620B0UL))
#define bFM4_SDRAMC_REFTIM_REFC13                                     *((volatile unsigned char*)(0x12560620B4UL))
#define bFM4_SDRAMC_REFTIM_REFC14                                     *((volatile unsigned char*)(0x12560620B8UL))
#define bFM4_SDRAMC_REFTIM_REFC15                                     *((volatile unsigned char*)(0x12560620BCUL))
#define bFM4_SDRAMC_REFTIM_NREF0                                      *((volatile unsigned char*)(0x12560620C0UL))
#define bFM4_SDRAMC_REFTIM_NREF1                                      *((volatile unsigned char*)(0x12560620C4UL))
#define bFM4_SDRAMC_REFTIM_NREF2                                      *((volatile unsigned char*)(0x12560620C8UL))
#define bFM4_SDRAMC_REFTIM_NREF3                                      *((volatile unsigned char*)(0x12560620CCUL))
#define bFM4_SDRAMC_REFTIM_NREF4                                      *((volatile unsigned char*)(0x12560620D0UL))
#define bFM4_SDRAMC_REFTIM_NREF5                                      *((volatile unsigned char*)(0x12560620D4UL))
#define bFM4_SDRAMC_REFTIM_NREF6                                      *((volatile unsigned char*)(0x12560620D8UL))
#define bFM4_SDRAMC_REFTIM_NREF7                                      *((volatile unsigned char*)(0x12560620DCUL))
#define bFM4_SDRAMC_REFTIM_PREF                                       *((volatile unsigned char*)(0x12560620E0UL))
#define bFM4_SDRAMC_PWRDWN_PDC0                                       *((volatile unsigned char*)(0x1256062100UL))
#define bFM4_SDRAMC_PWRDWN_PDC1                                       *((volatile unsigned char*)(0x1256062104UL))
#define bFM4_SDRAMC_PWRDWN_PDC2                                       *((volatile unsigned char*)(0x1256062108UL))
#define bFM4_SDRAMC_PWRDWN_PDC3                                       *((volatile unsigned char*)(0x125606210CUL))
#define bFM4_SDRAMC_PWRDWN_PDC4                                       *((volatile unsigned char*)(0x1256062110UL))
#define bFM4_SDRAMC_PWRDWN_PDC5                                       *((volatile unsigned char*)(0x1256062114UL))
#define bFM4_SDRAMC_PWRDWN_PDC6                                       *((volatile unsigned char*)(0x1256062118UL))
#define bFM4_SDRAMC_PWRDWN_PDC7                                       *((volatile unsigned char*)(0x125606211CUL))
#define bFM4_SDRAMC_PWRDWN_PDC8                                       *((volatile unsigned char*)(0x1256062120UL))
#define bFM4_SDRAMC_PWRDWN_PDC9                                       *((volatile unsigned char*)(0x1256062124UL))
#define bFM4_SDRAMC_PWRDWN_PDC10                                      *((volatile unsigned char*)(0x1256062128UL))
#define bFM4_SDRAMC_PWRDWN_PDC11                                      *((volatile unsigned char*)(0x125606212CUL))
#define bFM4_SDRAMC_PWRDWN_PDC12                                      *((volatile unsigned char*)(0x1256062130UL))
#define bFM4_SDRAMC_PWRDWN_PDC13                                      *((volatile unsigned char*)(0x1256062134UL))
#define bFM4_SDRAMC_PWRDWN_PDC14                                      *((volatile unsigned char*)(0x1256062138UL))
#define bFM4_SDRAMC_PWRDWN_PDC15                                      *((volatile unsigned char*)(0x125606213CUL))
#define bFM4_SDRAMC_SDTIM_CL0                                         *((volatile unsigned char*)(0x1256062180UL))
#define bFM4_SDRAMC_SDTIM_CL1                                         *((volatile unsigned char*)(0x1256062184UL))
#define bFM4_SDRAMC_SDTIM_TRC0                                        *((volatile unsigned char*)(0x1256062190UL))
#define bFM4_SDRAMC_SDTIM_TRC1                                        *((volatile unsigned char*)(0x1256062194UL))
#define bFM4_SDRAMC_SDTIM_TRC2                                        *((volatile unsigned char*)(0x1256062198UL))
#define bFM4_SDRAMC_SDTIM_TRC3                                        *((volatile unsigned char*)(0x125606219CUL))
#define bFM4_SDRAMC_SDTIM_TRP0                                        *((volatile unsigned char*)(0x12560621A0UL))
#define bFM4_SDRAMC_SDTIM_TRP1                                        *((volatile unsigned char*)(0x12560621A4UL))
#define bFM4_SDRAMC_SDTIM_TRP2                                        *((volatile unsigned char*)(0x12560621A8UL))
#define bFM4_SDRAMC_SDTIM_TRP3                                        *((volatile unsigned char*)(0x12560621ACUL))
#define bFM4_SDRAMC_SDTIM_TRCD0                                       *((volatile unsigned char*)(0x12560621B0UL))
#define bFM4_SDRAMC_SDTIM_TRCD1                                       *((volatile unsigned char*)(0x12560621B4UL))
#define bFM4_SDRAMC_SDTIM_TRCD2                                       *((volatile unsigned char*)(0x12560621B8UL))
#define bFM4_SDRAMC_SDTIM_TRCD3                                       *((volatile unsigned char*)(0x12560621BCUL))
#define bFM4_SDRAMC_SDTIM_TRAS0                                       *((volatile unsigned char*)(0x12560621C0UL))
#define bFM4_SDRAMC_SDTIM_TRAS1                                       *((volatile unsigned char*)(0x12560621C4UL))
#define bFM4_SDRAMC_SDTIM_TRAS2                                       *((volatile unsigned char*)(0x12560621C8UL))
#define bFM4_SDRAMC_SDTIM_TRAS3                                       *((volatile unsigned char*)(0x12560621CCUL))
#define bFM4_SDRAMC_SDTIM_TREFC0                                      *((volatile unsigned char*)(0x12560621D0UL))
#define bFM4_SDRAMC_SDTIM_TREFC1                                      *((volatile unsigned char*)(0x12560621D4UL))
#define bFM4_SDRAMC_SDTIM_TREFC2                                      *((volatile unsigned char*)(0x12560621D8UL))
#define bFM4_SDRAMC_SDTIM_TREFC3                                      *((volatile unsigned char*)(0x12560621DCUL))
#define bFM4_SDRAMC_SDTIM_TDPL0                                       *((volatile unsigned char*)(0x12560621E0UL))
#define bFM4_SDRAMC_SDTIM_TDPL1                                       *((volatile unsigned char*)(0x12560621E4UL))
#define bFM4_SDRAMC_SDTIM_BOFF                                        *((volatile unsigned char*)(0x12560621FCUL))
#define bFM4_SDRAMC_SDCMD_SDAD0                                       *((volatile unsigned char*)(0x1256062200UL))
#define bFM4_SDRAMC_SDCMD_SDAD1                                       *((volatile unsigned char*)(0x1256062204UL))
#define bFM4_SDRAMC_SDCMD_SDAD2                                       *((volatile unsigned char*)(0x1256062208UL))
#define bFM4_SDRAMC_SDCMD_SDAD3                                       *((volatile unsigned char*)(0x125606220CUL))
#define bFM4_SDRAMC_SDCMD_SDAD4                                       *((volatile unsigned char*)(0x1256062210UL))
#define bFM4_SDRAMC_SDCMD_SDAD5                                       *((volatile unsigned char*)(0x1256062214UL))
#define bFM4_SDRAMC_SDCMD_SDAD6                                       *((volatile unsigned char*)(0x1256062218UL))
#define bFM4_SDRAMC_SDCMD_SDAD7                                       *((volatile unsigned char*)(0x125606221CUL))
#define bFM4_SDRAMC_SDCMD_SDAD8                                       *((volatile unsigned char*)(0x1256062220UL))
#define bFM4_SDRAMC_SDCMD_SDAD9                                       *((volatile unsigned char*)(0x1256062224UL))
#define bFM4_SDRAMC_SDCMD_SDAD10                                      *((volatile unsigned char*)(0x1256062228UL))
#define bFM4_SDRAMC_SDCMD_SDAD11                                      *((volatile unsigned char*)(0x125606222CUL))
#define bFM4_SDRAMC_SDCMD_SDAD12                                      *((volatile unsigned char*)(0x1256062230UL))
#define bFM4_SDRAMC_SDCMD_SDAD13                                      *((volatile unsigned char*)(0x1256062234UL))
#define bFM4_SDRAMC_SDCMD_SDAD14                                      *((volatile unsigned char*)(0x1256062238UL))
#define bFM4_SDRAMC_SDCMD_SDAD15                                      *((volatile unsigned char*)(0x125606223CUL))
#define bFM4_SDRAMC_SDCMD_SDWE                                        *((volatile unsigned char*)(0x1256062240UL))
#define bFM4_SDRAMC_SDCMD_SDCAS                                       *((volatile unsigned char*)(0x1256062244UL))
#define bFM4_SDRAMC_SDCMD_SDRAS                                       *((volatile unsigned char*)(0x1256062248UL))
#define bFM4_SDRAMC_SDCMD_SDCS                                        *((volatile unsigned char*)(0x125606224CUL))
#define bFM4_SDRAMC_SDCMD_SDCKE                                       *((volatile unsigned char*)(0x1256062250UL))
#define bFM4_SDRAMC_SDCMD_PEND                                        *((volatile unsigned char*)(0x125606227CUL))

#ifdef __cplusplus
}
#endif

#endif /* _S6E2D3_H_ */
